{"results":[{"summary":"The overall trend for this stock is neutral, last close price of 396.66 was lower than the open price of 396.9. The Bollinger Bands show that the stock has been trending downwards, with the upper band at 403.88, the lower band at 390.77 and the stock price towards the bottom of the range. The MACD line is below the signal line, and the histogram is negative, indicating a bearish trend. The RSI is currently sitting at 36.8, indicating a neutral market position. Fibonacci Retracement levels do not show much support or resistance, with the closest level being the 38.2% retracement at 393.61. Overall the picture is slightly bearish but neutral overall. The risk level is 3 out of 5, with overall risk being medium.","movingAverages":0,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":0,"fibonacciRetracement":0,"bollingerBands":0,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is upward. The moving averages are showing a positive trend, with the short-term average (10-day) above the long-term average (50-day). The MACD is also showing a positive trend, with the MACD line above the signal line and the histogram bars increasing in size. The RSI is in the overbought territory, which indicates that the stock may be due for a correction. The fibonacci retracement levels show that the stock is currently trading near the 61.8% retracement level, which is a common support level. The Bollinger Bands show that the stock is trading near the upper Bollinger Band, which indicates that the stock is overbought and may be due for a correction. The overall risk level is medium, and the overall risk is high. The decision is BUY.","movingAverages":8,"movingAveragesConvergenceDivergence":10,"relativeStrengthIndex":9,"fibonacciRetracement":8,"bollingerBands":8,"overallTrend":"upward","riskLevel":3,"overallRisk":"high","decision":"BUY","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":4,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":4,"bollingerBands":4,"overallTrend":["neutral","upward"],"riskLevel":3,"overallRisk":["medium","high"],"decision":["HOLD","BUY"],"epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}