{"results":[{"summary":"The Moving Averages analysis method is neutral, with a score of 5 out of 10. The MACD analysis method is bullish, with a score of 7 out of 10. The RSI analysis method is neutral, with a score of 5 out of 10. The Fibonacci Retracement analysis method is bullish, with a score of 8 out of 10. The Bollinger Bands analysis method is neutral, with a score of 6 out of 10. Overall, the trend is neutral, with a risk level of 2 out of 5 and a risk of medium. The decision is to HOLD.","movingAverages":5,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":5,"fibonacciRetracement":8,"bollingerBands":6,"overallTrend":"neutral","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The moving averages are showing a slightly upward trend, with the 50-day moving average at 398.2 and the 200-day moving average at 397.5. The MACD is also showing a slightly upward trend, with the MACD line above the signal line and the histogram above zero. The RSI is currently at 54, which is in the neutral range. The Fibonacci retracement levels show that the stock is currently trading between the 38.2% and 50% retracement levels. The Bollinger Bands are showing that the stock is currently trading within the upper Bollinger Band, which indicates that the stock is overbought. Overall, the technical analysis indicates that the stock is in a slightly upward trend and is overbought. The risk level is currently 3 out of 5, and the overall risk is medium. The decision is to HOLD.","movingAverages":7,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":7,"fibonacciRetracement":6,"bollingerBands":4,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"At the time of this analysis, the stock is in a downward trend that has been ongoing since the beginning of the trading period. The moving average indicators are mostly negative, with the 50-day moving average falling below the 200-day moving average indicating a long term downtrend. The MACD indicator is also negative and not showing any signs of upward movement. The Relative Strength Index is below 30 which indicates the stock is oversold, which could indicate a buying opportunity. The Fibonacci Retracement indicates that the stock has reached a support level at around $396.70, which could also indicate a buying opportunity. The Bollinger Bands are showing that the stock is reaching the lower Bollinger Band, which is also an indication that the stock is oversold and could be a good time to buy. Overall, the technical analysis indicates that the stock is in a downward trend and has reached oversold levels, which could be a good time to buy for investors with a high risk tolerance. If the stock breaks below the support level of $396.70, it could be a signal to sell.","movingAverages":0,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":0,"fibonacciRetracement":10,"bollingerBands":7,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The stock price has been on a downward trend since the beginning of the data set. The moving averages are all pointing downwards, indicating a bearish trend. The MACD is also bearish, with the MACD line below the signal line and the histogram bars decreasing in size. The RSI is below 50, indicating that the stock is oversold. The Fibonacci retracement levels show that the stock is currently trading near the 61.8% retracement level, which is a potential support level. The Bollinger Bands are also bearish, with the stock price trading below the lower Bollinger Band. Overall, the technical analysis indicates that the stock is in a bearish trend and is likely to continue to decline in the near term.\n\nRisk Level: 3\nOverall Risk: Medium\nDecision: SELL","movingAverages":0,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":0,"fibonacciRetracement":0,"bollingerBands":0,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is slightly downward. The moving averages are showing a downward trend, with the short-term moving average below the long-term moving average. The MACD indicator is also showing a downward trend, with the MACD line below the signal line. The RSI indicator is slightly above 50, indicating that the stock is not oversold but may be approaching overbought territory. The Fibonacci retracement levels show that the stock is currently trading near the 61.8% retracement level, which could indicate that the stock is due for a correction. The Bollinger Bands indicator shows that the stock is currently trading below the lower Bollinger Band, which could indicate that the stock is oversold. Overall, the technical analysis suggests that the stock is likely to continue its downward trend in the short term.","movingAverages":5,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":6,"fibonacciRetracement":4,"bollingerBands":3,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":3,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":4,"fibonacciRetracement":6,"bollingerBands":4,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}