{"results":[{"summary":"Technical analysis is a method of evaluating securities by analysing statistics generated from market activity, such as past prices and volume. Technical analysts do not attempt to measure a security's intrinsic value, but instead use charts and other tools to identify patterns that suggest what the price of a security will do in the future. There are many different technical analysis indicators, and each one can be used to generate different insights about a security. \n\nThe Moving Averages indicator shows the average price of a security over a specified period of time. This indicator can be used to identify trends and support and resistance levels. The Moving Average Convergence Divergence (MACD) indicator is a momentum indicator that shows the difference between two moving averages. This indicator can be used to identify trend changes and overbought or oversold conditions. \n\nThe Relative Strength Index (RSI) indicator is a momentum indicator that shows the strength of a trend. This indicator can be used to identify overbought or oversold conditions. The Fibonacci Retracement indicator is a technical analysis tool that is used to identify potential support and resistance levels. This indicator is based on the Fibonacci sequence, which is a series of numbers in which each number is the sum of the two preceding numbers. \n\nThe Bollinger Bands indicator is a volatility indicator that shows the upper and lower Bollinger Bands. These bands are based on the moving average and the standard deviation of the price. \n\nIn this case, the Moving Averages indicator suggests that the stock is in a downtrend. The MACD indicator suggests that the stock is oversold. The RSI indicator suggests that the stock is oversold. The Fibonacci Retracement indicator suggests that the stock could find support at $401.50. The Bollinger Bands indicator suggests that the stock is oversold. \n\nOverall, the technical analysis indicators suggest that the stock is oversold and could be a good opportunity to buy.","movingAverages":2,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":2,"fibonacciRetracement":2,"bollingerBands":2,"overallTrend":"downward","riskLevel":2,"overallRisk":"medium","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"Based on the provided technical analysis, the overall trend of the stock is neutral. The moving averages are giving a slightly bullish signal, with a score of 5 out of 10. The MACD is also giving a slightly bullish signal, with a score of 4 out of 10. The relative strength index is giving a neutral signal, with a score of 5 out of 10. The Fibonacci retracement is giving a neutral signal, with a score of 5 out of 10. The Bollinger Bands are giving a neutral signal, with a score of 5 out of 10. Overall, the risk level is 1 out of 5, which is considered low risk. The overallRisk is therefore 'low' and the decision is 'BUY'.","movingAverages":5,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"neutral","riskLevel":1,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"**Summary Report**\n\nThe following is a technical analysis report on the stock CC.D.C.USS.IP. The analysis was conducted using five different technical analysis methods: Moving Averages, MACD (Moving Average Convergence Divergence), Fibonacci Retracement, Bollinger Bands & Relative Strength Index (RSI).\n\n* **Moving Averages:** The Moving Averages indicator shows that the stock is currently in a downward trend. The 50-day moving average is below the 200-day moving average, and the stock price is below both moving averages.\n\n* **MACD (Moving Average Convergence Divergence):** The MACD indicator shows that the stock is currently in a bearish trend. The MACD line is below the signal line, and the histogram is below the zero line.\n\n* **Fibonacci Retracement:** The Fibonacci Retracement indicator shows that the stock is currently in a retracement phase. The stock price has retraced to the 38.2% Fibonacci retracement level, which is a common retracement level.\n\n* **Bollinger Bands:** The Bollinger Bands indicator shows that the stock is currently in a period of low volatility. The Bollinger Bands are narrow, and the stock price is trading within the bands.\n\n* **Relative Strength Index (RSI):** The RSI indicator shows that the stock is currently in a neutral state. The RSI is in the middle of the range, between 30 and 70.The overall trend is slightly downward as suggested by the Moving Averages and MACD indicators. The risk level is 2 out of 5, as the Bollinger Bands indicate low volatility. The overall risk is \"medium\". The decision is SELL or move to a STRONG SELL if the RSI drops below 30.","movingAverages":2,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":9,"overallTrend":"downward","riskLevel":2,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is neutral. It is experiencing a neutral period. The short term trend is upward. The stock price has been rising over the past few days. The long term trend is neutral. The stock price has been moving sideways over the past few months. The relative strength index (RSI) is at 50. This indicates that the stock is neither overbought nor oversold. The moving average convergence divergence (MACD) is at 0. This indicates that there is no momentum in the stock price. The Bollinger Bands are widening. This indicates that the stock price is volatile. The Fibonacci retracement levels are at 38.2%, 50%, and 61.8%. The stock price is currently trading at the 50% retracement level. The overall risk level is medium. The overallRisk is medium. The decision is HOLD.","movingAverages":8,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":5,"fibonacciRetracement":4,"bollingerBands":7,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":4,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":4,"fibonacciRetracement":4,"bollingerBands":6,"overallTrend":["downward","neutral","downward","neutral"],"riskLevel":2,"overallRisk":"medium","decision":"BUY","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}