{"results":[{"summary":"The Moving Averages suggest a bullish trend, with a score of 9 out of 10. The MACD (Moving Average Convergence Divergence) also indicates a bullish trend, with a score of 10 out of 10. The RSI (Relative Strength Index) is neutral, with a score of 5 out of 10. The Fibonacci Retracement suggests a bullish trend, with a score of 9 out of 10. The Bollinger Bands suggest a neutral trend, with a score of 5 out of 10. Overall, the technical analysis suggests a bullish trend with low risk. Therefore, the decision is to BUY.","movingAverages":9,"movingAveragesConvergenceDivergence":10,"relativeStrengthIndex":5,"fibonacciRetracement":9,"bollingerBands":5,"overallTrend":"upward","riskLevel":0,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The stock's price has been trending downward over the past few months, with a few brief periods of upward movement. The overall trend is downward, with the stock price currently sitting at 396.4.\n\nThe Moving Averages analysis method shows that the stock price is currently below its 10-day and 50-day moving averages, indicating a downward trend.\n\nThe MACD analysis method also shows that the stock price is currently below its signal line, indicating a downward trend.\n\nThe RSI analysis method shows that the stock price is currently below 50, indicating a downward trend.\n\nThe Fibonacci Retracement analysis method shows that the stock price is currently below the 38.2% Fibonacci retracement level, indicating a downward trend.\n\nThe Bollinger Bands analysis method shows that the stock price is currently below the lower Bollinger Band, indicating a downward trend.\n\nOverall, the technical analysis methods all indicate that the stock price is currently in a downward trend. The risk level is 5 out of 5, and the overall risk is high. The decision is to SELL.","movingAverages":0,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":0,"fibonacciRetracement":0,"bollingerBands":0,"overallTrend":"downward","riskLevel":5,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The summary of the technical analysis of CC.D.C.USS.IP is as follows: \n\nMoving Averages: The stock has been trading above its moving averages for the past few days, which is a bullish sign. The stock is currently trading above its 50-day moving average, which is a key technical indicator. The 50-day moving average is used to identify the long-term trend of a stock. The stock is also trading above its 200-day moving average, which is a key technical indicator used to identify the long-term trend of a stock.\n\nMACD (Moving Average Convergence Divergence): The MACD indicator is a momentum indicator that is used to identify changes in the trend of a stock. The MACD indicator is calculated by subtracting the 26-day exponential moving average from the 12-day exponential moving average. The MACD indicator is currently positive, which is a bullish sign. The MACD indicator is also above its signal line, which is a bullish sign. \n\nRelative Strength Index (RSI): The RSI indicator is a momentum indicator that is used to identify overbought and oversold conditions in a stock. The RSI indicator is calculated by dividing the average gain of the stock over the past 14 days by the average loss of the stock over the past 14 days. The RSI indicator is currently at 55, which is considered to be a neutral reading. The RSI indicator is not currently in overbought or oversold territory.\n\nFibonacci Retracement: The Fibonacci retracement levels are a set of horizontal lines that are used to identify potential areas of support and resistance. The Fibonacci retracement levels are calculated by taking the difference between the high and low prices of a stock and then dividing that difference by Fibonacci ratios. The Fibonacci retracement levels are 23.6%, 38.2%, 50%, 61.8%, and 78.6%. The stock is currently trading at the 38.2% Fibonacci retracement level, which is a potential area of support.\n\nBollinger Bands: The Bollinger Bands are a volatility indicator that is used to identify overbought and oversold conditions in a stock. The Bollinger Bands are calculated by taking the moving average of the stock over the past 20 days and then adding and subtracting two standard deviations from the moving average. The Bollinger Bands are currently wide, which indicates that the stock is volatile. The stock is currently trading above the upper Bollinger Band, which is a bullish sign.\n\nOverall, the technical analysis of CC.D.C.USS.IP is bullish. The stock is trading above its moving averages, the MACD indicator is positive, the RSI indicator is not in overbought or oversold territory, the stock is trading at a Fibonacci retracement level, and the Bollinger Bands are wide and the stock is trading above the upper Bollinger Band. This all suggests that the stock is likely to continue to rise in the short-term. However, it is important to note that technical analysis is not a perfect science and should not be used as the sole basis for investment decisions.","movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":5,"fibonacciRetracement":7,"bollingerBands":8,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"BUY"}],"findings":{"movingAverages":6,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":3,"fibonacciRetracement":5,"bollingerBands":4,"overallTrend":"upward","riskLevel":3,"overallRisk":["low","high","medium"],"decision":"BUY","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}