{"results":[{"summary":"Based on technical analysis, CC.D.C.USS.IP has a moving average score of 7 out of 10, a MACD score of 9 out of 10, a relative strength index score of 7 out of 10, a Fibonacci retracement score of 8 out of 10, and a Bollinger bands score of 6 out of 10. Overall, the trend is upward, with a risk level of 3 out of 5 and an overall risk of medium. The decision is to BUY.","movingAverages":7,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":7,"fibonacciRetracement":8,"bollingerBands":6,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The stock has been on an uptrend for the past few days. The moving averages are bullish, with the 50-day moving average above the 200-day moving average. The MACD is also bullish, with the MACD line above the signal line and the histogram bars positive. The RSI is in overbought territory, but it has been trending higher for the past few days. The fibonacci retracement levels show that the stock is currently trading at the 61.8% retracement level. The bollinger bands are also bullish, with the stock price trading above the upper bollinger band. Overall, the technical analysis is bullish and suggests that the stock is likely to continue to rise in the short term.","movingAverages":6.5,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":7,"fibonacciRetracement":6.5,"bollingerBands":9,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"},{"summary":"After reviewing the Moving Averages, MACD, Relative Strength Index, Fibonacci Retracement and Bollinger Bands, the overall trend of the stock is upward. Some of the indicators are slightly bearish however the overall trend appears to be bullish, therefore I am advising a BUY.","movingAverages":8,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":7,"fibonacciRetracement":6,"bollingerBands":8,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The stock shows an overall positive trend that started on 2024/07/23 13:00:00 and appears to have continued into the observation period. The short-term moving average of 10 periods indicates a sideways movement with small fluctuations, signaling a lack of clear direction. However, the long-term moving average of 50 periods has been steadily increasing, suggesting a positive long-term trend. The MACD indicator shows a positive crossover on 2024/07/23 13:00:00, indicating a potential bullish trend. However, the RSI indicator is currently in the overbought zone, suggesting that the stock may be due for a pullback. The Fibonacci retracement levels show that the stock has retraced to the 61.8% level after a strong rally, which could offer support in the short term. The Bollinger Bands are currently wide, indicating high volatility, but the stock is trading above the middle Bollinger Band, suggesting that the bullish momentum is still strong. Overall, while the stock shows some positive signs, it is important to note the overbought RSI and the potential for a pullback in the short term. Therefore, caution is advised when making investment decisions.","movingAverages":7,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":7,"fibonacciRetracement":7,"bollingerBands":8,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"},{"summary":"The MACD line and signal line have a positive crossover in June 24th, and the MACD histogram is increasing, which means the stock price is likely to rise. The RSI indicator is above 70, indicating that the stock is overbought, but it has started to decline, suggesting that the overbought condition is easing. The Bollinger Bands are widening, indicating that volatility is increasing. The stock price is currently above the upper Bollinger Band, which indicates that the stock is overbought and could be due for a correction. The overall trend is upward, but there are some signs that the stock could be due for a correction. The risk level is moderate, and the overall risk is low.","movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":7,"fibonacciRetracement":0,"bollingerBands":0,"overallTrend":"upward","riskLevel":3,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":7,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":7,"fibonacciRetracement":6,"bollingerBands":6,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":["BUY","STRONG BUY","BUY","STRONG BUY","HOLD"],"epic":"CC.D.C.USS.IP"},"open_position":true,"epic":"CC.D.C.USS.IP"}