{"results":[{"summary":"Based on the analysis of 5 different technical analysis methods (Moving Averages, MACD, Fibonacci Retracement, Bollinger Bands and Relative Strength Index), the outcome is as follows:\n* Moving Averages: Indicates a neutral trend with a score of 5 out of 10.\n* MACD: Indicates a downward trend with a score of 2 out of 10.\n* Fibonacci Retracement: Indicates a downward trend with a score of 3 out of 10.\n* Bollinger Bands: Indicates a downward trend with a score of 4 out of 10.\n* RSI: Indicates a neutral trend with a score of 5 out of 10.\n\nBased on these results, the overall trend is downward. The risk level is considered medium at 3 out of 5, resulting in an overall risk of medium. Considering the technical analysis above, the recommendation would be to SELL.","movingAverages":5,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":5,"fibonacciRetracement":3,"bollingerBands":4,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"**Summary Report**\n\nThis report analyses the financial data provided using five technical analysis methods: Moving Averages, MACD (Moving Average Convergence Divergence), Fibonacci Retracement, Bollinger Bands & Relative Strength Index (RSI). \n\nThe Moving Averages analysis indicates a bullish trend with a score of 8 out of 10. This suggests that the stock price is likely to rise in the near term. The MACD analysis also indicates a bullish trend with a score of 9 out of 10, further supporting the idea that the stock price is likely to increase. \n\nThe Fibonacci Retracement analysis suggests that the stock price is currently in a retracement phase and is likely to pull back to the 38.2% Fibonacci level before resuming its upward trend. The Bollinger Bands analysis indicates that the stock price is currently trading near the upper Bollinger Band, which suggests that it may be overbought and due for a correction. The RSI analysis indicates that the stock is currently in a neutral zone, which suggests that there is no clear trend at the moment. \n\nOverall, the technical analysis suggests that the stock is in a bullish trend but may be due for a correction in the near term. Investors should be cautious and consider taking profits if the stock price starts to decline. \n\n**Risk Level:** Medium\n\n**Overall Risk:** Medium\n\n**Decision:** HOLD","movingAverages":8,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":7,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall sentiment of the market is neutral. The moving averages are showing a slight downward trend, with the 50-day moving average below the 200-day moving average.\nThe MACD is showing a bearish divergence, with the MACD line below the signal line and both lines below the zero line. The RSI is showing a neutral reading, with the RSI line around the 50 level.\nThe Fibonacci retracement levels show that the current price is at the 61.8% retracement level, which is a potential support level. The Bollinger Bands are showing that the price is trading within the Bollinger Bands, which indicates that the market is not overbought or oversold.\nOverall, the technical analysis indicates that the market is in a neutral trend, with a slightly bearish bias. However, the Fibonacci retracement levels and the Bollinger Bands suggest that there is potential for a reversal to the upside.\nThe risk level is medium, with the overall risk being moderate.","movingAverages":6,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":4,"fibonacciRetracement":6,"bollingerBands":5,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"We analysed the stock using the following technical analysis methods: Moving Averages, MACD, Relative Strength Index, Fibonacci Retracement, Bollinger Bands and we have determined that the overall trend is upward. The risk, is considered medium, putting the overall risk assessment as medium. We recommend to BUY this stock.","movingAverages":7,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":8,"fibonacciRetracement":7,"bollingerBands":8,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend for this stock is neutral. The moving averages are indicating a downward trend, the Bollinger bands are indicating a neutral trend, the MACD is indicating a downward trend, the RSI is indicating a neutral trend and the Fibonacci Retracement is indicating a neutral trend. The overall risk level is medium and overall risk is high. Overall, it is recommended to HOLD this stock.","movingAverages":0,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":4,"fibonacciRetracement":2,"bollingerBands":2,"overallTrend":"neutral","riskLevel":3,"overallRisk":"high","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":["downward","upward","neutral","upward","neutral"],"riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}