{"results":[{"summary":"The Moving Averages indicator shows a downward trend with a score of 1 out of 10, indicating that the stock price is likely to continue to decrease in the short term. The MACD indicator is also showing a downward trend with a score of 4 out of 10, indicating that the selling pressure is still strong and the stock price is likely to continue to decline. The Relative Strength Index (RSI) is at 35, which is considered to be in the oversold region, indicating that the stock is currently undervalued and may be a good buy opportunity. The Fibonacci Retracement indicator shows a strong support level at $400 and a strong resistance level at $404, indicating that the stock price is likely to stay within this range in the short term. The Bollinger Bands indicator shows that the stock price is currently above the lower Bollinger Band, indicating that the stock is currently overvalued and may be due for a correction. The overall trend is downward, the risk level is 0 out of 5, and the overall risk is low. The decision is HOLD.","movingAverages":1,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":35,"fibonacciRetracement":6,"bollingerBands":3,"overallTrend":"downward","riskLevel":0,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The technical analysis of various financial indicators suggests a potential upward trend in the stock price. Moving Averages, MACD, RSI and Bollinger Bands indicators are mostly positive, indicating a bullish sentiment. Fibonacci Retracement provides a more neutral outlook, suggesting the stock may be in a consolidation phase. Overall, the risk level is considered medium, warranting a cautious approach. The decision is to HOLD the stock, as the overall risk assessment suggests a conservative approach.","movingAverages":6,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":6,"fibonacciRetracement":5,"bollingerBands":7,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The analysed time period indicates that there is a neutral trend. The moving averages and Bollinger bands are showing a neutral trend, indicating a lack of clear momentum in either direction. The RSI is in the neutral range, and the MACD is slightly bullish. The fibonacci retracement levels are also showing a neutral trend. Overall, the technical analysis indicates that the stock's price is likely to remain within a narrow range in the near term. Therefore, a HOLD decision is recommended.","movingAverages":6,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":5,"fibonacciRetracement":7,"bollingerBands":6,"overallTrend":"neutral","riskLevel":0,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"Following a 2-week trend of positive growth, the stock's recent performance indicates a potential reversal. The stock has been showing positive growth for 11 days out of the 14 days of data provided. Prices have taken a turn and dropped 4.97% in the last 2 days, which has brought the 5-day return down to -2.88%. Despite the recent downturn, the stock is still showing gains year-to-date of 26.31%.\n\nThe Moving Averages (MA) indicator shows that the stock is in a bullish trend. The 10-day MA is above the 50-day MA, which is above the 200-day MA. This indicates that the stock is trading above its key moving averages, which is a sign of strength. The stock's price is also above the upper Bollinger Band, which indicates that it is overbought and due for a correction.\n\nThe Moving Average Convergence Divergence (MACD) indicator is also showing a bullish trend. The MACD line is above the signal line, and the histogram is positive. This indicates that the stock is in a bullish trend and that momentum is increasing.\n\nThe Relative Strength Index (RSI) indicator is showing that the stock is overbought. The RSI is above 70, which indicates that the stock is overbought and due for a correction. \nThe Fibonacci Retracement indicator shows that the stock is at a key support level. The 38.2% Fibonacci retracement level is at 400.79, and the stock is currently trading slightly above this level. This indicates that the stock is at a key support level and that it may bounce back from here. \nOverall, the technical analysis indicators are showing that the stock is in a bullish trend, but that it is overbought and due for a correction. The stock is at a key support level, and it may bounce back from here. However, investors should be aware that the stock is overbought and that it may experience a correction in the near term.","movingAverages":7.5,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":4,"fibonacciRetracement":7,"bollingerBands":5,"overallTrend":"upward","riskLevel":0,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The stock has been generally positive in the past 24 hours and also in the last 1 hour period. The various technical indicators are as following: The stock is currently trading above its 20 day EMA and 50 day EMA, which is a bullish sign. The MACD indicator is also trending higher, which is another positive sign. The RSI indicator has crossed above the 50 level, which is a sign that the stock is starting to gain momentum. The Fibonacci retracement levels show that the stock is currently trading near the 61.8% retracement level, which is a potential resistance level. The Bollinger Bands are widening, which is a sign of increased volatility. Overall, the technical analysis suggests that the stock is in a bullish trend and is likely to continue to move higher however a slight correction may occur in the short-term.","movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":8,"fibonacciRetracement":6,"bollingerBands":8,"overallTrend":"upward","riskLevel":0,"overallRisk":"low","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":6,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":12,"fibonacciRetracement":6,"bollingerBands":6,"overallTrend":"upward","riskLevel":1,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":true,"epic":"CC.D.C.USS.IP"}