{"results":[{"summary":"After looking at the moving averages, MACD, Relative Strength Index, Fibonacci Retracement and Bollinger Bands technical analysis methods, with the current situation of the stock, it seems like it would be best to SELL the stock. The overall trend is downward, with a risk level of 3 and an overall risk of medium. If you wish to trade this asset, a stop-loss order should be implemented to limit your potential losses if the price continues to trend downwards.","movingAverages":0,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":0,"fibonacciRetracement":0,"bollingerBands":0,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The technical analysis on the financial data for CC.D.C.USS.IP suggests a downward trend. The Moving Averages indicator shows a weak indication of the stock price continuing an upward trend, with a score of 3 out of 10. The Moving Average Convergence Divergence indicator shows a weak indication of the stock price continuing an upward trend, with a score of 3 out of 10. The Relative Strength Index indicator is showing a neutral indication, with a score of 5 out of 10. The Fibonacci Retracement indicator is showing a weak indication of a downward trend, with a score of 2 out of 10. The Bollinger Bands indicator is showing a weak indication of a downward trend, with a score of 2 out of 10. Overall, the technical analysis indicates a downward trend, with a risk level of 3 out of 5. The overall risk is medium. The decision is to SELL.","movingAverages":3,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":5,"fibonacciRetracement":2,"bollingerBands":2,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The analysis of financial data for CC.D.C.USS.IP has shown mixed results. The moving averages indicate a downward trend, with a score of 2 out of 10. The MACD also indicates a downward trend, with a score of 2 out of 10. The RSI, on the other hand, indicates a neutral trend, with a score of 5 out of 10. The Fibonacci retracement suggests a potential upside in the future, with a score of 6 out of 10. The Bollinger Bands indicate a high volatility, with a score of 7 out of 10. Overall, the analysis gives a slightly negative outlook on the stock, with a risk level of 3 out of 5 and an overall risk of medium. A decision of SELL is therefore recommended.","movingAverages":2,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":7,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The overall sentiment of the stock is neutral. The moving average seems to suggest the price of the stock will go down, while the Moving Average Convergence Divergence indicator is suggesting the price of the stock will increase. The rest of the technical analysis indicators are showing mixed signals. The Fibonacci Retracement indicator is suggesting a strong support level at $395. The Bollinger Bands indicator is showing that the stock is currently trading within the upper Bollinger Band, which could indicate that the stock is overbought. The RSI is showing that the stock is currently in overbought territory. Overall, the technical analysis of this stock is mixed, with some indicators suggesting a bullish trend and others suggesting a bearish trend. As such, it is difficult to make a definitive recommendation on whether to buy or sell this stock. Further research is needed inorder to make a more informed decision.","movingAverages":6,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":5,"fibonacciRetracement":8,"bollingerBands":6,"overallTrend":"neutral","riskLevel":2,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend for CC.D.C.USS.IP is a downward trend. The Moving Averages indicate a slightly bullish outlook with a score of 5 out of 10. The MACD indicator is also slightly bullish with a score of 6 out of 10. The RSI is neutral with a score of 5 out of 10. The Fibonacci Retracement is slightly bearish with a score of 4 out of 10. The Bollinger Bands are neutral with a score of 5 out of 10. The overall risk level is 2 out of 5, which is considered medium risk. The overall risk is medium. The decision is HOLD.","movingAverages":5,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":4,"bollingerBands":5,"overallTrend":"downward","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":3,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":4,"fibonacciRetracement":4,"bollingerBands":4,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},"open_position":true,"epic":"CC.D.C.USS.IP"}