{"results":[{"summary":"The 50-day moving average is 404.15 while the stock's current price, at the time of calculations, was 403.70. The stock has been trading below its 50-day moving average for the past 6 days. The MACD line is below the signal line, indicating a bearish trend. The RSI is at 43.25, indicating that the stock is oversold. The fibonacci retracement levels show that the stock is currently trading at the 38.2% retracement level, which is a potential support level. The bollinger bands show that the stock is currently trading within the lower bollinger band, indicating that the stock is undervalued. Overall, the technical analysis indicates that the stock is currently in a bearish trend and is undervalued. A SELL decision is recommended.","movingAverages":2,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":2,"fibonacciRetracement":7,"bollingerBands":2,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The financial data provided indicates a volatile stock price over the past 28 days. Using technical analysis methods, the moving averages and MACD suggest a downward trend, while the RSI, fibonacci retracement, and Bollinger Bands indicate a neutral to slightly upward trend. Overall, the stock is in a period of consolidation with no clear indication of a sustained upward or downward trend.\n\nThe moving average shows a downward trend, indicating that the stock price has been decreasing over the past 28 days. The MACD is also showing a downward trend, further confirming the bearish sentiment in the market.\n\nThe RSI is showing a neutral value, indicating that the stock is not overbought or oversold. The fibonacci retracement levels also suggest a neutral trend, as the stock price is currently trading between the 38.2% and 61.8% retracement levels.\n\nThe Bollinger Bands are showing a slight upward trend, indicating that the stock price is currently trading above the lower Bollinger Band. This suggests that the stock price may be due for a correction to the downside.\n\nOverall, the technical analysis indicates a mixed outlook for the stock. The moving averages and MACD suggest a downward trend, while the RSI, fibonacci retracement, and Bollinger Bands indicate a neutral to slightly upward trend. As such, it is difficult to determine the future direction of the stock price with certainty.","movingAverages":6,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":6,"fibonacciRetracement":5,"bollingerBands":6,"overallTrend":"neutral","riskLevel":2,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The stock price of CC.D.C.USS.IP has been in a general upwards trend over the past month, but with some significant fluctuations along the way. While the Moving Averages, MACD, and RSI indicators are all showing positive signs, the Fibonacci Retracement and Bollinger Bands are suggesting that the stock price may be due for a correction. The overall trend is upwards, with a risk level of 3 out of 5, and an overall risk of medium.","movingAverages":7,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":3,"bollingerBands":6,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"BUY"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":4,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":["downward","neutral","upward"],"riskLevel":3,"overallRisk":"medium","decision":["SELL","HOLD","BUY"],"epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}