{"results":[{"summary":"The overall trend of CC.D.C.USS.IP over the past 30 days shows a downward trajectory with multiple fluctuations. The Moving Averages analysis suggests a slightly bearish sentiment, with a score of 4 out of 10. The MACD analysis indicates a potential for a bearish crossover, with a score of 4 out of 10. The RSI analysis shows the stock is neither overbought nor oversold, with a score of 5 out of 10. The Fibonacci Retracement analysis suggests a potential support level at 400.5 and a resistance level at 403.3, with a score of 6 out of 10. The Bollinger Bands analysis indicates the stock is currently trading within the bands, with a score of 5 out of 10. The overall risk level is assessed as medium, with a score of 3 out of 5. The overall risk is considered as medium. The recommended decision is to HOLD CC.D.C.USS.IP.","movingAverages":4,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":5,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The Moving Averages indicator shows a bullish trend, with the current price being above the 10-day, 20-day, 50-day and 200-day moving averages. The MACD indicator shows a bullish trend, with the MACD line being above the signal line and the histogram being above the zero line. The RSI indicator is in the overbought territory, indicating that the stock is possibly overvalued. The Fibonacci Retracement indicator shows the current price is at the 38.2% retracement level, which indicates a potential support level. The Bollinger Bands indicator shows that the current price is above the upper Bollinger Band, which indicates a possible overbought condition. Overall, the technical analysis indicates a bullish trend with a possibility of a pullback or correction. The risk level is medium and the overall risk is moderate. The decision is to HOLD.","movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":2,"fibonacciRetracement":6,"bollingerBands":6,"overallTrend":"upward","riskLevel":2,"overallRisk":"moderate","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The summary indicates that the stock price has been volatile over the last month. Using several technical analysis methods like Moving Averages, MACD, Fibonacci Retracement, Bollinger Bands, and Relative Strength Index, the stock's overall trend is somewhat neutral. There are some indications that the price could be heading up, but there are also some indications that it could be heading down. The risk level is medium, and the overall risk is medium. The decision is to HOLD.","movingAverages":6,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":8,"overallTrend":"neutral","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The Moving Averages indicate a downward trend, with the shorter term MA of 10 indicating a strong sell signal and the longer term MA of 200 indicating a weak sell signal. The MACD also indicates a downward trend, with the MACD line below the signal line and the histogram decreasing. The RSI is also giving a sell signal, with a value of 28. The Fibonacci Retracement is not indicating an imminent reversal. Bollinger Bands are neutral. Overall, the technical analysis is indicating a downward trend, with a high risk level and a strong sell decision. Traders should consider exiting or shorting this stock until the trend changes.","movingAverages":1,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":4,"fibonacciRetracement":6,"bollingerBands":5,"overallTrend":"downward","riskLevel":5,"overallRisk":"high","decision":"STRONG SELL","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":4,"fibonacciRetracement":6,"bollingerBands":6,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}