{"results":[{"summary":"The moving averages are indicating a downward trend. The MACD is indicating a downward trend. The RSI is indicating an oversold trend. The Fibonacci retracement is indicating that the price will rebound between 407.7 and 414.7. The Bollinger Bands are indicating a downward trend. Overall, the technical analysis is indicating a downward trend with a high risk level. Overall risk level is high. The decision is to SELL.","movingAverages":1,"movingAveragesConvergenceDivergence":1,"relativeStrengthIndex":3,"fibonacciRetracement":8,"bollingerBands":2,"overallTrend":"downward","riskLevel":5,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The stock has been trending downwards for the past few days. It is currently sitting below its moving average, and the MACD is also indicating a bearish trend. The RSI is in the oversold territory, which could indicate that the stock is due for a rebound. The Fibonacci retracement levels show that the stock is currently trading at the 61.8% retracement level, which is a potential support level. The Bollinger Bands are also indicating that the stock is oversold, and could be due for a bounce. Overall, the technical analysis is indicating that the stock is likely to continue its downward trend in the short term, but could be due for a rebound in the longer term.","movingAverages":5,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":3,"fibonacciRetracement":6,"bollingerBands":7,"overallTrend":"downward","riskLevel":5,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The Moving Averages are currently showing a strong downward trend, indicating the price may continue to decrease. The MACD is also indicating a downward trend, showing a negative value and a decreasing histogram. The RSI shows that the stock is slightly overbought, but the trend is downward. The Fibonacci Retracement tool shows the price is currently at the 50% retracement level, which is a critical support level. The Bollinger Bands are showing that the stock is currently trading below the lower Bollinger Band, indicating a potential reversal. The overall analysis shows a weak downward trend with high volatility and a potential for a further price decrease. The stock is currently at a crucial support level, and if it breaks below this level, it could lead to a significant drop in price. The risk level is currently moderate, and the overall risk is medium.","movingAverages":2,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":4,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":3,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":4,"fibonacciRetracement":6,"bollingerBands":4,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}