{"results":[{"summary":"The overall trend for this stock is downward. The moving averages suggest a sell signal, the MACD is neutral, the relative strength index is neutral, the fibonacci retracement is neutral, and the bollinger bands are neutral. The overall risk is medium and the overall risk level is 3. The decision is HOLD.","movingAverages":0,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is neutral. The moving averages are mixed, with the 50-day moving average above the 200-day moving average. The MACD indicator is also mixed, with the MACD line above the signal line but the histogram below the zero line. The RSI indicator is also mixed, with the RSI line above the 50 level but the RSI histogram below the zero line. The stock is currently trading in a consolidation phase, with little movement in either direction. The overall risk level is medium, and the overall risk is neutral. Based on the analysis, the recommendation is to HOLD the stock.","movingAverages":7,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":6,"fibonacciRetracement":8,"bollingerBands":7,"overallTrend":"neutral","riskLevel":3,"overallRisk":"neutral","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The stock price has been showing a downward trend since the opening of the market on 2024/07/16. The MACD indicator is showing a bearish divergence, with the MACD line below the signal line and the histogram below the zero line. The RSI indicator is also showing a downward trend, with the RSI line below the 50 level. The Fibonacci Retracement levels show that the stock price is currently trading below the 38.2% retracement level, which indicates that the stock is in a downtrend. The Bollinger Bands are also showing a downward trend, with the Bollinger Bands narrowing, which indicates that the stock is losing volatility. Overall, the technical analysis indicates that the stock is in a downtrend and is likely to continue to decline in the near term.","movingAverages":4,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":3,"fibonacciRetracement":3,"bollingerBands":2,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The stock price has been on a downward trend since the beginning of the data set. The moving averages, MACD, and Bollinger Bands all indicate that the stock is overvalued and due for a correction or decline. The RSI is the only indicator that is showing some signs of strength, but it is not enough to offset the negative signals from the other indicators. Fibonacci Retracement's first predicted level of resistance stands at 415.78. However, the stock price has not reached that level yet, so it is not yet possible to say whether the Fibonacci Retracement will be successful. Overall, the technical analysis suggests that it is best to SELL this stock.","movingAverages":3,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":7,"fibonacciRetracement":0,"bollingerBands":3,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The analysis of the financial data using 5 technical analysis methods (Moving Averages, MACD, RSI, Fibonacci Retracement, and Bollinger Bands) suggests a **SELL** decision. The MACD, RSI, Fibonacci Retracement, and Bollinger Bands all indicate a downward trend, while the Moving Averages are neutral. The overall risk level is assessed as **medium** with an **overall risk** of **high**. The overall trend is **downward**.\n\nMoving Averages: 6/10\nMACD: 2/10\nRSI: 2/10\nFibonacci Retracement: 4/10\nBollinger Bands: 4/10","movingAverages":6,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":2,"fibonacciRetracement":4,"bollingerBands":4,"overallTrend":"downward","riskLevel":3,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":4,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":5,"fibonacciRetracement":4,"bollingerBands":4,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}