{"results":[{"summary":"The Moving Averages indicator shows that the stock is currently in a downward trend. The MACD indicator is showing a bearish cross, which is also a sign of a downward trend. The Relative Strength Index is showing that the stock is currently oversold, which could indicate that the stock is due for a correction. The Fibonacci Retracement levels show that the stock is currently trading near the 61.8% retracement level, which is a potential support level. The Bollinger Bands indicator shows that the stock is currently trading below the lower Bollinger Band, which is also a sign of a downward trend. Overall, the technical analysis indicates that the stock is currently in a downward trend and could be due for a correction. The overall risk is medium and the overall risk is medium.","movingAverages":2,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":2,"fibonacciRetracement":2,"bollingerBands":6,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is slightly upward. The moving averages are relatively flat, indicating sideways movement of the stock price. The MACD is trending downwards, which may indicate a potential reversal in the stock price. The RSI is trending upwards, which may indicate that the stock is in an overbought condition. The Fibonacci retracement shows that the stock is now in the 61.8% retracement level, which indicates the market is bearish. The Bollinger Bands are relatively wide, indicating that the stock is volatile. Overall, the risk level is medium and the overall risk is \"medium\". The decision is to hold.","movingAverages":6,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":8,"fibonacciRetracement":6,"bollingerBands":7,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall stock trend is slightly downward, with some fluctuations in the price. The moving averages indicate a slightly positive outlook, with the stock price mostly staying above the 200-day moving average. The MACD indicates a bullish divergence, which is a sign that the stock price may be about to reverse its downward trend. The RSI is neutral, indicating that the stock is not overbought or oversold. The Fibonacci retracement levels show that the stock price is currently trading near the 38.2% retracement level, which is a potential support level. The Bollinger Bands are narrowing, which indicates that the volatility is decreasing. Overall, the technical analysis suggests that the stock is likely to continue its slightly downward trend in the short term, but there is potential for a reversal in the medium to long term. The risk level is low, and the overall risk is low to medium, so it would be reasonable to hold this stock.","movingAverages":7,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":6,"overallTrend":"downward","riskLevel":1,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The stock price has been on an overall upward trend with some minor fluctuations. The moving averages indicate a neutral trend with a slight upward bias. The MACD is also indicating a neutral trend with a positive divergence, suggesting that the uptrend may continue. The RSI is in the bullish zone, indicating that the stock is overbought but still has room to rise. The Fibonacci retracement levels show that the stock is currently at the 61.8% retracement level, which is a potential support level. The Bollinger Bands are showing that the stock is currently within the upper Bollinger Band, indicating that it is overbought. Overall, the technical analysis is slightly bullish, suggesting that the stock may continue to rise in the short term. However, the overall risk is medium, as the stock is overbought and could be due for a correction. **Disclaimer:** This analysis is based on technical indicators and does not take into account fundamental factors. It is important to consider all available information before making any investment decisions.","movingAverages":7,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":7,"fibonacciRetracement":6,"bollingerBands":5,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"Overall the recent technical analysis has shown a slightly negative trend. The moving averages show a slight downward trend. The MACD indicator shows a bearish trend, with the signal line above the MACD line. The RSI indicator is in the oversold zone, indicating that the stock may be undervalued. The Fibonacci retracement levels show that the stock is currently trading at the 0.618 level. The Bollinger Bands show that the stock is trading within the lower band, indicating that it may be undervalued. Overall, the technicals suggest that the stock may be undervalued and could be a good buying opportunity.","movingAverages":6,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":4,"fibonacciRetracement":6,"bollingerBands":6,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":6,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":6,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}