{"results":[{"summary":"Based on Moving Averages, the stock price is expected to move upwards with a score of 9 out of 10. The MACD analysis indicates a neutral trend with a score of 5 out of 10, suggesting that the market is indecisive. The RSI score of 7 out of 10 implies that the stock is currently overbought. The Fibonacci Retracement analysis indicates a strong uptrend with a score of 9 out of 10. The Bollinger Bands analysis suggests a neutral trend with a score of 5 out of 10, indicating that the price is within the normal range of volatility. Overall, the technical analysis of the given financial data suggests that the stock price will likely move upwards with a moderate risk level. Therefore, the recommended decision is to BUY the stock.","movingAverages":9,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":7,"fibonacciRetracement":9,"bollingerBands":5,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The moving averages are suggesting a neutral trend with a slight upward bias. The MACD is also in a neutral position, but the histogram is beginning to turn down, which could indicate a possible reversal in trend. The RSI is in neutral territory, suggesting that the stock is not overbought or overbought. The Fibonacci retracement levels show that the stock has retraced to the 38.2% level, which is a common retracement level. The Bollinger Bands are showing a neutral squeeze, which could indicate that the stock is due for a breakout. Overall, the technical analysis suggests that the stock is in a neutral position with a slight upward bias. However, there are some indicators that suggest that the stock could be due for a reversal in trend. Therefore, it is important to monitor the stock closely for any changes in trend.","movingAverages":7,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":5,"fibonacciRetracement":7,"bollingerBands":7,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The stock is on a upward trend. The RSI is not overbought or over sold. The stock had a breakout and retested the previous resistance level which is a bullish sign. The Bollinger bands are also indicating that the stock is on a upward trend. The moving averages are also indicating that the stock is in a upward trend. The MACD is also indicating that the stock is in a upward trend. The overall risk of the stock is low. The overall trend of the stock is upward. The decision is BUY.","movingAverages":8,"movingAveragesConvergenceDivergence":10,"relativeStrengthIndex":6,"fibonacciRetracement":8,"bollingerBands":9,"overallTrend":"upward","riskLevel":1,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend for CC.D.C.USS.IP is upward. \n\nThe Moving Averages analysis gives a score of 2 out of 10, indicating a slightly downward trend. The Moving Average Convergence Divergence analysis gives a score of 4 out of 10, indicating a neutral trend. The Relative Strength Index analysis gives a score of 6 out of 10, indicating a slightly upward trend. The Fibonacci Retracement analysis gives a score of 7 out of 10, indicating a neutral trend. The Bollinger Bands analysis gives a score of 8 out of 10, indicating a slightly upward trend.\n\nBased on these analysis methods, the overall risk level is 2 out of 5, and the overallRisk is \"medium\". The decision is HOLD.","movingAverages":2,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":8,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":7,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":6,"fibonacciRetracement":8,"bollingerBands":7,"overallTrend":"upward","riskLevel":2,"overallRisk":["low","medium","low","medium"],"decision":["BUY","HOLD","BUY","HOLD"],"epic":"CC.D.C.USS.IP"},"open_position":true,"epic":"CC.D.C.USS.IP"}