{"results":[{"summary":"The Moving Averages(MA) indicator shows a bullish trend. The stock price is currently trading above the 50-day moving average, and the 200-day moving average is also sloping upwards. \nThe MACD indicator has crossed above the signal line and is now in positive territory, which is a bullish sign. \nThe RSI indicator is also in bullish territory, as it is trading above the 50 level. \nThe Fibonacci Retracement levels show that the stock price is currently trading at the 61.8% retracement level, which is a potential support level. \nThe Bollinger Bands indicator shows that the stock price is currently trading within the upper Bollinger Band, which indicates that the stock is overbought. \nOverall, the technical analysis indicates that the stock is in a bullish trend and has the potential to continue to move higher. However, the Bollinger Bands indicator suggests that the stock may be overbought and could be due for a pullback.\nThe overall trend is upward. The risk level is 2 out of 5, which is medium risk. The overall risk is medium. The decision is BUY.","movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":6,"fibonacciRetracement":8,"bollingerBands":5,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The stock price has been on a downward trend since the beginning of the data set. The moving averages, Bollinger Bands, and Relative Strength Index all indicate that the stock is oversold and could be due for a correction. The MACD suggests that the stock is in a downtrend, and the Fibonacci Retracement indicates that the stock may find support at around 400.00. Overall, the technical analysis suggests that the stock is a sell. With the assumption that each property can reach a maximum score of 10, the overall risk can be considered medium, with a risk level of 3 out of 5. The decision is to SELL.","movingAverages":1,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":8,"fibonacciRetracement":1,"bollingerBands":2,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The stock price has been on an upward trend since the 17th of July, with a few small dips along the way. The MACD and RSI indicators are both showing signs of a bullish trend, while the Bollinger Bands are indicating that the stock is slightly overbought. Overall, the technical analysis suggests that the stock is likely to continue moving up or at the very least will have a minimal risk of going down. The overall risk level is low to medium, and the overall trend is upward.","movingAverages":7.7,"movingAveragesConvergenceDivergence":7.8,"relativeStrengthIndex":7.5,"fibonacciRetracement":7.2,"bollingerBands":7.6,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"BUY"},{"summary":"The current stock trend is slightly bullish, but there have been some fluctuations in the past 24 hours. The Moving Averages indicator is showing a positive trend, with the MACD indicator also indicating a positive divergence. The Relative Strength Index (RSI) is currently in the neutral range, indicating that the stock is neither overbought nor oversold. The Fibonacci Retracement indicator suggests that the stock is currently at a key support level, which could provide a buying opportunity. The Bollinger Bands indicator is indicating that the stock is trading within a relatively tight range, which could suggest that a breakout is imminent. Overall, the technical analysis suggests a slightly bullish outlook for the stock, but it is important to note that the market can be unpredictable and investors should always do their own research before making any investment decisions.","movingAverages":7,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":5,"fibonacciRetracement":7,"bollingerBands":6,"overallTrend":"upward","riskLevel":2.3333333333333335,"overallRisk":"low","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"},{"summary":"The stock price has been on a downward trend for the past few days. The moving averages are all pointing down, and the RSI is also in a bearish zone. The Fibonacci retracement levels show that the stock price is currently trading at the 61.8% retracement level, which is a key support level. If the stock price breaks below this level, it could fall further. The Bollinger Bands are also showing that the stock price is overbought, which means that it could be due for a correction. Overall, the technical analysis suggests that the stock price is likely to continue to fall in the short term. There is some potential for a bounce if the price breaks above the 61.8% retracement level but overall the movement has been downward for the past week. The risk level is medium to high and overall risk is medium. With this in mind, the decision is to SELL.","movingAverages":0,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":0,"fibonacciRetracement":0,"bollingerBands":0,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":4,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":["BUY","SELL","BUY","STRONG BUY","SELL"],"epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}