{"results":[{"summary":"The summary of the technical analysis is as follows: Moving Averages: The stock price is moving along its moving averages, indicating a neutral trend. MACD: The MACD line is above the signal line, indicating a bullish trend. Relative Strength Index: The RSI is above 50, indicating a bullish trend. Fibonacci Retracement: The stock price is currently trading above 38.2% Fibonacci retracement level, indicating a bullish trend. Bollinger Bands: The stock price is currently trading within the Bollinger Bands, indicating a neutral trend. Overall, the technical analysis indicates a neutral to bullish trend for this stock. However, it is important to note that this analysis is based on historical data and may not be indicative of future performance.","movingAverages":6,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":8,"fibonacciRetracement":9,"bollingerBands":6,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"Technical indicators are giving contradicting signals. The stock price looks bullish but the volume is going down, on the other hand, the indicators are pointing out a neutral to slight bearish trend. \n\nThe RSI indicator shows that the asset is overbought, which could indicate a potential reversal in the uptrend. This could also be confirmed by the Bollinger Bands, which shows the stock price is touching the upper Bollinger Band. The MACD line is below its signal line, and the histogram is also negative, which is another indication of a potential reversal in the uptrend.\n\nOn the other hand, the moving averages show a bullish sentiment as the shorter period moving average (50) is above the 200. Fibonacci also suggests a potential pullback to around 400.30 followed by a reversal. \n\nOverall, the technical analysis is not giving a clear indication of the future trend of the stock. The stock price has been in an uptrend, but the indicators are suggesting a potential reversal. More data is needed to confirm the future trend of the stock.","movingAverages":0,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":0,"fibonacciRetracement":0,"bollingerBands":0,"overallTrend":"downward","riskLevel":5,"overallRisk":"high","decision":"STRONG SELL","epic":"CC.D.C.USS.IP"},{"summary":"The stock price has been on an overall upward trend over the past few days. The moving averages are slightly positive, indicating that the stock price may continue to rise. The MACD is also positive but suggests that the bullish momentum is starting to weaken. The relative strength index is around 50, which is neutral. The Fibonacci retracement indicates that the stock price is currently at a key support level. The Bollinger Bands are also neutral, indicating that the stock price is not overbought or oversold. Based on these technical analysis methods, it is possible that the stock price could continue to rise in the short term, but investors should be aware of the potential for a pullback. Overall, the risk level is medium and the overall risk is neutral.\nThe decision is to HOLD.","movingAverages":6,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":6,"overallTrend":"upward","riskLevel":3,"overallRisk":"neutral","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The technical analysis of the stock indicates a bullish trend. The moving average suggests a slightly bullish trend, whereas the MACD indicator suggests a neutral one. The RSI indicator suggests a neutral trend, the Fibonacci Retracement is neutral, and the Bollinger Bands are neutral. Overall, this analysis gives a neutral result. The risk level is 2 out of 5. The overall risk is low. The decision is to HOLD the stock.","movingAverages":7,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"neutral","riskLevel":2,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"Overall, the technical analysis of the stock suggests a neutral trend. The moving averages are indicating a slightly downward trend, while the MACD and RSI are indicating a slightly upward trend. The Fibonacci retracement and Bollinger Bands are indicating a neutral trend. The overall risk level is medium and the overall risk is neutral. A STRONG BUY decision is not recommended at this time.","movingAverages":5,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":7,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"neutral","riskLevel":3,"overallRisk":"neutral","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":4,"overallTrend":["upward","downward","upward","neutral","neutral"],"riskLevel":3,"overallRisk":["low","high","neutral","low","neutral"],"decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}