{"results":[{"summary":"The summary for this technical analysis is as follows: \n\n* Moving Averages: The stock's price has been below its moving averages for the past few days, which is a sign that the stock is in a downtrend. The stock's 200-day moving average is currently at 401.15, and the stock's price is currently trading below this level. This is a sign that the stock is in a long-term downtrend.\n\n* MACD: The MACD is currently below its signal line, which is a sign that the stock is in a downtrend. The MACD is also trending lower, which is a sign that the downtrend is strengthening.\n\n* Relative Strength Index: The RSI is currently below 50, which is a sign that the stock is oversold. This means that the stock is due for a bounce, but it is not clear when this will happen.\n\n* Fibonacci Retracement: The stock's price has recently retraced to the 61.8% Fibonacci level, which is a sign that the stock is due for a bounce. However, the stock's price is still below its 200-day moving average, which is a sign that the stock is still in a downtrend.\n\n* Bollinger Bands: The stock's price is currently trading below its lower Bollinger Band, which is a sign that the stock is oversold. This means that the stock is due for a bounce, but it is not clear when this will happen.\n\nOverall, the technical analysis is bearish for this stock. The stock's price is below its moving averages, the MACD is below its signal line, the RSI is oversold, and the Bollinger Bands are indicating that the stock is oversold. This suggests that the stock is likely to continue to decline in the near term.","movingAverages":2,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":8,"overallTrend":"downward","riskLevel":3,"overallRisk":"high","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"In summary, the technical analysis for CC.D.C.USS.IP shows mixed signals. The Moving Averages indicator suggests a neutral trend, while the Moving Average Convergence Divergence (MACD) indicator suggests a bullish trend. The Relative Strength Index (RSI) is in neutral territory, indicating neither overbought nor oversold conditions. The Fibonacci Retracement tool shows that the stock price is currently trading near the 38.2% retracement level. The Bollinger Bands indicator shows that the stock price is trading within the bands, indicating a period of consolidation. Overall, the technical analysis suggests that the stock is in a neutral to slightly bullish trend, but further analysis is needed to determine the future direction of the stock price. The overall risk level is assessed as medium, with a high risk of short-term volatility and a low risk of long-term decline. The overall risk is classified as medium. The final decision is to HOLD.","movingAverages":4,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":5,"fibonacciRetracement":7,"bollingerBands":5,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is upward. The moving averages are showing a positive trend, with the 50-day moving average above the 200-day moving average. The MACD is also showing a positive trend, with the MACD line above the signal line and the histogram bars increasing in size. The RSI is indicating that the stock is overbought, but it is still below the 70 level, which indicates that there is still room for growth. The Fibonacci retracement levels show that the stock is trading near the 61.8% retracement level, which is a potential support level. The Bollinger Bands are showing that the stock is trading within the upper Bollinger Band, which indicates that it is overbought. Overall, the technical analysis indicates that the stock is in a bullish trend and has the potential for further growth. However, investors should be aware that the stock is overbought and there is a risk of a pullback.","movingAverages":6,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":5,"fibonacciRetracement":8,"bollingerBands":8,"overallTrend":"upward","riskLevel":0,"overallRisk":"low","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is slightly upward. The moving averages are indicating a neutral trend, with the MACD indicating a slight upward trend. The RSI is indicating a neutral trend, while the Bollinger Bands are indicating a slight upward trend. The Fibonacci Retracement is indicating a neutral trend. The overall risk is low, with a score of 1 out of 5. The overall risk level is low. The decision is HOLD.","movingAverages":5,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"upward","riskLevel":1,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"Overall, the analysis mainly recommends *HOLD*, with only 2 methods suggesting a SELL at this time. The moving averages methodology is leaning towards *SELL*. MACD is having a bearish momentum, as the MACD line has crossed below the signal line. Relative Strength Index is slightly bearish as it's below 50 at 42.25. Fibonacci Retracement levels indicate a possible *STRONG SELL* with the current price action near the 78.6% retracement level. Bollinger Bands are also bearish, with the current price action outside the lower Bollinger Band. Overall, this analysis does not suggest a high risk level for this stock. The overall trend is neutral, however, with a higher risk level and all signals pointing to a *SELL* it is likely the trend will soon be downward. Therefore, our final recommendation is *HOLD*.","movingAverages":2,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":4,"fibonacciRetracement":0,"bollingerBands":1,"overallTrend":"neutral","riskLevel":2,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":4,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":["downward","neutral","upward","upward","neutral"],"riskLevel":2,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}