{"results":[{"summary":"The stock price has been on a downward trend since the beginning of the data set. The Moving Averages, MACD, and Bollinger Bands all indicate a strong sell signal. The RSI is the only indicator that is not in a sell zone, but it is still below 50, which indicates a bearish trend. Overall, the technical analysis suggests that the stock is likely to continue to decline in the short term.","movingAverages":2,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":2,"fibonacciRetracement":0,"bollingerBands":0,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"STRONG SELL","epic":"CC.D.C.USS.IP"},{"summary":"The stock market has been volatile in the past month, with prices fluctuating significantly. The overall trend is neutral. The MACD and RSI indicators are both showing signs of a potential reversal, which could lead to a change in the overall trend. The fibonacci retracement indicator suggests that the stock is currently undervalued, which could indicate a buying opportunity. The bollinger bands indicator is showing that the stock is currently trading within a neutral range, which could indicate that the stock is not overbought or oversold. Overall, the technical analysis suggests that the stock is currently in a neutral position, and the overall risk is moderate. A conservative approach would be to wait for a more clear trend to develop before making a decision. However, if you are a more aggressive investor, you may want to consider buying this stock as it is currently undervalued and has the potential to increase in value in the future.","movingAverages":7,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":6,"fibonacciRetracement":8,"bollingerBands":6,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The Moving Averages is showing slight negativity where the MACD is bullish . The RSI is in the neutral area. The Fibonacci is very bullish, showing major positive signal and support area for the stock. A positive signal is being shown by Bollinger Bands , while overall trend is upward, however the risk level is 2 out of 5, with an overall risk of 'medium'. Therefore, the decision is to hold the stock.","movingAverages":7,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":5,"fibonacciRetracement":10,"bollingerBands":8,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend is upwards. The moving averages, MACD, relative strength index, and Bollinger Bands are all indicating a buy signal. The risk level is 2 out of 5, and the overall risk is medium. The decision is to BUY the stock.","movingAverages":9,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":7,"fibonacciRetracement":5,"bollingerBands":6,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"BUY","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":6,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":5,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}