{"results":[{"summary":"The stock price has been trending downward since the start of the data set, with a slight uptick in the middle. The MACD indicator is showing a bearish crossover, which is a sign that the stock price may continue to decline. The RSI indicator is also showing a downward trend, which is another sign that the stock price may continue to decline. The Fibonacci Retracement indicator is showing that the stock price is currently at the 61.8% retracement level, which is a potential support level. The Bollinger Bands indicator is showing that the stock price is currently below the lower Bollinger Band, which is another sign that the stock price may continue to decline. Overall, the technical analysis suggests that the stock price may continue to decline in the short term.","movingAverages":3,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":3,"fibonacciRetracement":7,"bollingerBands":4,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The technical analysis results are as follows:\n\n* Moving Averages: The stock price is currently below its moving averages, which is a bearish sign. Score: 2 out of 10\n\n* MACD: The MACD line has recently crossed below the signal line, which is a bearish sign. Score: 1 out of 10\n\n* Relative Strength Index: The RSI is currently below 50, which is a bearish sign. Score: 4 out of 10\n\n* Fibonacci Retracement: The stock price is currently below the 38.2% Fibonacci retracement level, which is a bearish sign. Score: 3 out of 10\n\n* Bollinger Bands: The stock price is currently below the lower Bollinger Band, which is a bearish sign. Score: 0 out of 10\n\nOverall, the technical analysis results are bearish, suggesting that the stock price is likely to continue to decline in the near term. The overall risk level is 3 out of 5, and the overall risk is medium. Given these results, the decision is to SELL.","movingAverages":2,"movingAveragesConvergenceDivergence":1,"relativeStrengthIndex":4,"fibonacciRetracement":3,"bollingerBands":0,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"Whilst the Bollinger Bands, Fibonacci Retracement, RSI and MACD all give a positive indication that the price of the stock will rise, the moving averages are showing that the price of the stock is more likely to fall, making the overall trend of the stock uncertain. The risk level of the stock is 4 out of 5, making it a high risk investment, and the overall risk is medium. The decision is to hold the stock.","movingAverages":10,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":8,"fibonacciRetracement":9,"bollingerBands":8,"overallTrend":"neutral","riskLevel":4,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The Moving Averages analysis indicates the price of the stock is likely to go down, as the 10-day moving average is slightly lower than the 50-day moving average. The MACD (Moving Average Convergence Divergence) indicator is providing a strong sell signal, with the MACD line below the signal line and the histogram being negative. The RSI (Relative Strength Index) indicator is suggesting the stock is in neutral territory, as it is not currently indicating either overbought or oversold conditions. The Fibonacci Retracement levels show that the stock has recently experienced a pullback from a recent high, and is currently trading at the 38.2% retracement level and the 50% retracement level. The Bollinger Bands indicator shows that the stock is currently trading within the Bollinger Bands, suggesting that there is no extreme volatility at this time. Overall, the technical analysis suggests that the stock is likely to continue to decline in the short term. The risk level is moderate, and the overall risk is medium. The decision is to SELL.","movingAverages":5,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":4,"overallTrend":"downward","riskLevel":4,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}