{"results":[{"summary":"The 5 technical analysis methods, Moving Averages, MACD, Fibonacci Retracement, Bollinger Bands & RSI strongly suggest a downward trend for CC.D.C.USS.IP stock. This stock has a moderate risk level. The overall risk of investing in this stock is medium. The decision is to SELL.","movingAverages":3,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":4,"fibonacciRetracement":2,"bollingerBands":6,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The Moving Averages, MACD, and Bollinger Bands indicators suggest an overall upward trend, whereas the Fibonacci Retracement and RSI indicate a possible downward trend or neutral market condition. Taking into consideration all five indicators, we can conclude that the stock may be in a neutral or slightly bullish position at the moment. It is important to note that this analysis is based solely on the provided financial data and does not incorporate any other factors that may influence the stock's performance. Therefore, investors should conduct further research and consider their own risk tolerance and investment goals before making any trading decisions based on this analysis.","movingAverages":6,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":7,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The Moving Averages, MACD, Relative Strength Index, Fibonacci Retracement, and Bollinger Bands all provide different insights into the potential future movement of a stock's price. When combined, these indicators can provide a more comprehensive view of the market and help investors make more informed decisions. In the case of this particular stock, the Moving Averages indicate that the stock is currently in a downtrend, while the MACD and RSI suggest that the stock is oversold. The Fibonacci Retracement indicates that the stock has potential resistance at the 38.2% level, while the Bollinger Bands indicate that the stock is currently trading near the lower Bollinger band. Overall, the technical analysis suggests that the stock is likely to continue to move lower in the short term. However, investors should be aware that technical analysis is not always accurate, and they should always do their own research before making any investment decisions.","movingAverages":4,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":7,"fibonacciRetracement":6,"bollingerBands":3,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"STRONG SELL","epic":"CC.D.C.USS.IP"},{"summary":"The stock is volatile, with the last traded price going down a total of 1.38% since Friday. The MACD indicator is bearish. The short-term average is below the long-term average and the oscillator is below its signal line. The RSI is in oversold territory, which could indicate that the stock is undervalued. The Fibonacci Retracement levels show that the stock is currently trading near the 38.2% Fibonacci level. The Bollinger Bands indicator shows that the stock is trading within the lower Bollinger Band. Overall, the technical analysis suggests that the stock is in a downtrend and could be undervalued. A more in-depth analysis would be needed to make a more informed decision.","movingAverages":5,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":3,"fibonacciRetracement":7,"bollingerBands":5,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"BUY"},{"summary":"The overall trend for this stock is upward. The moving averages are showing a positive trend, with the 50-day moving average above the 200-day moving average. The MACD is also showing a positive trend, with the MACD line above the signal line. The RSI is showing a neutral trend, with the RSI line near the 50 level. The Fibonacci retracement levels show that the stock is currently trading near the 38.2% retracement level. The Bollinger Bands are showing that the stock is trading within the upper Bollinger Band, which indicates that the stock is overbought. The overall risk level for this stock is medium, with a risk level of 3 out of 5. The overall risk is medium. The decision is to HOLD.","movingAverages":6,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":7,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":6,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}