{"results":[{"summary":"The overall trend is upwards, with the price of the stock increasing over the past few days. The moving averages are also trending upwards, which indicates that the stock is likely to continue to rise in value. The MACD is also positive, which is another indication that the stock is likely to continue to rise in value. The RSI is above 50, which indicates that the stock is overbought, but it is not yet in the overbought zone. The Bollinger Bands are also widening, which indicates that the stock is likely to continue to be volatile. Overall, the technical analysis suggests that the stock is likely to continue to rise in value, but it is important to note that the stock market is volatile and anything can happen. It is always important to do your own research before making any investment decisions.","movingAverages":8,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":5,"fibonacciRetracement":7,"bollingerBands":7,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"Based on the technical analysis methods Moving Averages, MACD, RSI, Fibonacci Retracement and Bollinger Bands, the overall trend of the CC.D.C.USS.IP stock is neutral, but with a high risk of volatility. The moving averages indicate a potential downward trend, while the MACD and RSI suggest a possible upward trend. The Fibonacci Retracement and Bollinger Bands are neutral. Overall, the stock's price is likely to fluctuate in the near future, so caution is advised when making investment decisions.","movingAverages":5,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":7,"fibonacciRetracement":5,"bollingerBands":6,"overallTrend":"neutral","riskLevel":4,"overallRisk":"high","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"Overall, the stock is currently showing a slightly negative trend, however there is some evidence that it may be recovering.  The Moving Averages indicator shows a score of 5 out of 10, indicating a neutral trend. The MACD indicator also shows a score of 5 out of 10, indicating a neutral trend. The RSI indicator shows a score of 6 out of 10, indicating a slightly overbought condition. The Fibonacci Retracement indicator shows a score of 7 out of 10, indicating that the stock is currently trading at a level that is close to a support level. The Bollinger Bands indicator shows a score of 5 out of 10, indicating that the stock is currently trading within the Bollinger Bands. The overall trend is neutral, the risk level is medium and the overall risk is medium. The decision is HOLD.","movingAverages":5,"macd":5,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":5,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The analysis of this financial data shows there is an overall **BUY** indication. The Moving Averages analysis is **HOLD** with a score of 7 out of 10, the Moving Averages Convergence Divergence is **BUY** with a score of 10 out of 10, the Relative Strength Index is **SELL** with a score of 4 out of 10, Fibonacci Retracement is **BUY** with a score of 9 out of 10, Bollinger Bands are **HOLD** with a score of 6 out of 10. The overall trend is **UPWARD**. The overall risk is **MEDIUM** with a risk level of 3 out of 5. Thus, the decision is **STRONG BUY**","movingAverages":7,"movingAveragesConvergenceDivergence":10,"relativeStrengthIndex":4,"fibonacciRetracement":9,"bollingerBands":6,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is upward. The moving averages are showing a score of 8 out of 10 suggesting a positive trend. The MACD is also indicating a positive trend with a score of 9 out of 10. The RSI is at 6 out of 10 indicating a neutral trend. The fibonacci retracement is showing a score of 7 out of 10 also suggesting a positive trend. The Bollinger bands are showing a score of 8 out of 10 indicating a positive trend making the overall risk level 1 and the overallRisk low. With these factors it is recommended to STRONG BUY the stock.","movingAverages":8,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":8,"overallTrend":"upward","riskLevel":1,"overallRisk":"low","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":7,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":6,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":["BUY","HOLD","HOLD","STRONG BUY","STRONG BUY"],"epic":"CC.D.C.USS.IP","macd":5},"open_position":true,"epic":"CC.D.C.USS.IP"}