{"results":[{"summary":"The stock price has been on a downward trend since the opening of the day's trading. The moving averages are indicating a downward trend, and the MACD is also indicating a downward trend. The RSI is showing that the stock is oversold, which could lead to a reversal in the trend. The Fibonacci Retracement shows that the price has fallen to the 50% retracement level, which is a potential support level. The Bollinger Bands are indicating that the price is in a neutral range. Overall, the indicators are showing a mixed picture, but the overall trend is downward. The risk level is moderate, and the overall risk is medium. The decision is to HOLD.","movingAverages":3,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":2,"fibonacciRetracement":6,"bollingerBands":3,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"Taking all of the different analyses into account, the stock trend can be classified as Neutral as for the Moving Average the price is trending upwards, the MACD is indicating a change in trend, but the RSI is indicating the stock is currently overbought. The overall risk for the stock has been classified as Low. The price of stock is predicted to potentially increase in the short term.","movingAverages":0,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":0,"fibonacciRetracement":0,"bollingerBands":0,"overallTrend":"neutral","riskLevel":0,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall sentiment for this stock is slightly bearish. The moving averages indicate a slight downward trend, with the MACD indicating a neutral trend. The RSI is slightly oversold, while the Bollinger Bands indicate that the stock is trading within a narrow range. Overall, the risk level is low and the overall risk is low. A SELL decision is recommended.","movingAverages":7,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":4,"bollingerBands":4,"overallTrend":"downward","riskLevel":2,"overallRisk":"low","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The overall sentiment for CC.D.C.USS.IP is mixed. The moving averages provide a neutral indication, with a score of 5 out of 10, suggesting that the stock price may not have a clear trend. The MACD analysis also indicates a neutral trend, with a score of 5 out of 10, suggesting that there is no clear momentum in the stock price. The RSI is slightly bearish, with a score of 4 out of 10, indicating that the stock may be overbought and due for a correction. The Fibonacci retracement analysis indicates a potential support level at $396.9, with a score of 6 out of 10, suggesting that the stock price may find support at this level. The Bollinger Bands analysis indicates a neutral trend, with a score of 5 out of 10, suggesting that the stock price is not currently in an overbought or oversold condition. Overall, the technical analysis suggests that the stock is in a neutral or slightly bearish trend, and investors may want to proceed with caution before making any investment decisions. The risk level is moderate, with a score of 3 out of 5, indicating that there is some potential for loss. The overall risk is medium.","movingAverages":5,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":4,"fibonacciRetracement":6,"bollingerBands":5,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"Based on the technical analysis methods, the stock appears to be in a short term downward trend but has some long term upward potential. Moving Averages analysis indicates the stock price is likely going down with a score of 4 out of 10. Moving Average Convergence Divergence indicator is providing a neutral signal with a score of 5 out of 10. Relative Strength Index is showing that the stock is overbought with a score of 3 out of 10. Fibonacci Retracement analysis indicates the stock price is likely going up with a score of 6 out of 10. Bollinger Bands analysis indicates the stock price is likely going down with a score of 4 out of 10. Overall, the technical analysis indicates that the stock price is likely going down with an overall trend score of 4 out of 10. The risk level is 3 out of 5, overall risk of medium. The recommendation is to HOLD the stock.","movingAverages":4,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":3,"fibonacciRetracement":6,"bollingerBands":4,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":4,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":3,"fibonacciRetracement":4,"bollingerBands":3,"overallTrend":"downward","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}