{"results":[{"summary":"The overall sentiment is slightly bearish, with a score of 5 out of 10. The MACD is slightly bearish, with a score of 4 out of 10. The RSI is slightly bullish, with a score of 6 out of 10. The Fibonacci retracement is slightly bullish, with a score of 7 out of 10. The bollinger bands are slightly bearish, with a score of 4 out of 10. The overall trend is slightly downward. The risk level is 3 out of 5. The overall risk is medium. The decision is HOLD.","movingAverages":5,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":4,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The trend for this stock is downwards, with a high risk level and overall high risk. The moving averages are neutral, the MACD is neutral, the RSI is neutral, the fibonacci retracement is neutral and the Bollinger Bands are neutral. Overall, the stock is not recommended for buying at this time.","movingAverages":5,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"Based on the technical analysis methods that I have used, overall the stock price has been trending downwards. The moving averages are showing a downward trend, MACD is showing a downward trend, Fibonacci Retracement is showing a neutral trend, Bollinger Bands are showing a downward trend and RSI is showing a neutral trend. The overall risk level for this stock is 3 out of 5 and overall risk is medium. Therefore, a good decision would be to SELL this stock.","movingAverages":0,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":0,"fibonacciRetracement":0,"bollingerBands":0,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The stock price has been on a downward trend since the beginning of the data set. The moving averages are all below the current price, indicating that the stock is in a downtrend. The MACD is also below the zero line, indicating that the stock is not in a bullish trend. The RSI is below 50, indicating that the stock is not overbought. The Fibonacci retracement levels are all below the current price. The Bollinger Bands are below the current price, indicating that the stock is trading below its average price. Overall, the technical analysis indicates that the stock is in a downtrend and is likely to continue to fall. Risk Level: 5, Overall Risk: High, Decision: SELL","movingAverages":1,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":5,"fibonacciRetracement":1,"bollingerBands":1,"overallTrend":"downward","riskLevel":5,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"Overall the analysis suggests there is a downward trend in the price of this stock, with medium risk and an overall risk assessment of low. The MACD and RSI analysis suggests the price is overbought and may be due a correction, however, the moving averages analysis suggests there is a small positive trend. The Fibonacci retracement suggests the share price may fall further in line with the MACD and RSI analysis. Bollinger Bands analysis is neutral. A STRONG SELL recommendation is suggested.","movingAverages":4,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":9,"fibonacciRetracement":4,"bollingerBands":5,"overallTrend":"downward","riskLevel":3,"overallRisk":"low","decision":"STRONG SELL","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":3,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":5,"fibonacciRetracement":3,"bollingerBands":3,"overallTrend":"downward","riskLevel":4,"overallRisk":["medium","high","medium","high","low"],"decision":"SELL","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}