{"results":[{"summary":"The overall trend of the stock is slightly upward. The moving averages are showing a mixed signal with 5 out of 10 indicating a downward trend and 5 out of 10 indicating an upward trend. The MACD indicator is also showing a mixed signal with 6 out of 10 indicating a downward trend and 4 out of 10 indicating an upward trend. The RSI indicator is showing a bullish signal with 8 out of 10 indicating an upward trend. The Fibonacci retracement levels are showing a support level at $395.5 and a resistance level at $402.5. The Bollinger Bands are showing that the stock is trading within the upper Bollinger Band, which indicates that the stock is overbought. The overall risk level is 3 out of 5, indicating a moderate risk. The overall risk is medium. The decision is to HOLD.","movingAverages":5,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":8,"fibonacciRetracement":5,"bollingerBands":7,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The price of the stock has been relatively constant over the past several days, and the volume of trade has been generally increasing. The stock price has been on a general upward trend over the past few months. The 50-day moving average is above the 200-day moving average, which is a sign of a bullish trend. The MACD indicator is above the signal line, and the histogram bars are increasing in size, which is also a sign of a bullish trend. The RSI indicator is above the 50 level, which indicates that the stock is overbought. The Fibonacci retracement levels indicate that the stock is currently trading between the 38.2% and 50% retracement levels. The Bollinger Bands are relatively wide, which indicates that the stock price is volatile. Overall, the technical indicators suggest that the stock is in a bullish trend, but it is overbought and may be due for a correction. \n\nThe risk level of the stock is moderate, and the overall risk is medium.","movingAverages":7,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":8,"fibonacciRetracement":5,"bollingerBands":6,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"Based on the analysis of various technical indicators, the stock's future price movement could be moderately bullish. The Moving Averages indicator (score: 7) suggests that the price is currently in a downtrend, but the Moving Average Convergence Divergence indicator (score: 8) indicates a potential bullish trend reversal. The Relative Strength Index indicator (score: 5) shows that the stock is neither overbought nor oversold, suggesting potential for further price movement in either direction. The Fibonacci Retracement indicator (score: 6) aligns with the overall trend, indicating potential support levels for the stock price. The Bollinger Bands indicator (score: 7) shows that the price is currently trading within the middle Bollinger Band, indicating a period of consolidation. Overall, the stock has a moderate risk level (riskLevel: 3), which is considered \"medium risk\" and translates to an \"overallRisk\" of \"medium\". Given these indicators, the suggested decision is \"HOLD\" for now, but traders should monitor the stock's price action closely for further confirmation of a bullish trend reversal before making any significant trades.","movingAverages":7,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":7,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The indicators are mainly down, with a couple of indicators showing a neutral position. Due to this, it appears this stock is a SELL.","movingAverages":4,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":3,"fibonacciRetracement":4,"bollingerBands":6,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"Over the last 19 hours the price of the stock has gone down. The moving averages analysis indicates a strong down trend but the MACD analysis indicates a medium buy. The RSI analysis indicates that the stock is not overbought or over sold. The fibonacci retracement analysis indicates a strong down trend. The Bollinger bands analysis indicates a likely downward trend. Overall, the recent trend of the stock is slightly down and the risk of buying the stock is considered high. The combined multiple technical analysis indicators recommend a STRONG SELL for this stock.","movingAverages":3,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":5,"fibonacciRetracement":2,"bollingerBands":4,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"STRONG SELL","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":6,"fibonacciRetracement":4,"bollingerBands":6,"overallTrend":["upward","neutral","neutral","upward","downward"],"riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}