{"results":[{"summary":"The Moving Average indicator tends towards a neutral position, indicating that the price is likely to continue in the same direction. The MACD indicator is also neutral, indicating that there is no clear trend. The Relative Strength Index (RSI) is neutral, indicating that the asset is not overbought or oversold. The Fibonacci Retracement indicator is neutral, indicating that there is no clear support or resistance level. The Bollinger Bands indicator is neutral, indicating that the price is within the normal range. Overall, the technical indicators suggest that the market is in a neutral state, and there is no clear indication of a trend. The risk level is low, as the indicators do not suggest any major price movements. The overall risk is low. The decision is HOLD.","movingAverages":7,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":7,"fibonacciRetracement":7,"bollingerBands":7,"overallTrend":"neutral","riskLevel":0,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"Although the MACD and Fibonacci Retracement indicators are showing bullish signs, the Moving Averages and RSI indicate a bearish trend. The Bollinger Bands are neutral, indicating that the price is neither overbought nor oversold. Overall, the technical analysis is mixed, with some indicators suggesting a bullish trend and others suggesting a bearish trend. However, the Moving Averages and RSI are more reliable indicators of the long-term trend, so it is likely that the price will continue to trend downwards in the near future. The risk level is 3 out of 5, indicating that there is a moderate amount of risk associated with investing in this stock. The overall risk is medium, indicating that there is a moderate amount of risk associated with investing in this stock. The decision is SELL.","movingAverages":6,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":4,"fibonacciRetracement":8,"bollingerBands":5,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"Based on the last 24 hours worth of financial data, the company is currently experiencing a downtrend. The price has been dropping significantly since the past few hours and is showing no signs of reversal. Most analysis methods are showing positive signs, with the exception of the Relative Strength Index, which has dropped below 50. The only analysis method which is strongly positive is the Bollinger Bands. All in all, the overall trend is likely to continue downward in the near term and this is likely correlated with external factors and/or news that has not yet been priced in by the market. It is important to continue monitoring technical indicators and news throughout the day for further updates and changes, especially since the financial report showed positive activity over the last few weeks.","movingAverages":2,"movingAveragesConvergenceDivergence":1,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":9,"overallTrend":"downward","riskLevel":0,"overallRisk":"low","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is slightly downward. The moving averages are slightly in favor of a downward trend, with a score of 5 out of 10. The MACD is slightly in favor of an upward trend, with a score of 7 out of 10. The RSI is slightly in favor of an upward trend, with a score of 6 out of 10. The fibonacci retracement is slightly in favor of an upward trend, with a score of 5 out of 10. The bollinger bands are slightly in favor of an upward trend, with a score of 6 out of 10. The overall risk level is 2 out of 5, which is considered low risk. The overall risk is considered medium risk. The decision is to HOLD.","movingAverages":5,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":6,"fibonacciRetracement":5,"bollingerBands":6,"overallTrend":"downward","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The analysis for CC.D.C.USS.IP was completed using the following 5 technical analysis methods: Moving Averages, MACD, Fibonacci Retracement, Bollinger Bands and Relative Strength Index (RSI).\n\nThe Moving Averages analysis gave a score of 6 out of 10, which indicates a relatively strong upward trend in the price of the stock.\n\nThe MACD analysis gave a score of 8 out of 10, which also indicates a strong upward trend in the price of the stock. \n\nThe Fibonacci Retracement analysis was 7 out of 10, which indicates that the stock is currently trading at a level that is close to a key support level.\n\nThe Bollinger Bands analysis gave a score of 9 out of 10, which indicates that the stock is currently trading within a relatively narrow range and may be due for a breakout.\n\nThe RSI analysis gave a score of 6 out of 10, which indicates that the stock is currently in a neutral zone and may be due for a move in either direction.\n\nOverall, the technical analysis of CC.D.C.USS.IP indicates that the stock is currently in a relatively strong upward trend. However, the RSI analysis indicates that the stock may be due for a move in either direction. As such, the overall trend is considered to be neutral.\n\nThe risk level for this stock is considered to be moderate, with a risk level of 3 out of 5. The overall risk is considered to be medium.\n\nBased on the technical analysis, a decision of HOLD is recommended.","movingAverages":6,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":9,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":7,"overallTrend":"downward","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}