{"results":[{"summary":"The stock with epic code CC.D.C.USS.IP shows a bullish trend. The Moving Averages indicator is giving a positive signal with the price above the 20 and 50-day Moving Averages. The MACD indicator is also showing a bullish momentum. The RSI is between 50 and 70 indicating a neutral to bullish trend. The Fibonacci Retracement levels indicate a strong support level at 400. The Bollinger Bands indicator shows that the price is trading within the Bollinger Bands, indicating a period of consolidation. Overall, the moving average, MACD, Fibonacci Retracement, and Bollinger Bands analysis indicate a bullish trend, while the RSI is neutral. This suggests that a BUY position could be considered, but the risk level is medium, making the overall risk medium. Therefore, the decision is HOLD.","movingAverages":9,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":5,"fibonacciRetracement":9,"bollingerBands":7,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The most recent trading day had a closing price of 403.4. The trading day had a relative low volume of 7256 shares and the overall trend of the stock is neutral, with the stock price seesawing. The moving averages analysis gives a score of 8 out of 10, indicating the stock price is in an upward trend. The moving averages convergence divergence analysis gives a score of 7 out of 10, indicating the stock price is in an upward trend. The relative strength index analysis gives a score of 6 out of 10, indicating the stock is in a neutral zone. The fibonacci retracement analysis gives a score of 8 out of 10, indicating the stock is in an upward trend. The bollinger bands analysis gives a score of 7 out of 10, indicating the stock price is in an upward trend. Overall, the risk level is 0 out of 5 and the overall risk is low. The decision is HOLD.","movingAverages":8,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":6,"fibonacciRetracement":8,"bollingerBands":7,"overallTrend":"neutral","riskLevel":0,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is upward. The moving averages are giving a score of 7 out of 10, which indicates a positive trend. The MACD is giving a score of 8 out of 10, which is also positive. The relative strength index is giving a score of 6 out of 10, which is neutral. The Fibonacci retracement is giving a score of 5 out of 10, which is neutral. The Bollinger Bands are giving a score of 7 out of 10, which is positive. Overall, the risk level is 2 out of 5, which is medium and overallRisk is medium.","movingAverages":7,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":6,"fibonacciRetracement":5,"bollingerBands":7,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"},{"summary":"The overall sentiment of the stock's technical analysis is bullish, with 7 out of the 10 indicators suggesting a buy or strong buy signal. Moving Averages, MACD, Fibonacci Retracement and Bollinger Bands are all giving positive signals, while RSI is giving a neutral signal. The stock has been in a downward trend for the past few days, but the recent surge in price action may indicate a reversal in trend. The risk level is medium, with a score of 3 out of 5, and the overall risk is medium. The decision is to BUY the stock.","movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":7,"fibonacciRetracement":9,"bollingerBands":8,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The indicators Moving Average, MACD and Relative Strength Index all suggest a sell. The Bollinger Bands, and Fibonacci Retracement are neutral. Overall, the trend is Neutral with the risk level of 1 out of 5, which could be considered as low risk. Therefore, the overall risk is low and the decision is HOLD .","movingAverages":0,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":0,"fibonacciRetracement":7,"bollingerBands":7,"overallTrend":"neutral","riskLevel":1,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":6,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":5,"fibonacciRetracement":8,"bollingerBands":7,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}