{"results":[{"summary":"This financial data indicates the stock price has moved from a high of 403.4 to a low of 395.1. The Moving Average seems to have a bullish divergence with it's current score of 3 out of 10 being better than the Moving Average Convergence Divergence's score of 1 out of 10. Technical indicators are giving a sell signal at the moment. The Relative Strength Index is at 4 out of 10, indicating that the stock is considered slightly overbought. Fibonacci Retracement is at 6 out of 10, indicating that the stock is in a retracement zone. Bollinger Bands is at 5 out of 10, indicating that the stock is overbought. Despite a few bullish signals, the overall trend is neutral with a slight bearish bias and with medium risk, so we issue a SELL recommendation.","movingAverages":3,"movingAveragesConvergenceDivergence":1,"relativeStrengthIndex":4,"fibonacciRetracement":6,"bollingerBands":5,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is slightly upward as the price has been moving up and down but overall has increased since the start. The moving average indicator gives a score of 8 out of 10 indicating that the stock is likely to continue to rise in the short term. The moving average convergence divergence (MACD) indicator gives a score of 7 out of 10 indicating that the stock is likely to continue to rise in the short term. The relative strength index (RSI) indicator gives a score of 6 out of 10 indicating that the stock is slightly overbought and may be due for a correction. The fibonacci retracement indicator gives a score of 5 out of 10 indicating that the stock is likely to continue to rise in the short term. The Bollinger Bands indicator gives a score of 9 out of 10 indicating that the stock is likely to continue to rise in the short term. Overall, the technical analysis indicates that the stock is likely to continue to rise in the short term. However, investors should be aware that the stock is slightly overbought and may be due for a correction. The overall risk level is 2 out of 5, indicating that the stock has a moderate level of risk. The overall risk is medium.","movingAverages":8,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":6,"fibonacciRetracement":5,"bollingerBands":9,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The technical analysis for CC.D.C.USS.IP shows bearish momentum in the short term. The Moving Averages indicator is giving a sell signal, as the short term moving average is below the long term moving average. The MACD indicator is also giving a sell signal, as the MACD line has crossed below the signal line and the histogram is below zero. The RSI indicator is oversold, which could indicate a potential reversal in the downtrend. The Fibonacci Retracement indicator shows that the current price is close to the 78.6% retracement level, which could act as a support level. The Bollinger Bands indicator shows that the price is currently below the lower Bollinger Band, which could indicate further downside potential. Overall, the technical analysis is indicating that the short term trend is bearish, with a potential for further downside in the near term. Risk level is assessed as medium, and the overall risk is moderate. A STRONG sell decision is therefore issued for this asset with an epic code CC.D.C.USS.IP.","movingAverages":2,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":3,"fibonacciRetracement":5,"bollingerBands":2,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"STRONG SELL","epic":"CC.D.C.USS.IP"},{"summary":"The overall sentiment and technical analysis indicators are point towards a Sell recommendation. The moving averages are trending down, with the 50-day MA below the 200-day MA. The MACD is also trending down, with the MACD line below the signal line. The RSI is oversold, which could indicate a potential reversal, but the overall trend is still down. The Fibonacci retracement levels show that the price has fallen below the 61.8% level, which is a key support level. The Bollinger Bands are also showing that the price is below the lower Bollinger Band, which is another indication of a downtrend. Overall, the technical analysis indicators are suggesting that the price will continue to fall in the short term. \n\nThere are some positive indicators to note, such as the fact that the volume has been increasing on the recent down days, which could indicate that there is buying interest at these levels. However, the overall trend is still down, and the technical indicators support this view. If the price falls below the 396.00 level, it could trigger further selling. Overall, the summary recommendation is to SELL with a risk level of 1 out of 5 indicating low risk. There is a overall low risk because the price has not fallen significantly below the 396.00 level, which is a key support level. ","movingAverages":6,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":3,"fibonacciRetracement":1,"bollingerBands":3,"overallTrend":"downward","riskLevel":1,"overallRisk":"low","decision":"SELL","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":4,"fibonacciRetracement":4,"bollingerBands":5,"overallTrend":"downward","riskLevel":2,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}