{"results":[{"summary":"The overall trend of the stock is upward. The moving averages are showing a slightly positive trend, with the 50-day moving average currently above the 200-day moving average. The MACD is showing a bullish trend, with the MACD line above the signal line and the histogram bars above zero. The relative strength index (RSI) is showing a neutral trend, with the RSI line currently around 50. The Fibonacci retracement levels show that the stock is currently trading above the 38.2% retracement level and below the 61.8% retracement level. The Bollinger Bands are showing that the stock is currently trading within the Bollinger Bands, indicating that the stock is not overbought or oversold. Overall, the technical analysis suggests that the stock is in a neutral to slightly bullish trend. The risk level is low, with the overall risk being low to medium. The decision is to HOLD the stock.","movingAverages":6,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"upward","riskLevel":1,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The technical analysis on CC.D.C.USS.IP indicates a moderate upward trend with medium risk. The moving averages analysis shows a slightly bullish inclination, with a score of 7 out of 10. The MACD analysis suggests a positive trend, with a score of 8 out of 10. The RSI indicator points to a neutral market condition, with a score of 5 out of 10. The Fibonacci retracement analysis indicates a potential for further upside, with a score of 7 out of 10. The Bollinger Bands analysis suggests a moderate level of volatility, with a score of 6 out of 10. Overall, the technical analysis suggests a positive outlook for CC.D.C.USS.IP, with potential for further upside in the near term.","movingAverages":7,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":5,"fibonacciRetracement":7,"bollingerBands":6,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"},{"summary":"The stock has been trending downwards over the past few days and is at a support level. RSI and stochastic indicators show that the stock is oversold and could be due for a bounce. The moving averages are also showing a downtrend, but the MACD is showing a bullish divergence. Overall, the stock is at a key level and could be due for a reversal. However, the overall trend is still down, and the risk is high.","movingAverages":3,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":9,"fibonacciRetracement":2,"bollingerBands":4,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"Although the stock appears to be trending upwards, given the recent drop in the price and the bearish outlook for the overall market, it would be recommended to SELL. Note that this analysis is not financial advice and should not be relied upon as such.","movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":3,"fibonacciRetracement":9,"bollingerBands":4,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":6,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":6,"fibonacciRetracement":6,"bollingerBands":5,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},"open_position":true,"epic":"CC.D.C.USS.IP"}