{"results":[{"summary":"Based on the technical analysis methods, the Moving Averages and the Bollinger Bands are giving a positive outlook on the stock's performance, while MACD, Fibonacci Retracement and RSI are indicating a negative outlook on the stock's performance. The stock has a slightly upward momentum with 10% high and 1% low movements. The risk level associated with the stock is 3 out of 5, indicating a medium risk. Overall the sentiment is neutral. The best decision is to HOLD the stock.","movingAverages":7,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":8,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend for the stock is upward. The moving averages are indicating a sell, the MACD is indicating a buy, the relative strength index is neutral, the fibonacci retracement is indicating a sell, the bollinger bands are indicating a sell.\nThe overall risk level is high, with a risk of 3 out of 5. giving it a overall risk of high. The decision is to SELL.","movingAverages":0,"movingAveragesConvergenceDivergence":10,"relativeStrengthIndex":5,"fibonacciRetracement":0,"bollingerBands":0,"overallTrend":"upward","riskLevel":3,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend for CC.D.C.USS.IP stock is upward. \nThe moving averages are showing a bullish signal. \nThe MACD indicator is showing a bullish signal. \nThe RSI is showing a neutral signal. \nThe Fibonacci retracement is showing a bullish signal. \nThe Bollinger Bands are showing a neutral signal. \nThe overall risk level is 3 out of 5. \nThe overall risk is medium. \nThe decision is STRONG BUY.","movingAverages":10,"movingAveragesConvergenceDivergence":10,"relativeStrengthIndex":5,"fibonacciRetracement":7,"bollingerBands":5,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"},{"summary":"Based on the technical analysis of Moving Averages, MACD, RSI, Fibonacci Retracement and Bollinger Bands, the stock is currently in a downward trend. The indicators are mostly bearish, with the Moving Averages and Bollinger Bands indicating that the price is likely to continue to decrease. The MACD and RSI suggest that the stock is currently oversold and may be due for a short-term bounce, but the overall trend is still down. The Fibonacci Retracement indicates that the next support level is at $402.1 and the next resistance level is at $406.2. Overall, despite the oversold conditions, the risk level is still considered high and the overall trend is still down. A cautious approach is advised.","movingAverages":2,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":6,"fibonacciRetracement":4,"bollingerBands":3,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The technical analysis for CC.D.C.USS.IP provides mixed signals, with some indicators suggesting an upward trend and others pointing to a downward trend. The Moving Averages and MACD indicators suggest a potential upward trend, while the Relative Strength Index and Fibonacci Retracement indicators indicate a neutral to slightly downward trend. The Bollinger Bands analysis is also mixed, with the stock price currently trading above the lower Bollinger Band but below the upper Bollinger Band. Overall, the technical analysis suggests that the stock price is in a period of consolidation and may be due for a breakout in either direction. The risk level is moderate, with a risk rating of 3 out of 5, and the overall risk is medium. Given the mixed signals, it is recommended to closely monitor the stock's price movements and to conduct further analysis before making any trading decisions.","movingAverages":9,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":6,"fibonacciRetracement":5,"bollingerBands":6,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":6,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":5,"fibonacciRetracement":4,"bollingerBands":4,"overallTrend":["neutral","upward","upward","downward","neutral"],"riskLevel":3,"overallRisk":"medium","decision":["HOLD","SELL","STRONG BUY","SELL","HOLD"],"epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}