{"results":[{"summary":"The overall trend of the stock is upward. The moving averages are mostly positive, with the short-term moving averages above the long-term moving averages. The MACD is also mostly positive, with the MACD line above the signal line. The RSI is mostly above 50, indicating that the stock is overbought. The Fibonacci retracement levels show that the stock is currently trading above the 61.8% retracement level. The Bollinger Bands are also mostly positive, with the stock trading above the upper Bollinger Band. Based on these technical indicators, it is likely that the stock will continue to trend upward in the short term. However, it is important to note that past performance is not indicative of future results, and the stock could experience a reversal at any time. There is a risk of a drop to 410.00.","movingAverages":9,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":8,"fibonacciRetracement":7,"bollingerBands":8,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The stock price has been on an overall upward trend. The moving averages are showing a positive trend, with the 20-day moving average above the 50-day moving average. The Moving Average Convergence Divergence (MACD) is also showing a positive trend, with the MACD line above the signal line. The Relative Strength Index (RSI) is in the overbought territory, which indicates that the stock may be due for a correction. The Fibonacci retracement levels show that the stock is currently trading near the 61.8% retracement level, which is a potential support level. The Bollinger Bands are showing that the stock is currently trading within the upper Bollinger Band, which indicates that the stock is overbought. Overall, the technical analysis indicates that the stock is in a bullish trend, but it may be due for a correction in the short term.","movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":7,"fibonacciRetracement":7,"bollingerBands":6,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is upwards. The moving averages are indicating a buy signal, with the MACD also indicating a buy signal. The RSI is indicating a neutral signal. The fibonacci retracement is indicating a sell signal. The Bollinger Bands are indicating a neutral signal. The overall risk level is 2 out of 5, indicating a medium risk. The overall risk is medium. The decision is to BUY the stock.","movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":5,"fibonacciRetracement":2,"bollingerBands":5,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is upward. The moving averages are showing a positive trend, with the 50-day moving average above the 200-day moving average. The MACD is also showing a positive trend, with the MACD line above the signal line and the histogram bars above the zero line. The RSI is also showing a positive trend, with the RSI value above the 50 level. The Fibonacci retracement levels show that the stock is currently trading above the 61.8% retracement level, which is a bullish sign. The Bollinger Bands are also showing a positive trend, with the stock price trading above the upper Bollinger Band. Overall, the technical analysis indicates that the stock is in a bullish trend and is likely to continue to rise in the short-term. However, it is important to note that technical analysis is not a perfect predictor of future stock prices and should be used in conjunction with other forms of analysis when making investment decisions.","movingAverages":8,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":9,"fibonacciRetracement":8,"bollingerBands":9,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"},{"summary":"The price of the stock has been trending upwards over the past few days, with some minor fluctuations. The moving averages show that the stock is currently in a neutral trend, but the MACD indicator suggests that there is some bullish momentum building up. The Fibonacci retracement levels show that the stock is currently trading near the 50% retracement level, which could indicate that there is some further upside potential. The Bollinger Bands show that the stock is currently trading within the upper Bollinger Band, which could indicate that it is overbought. The RSI indicator is currently showing a value of 55, which is slightly above the neutral level of 50. Overall, the technical analysis suggests that the stock is in a neutral trend, but there is some bullish momentum building up. The stock could be a good buy if it can break above the 50% Fibonacci retracement level and stay within the upper Bollinger Band.","movingAverages":6,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":6,"fibonacciRetracement":5,"bollingerBands":6,"overallTrend":"neutral","riskLevel":1,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":7,"fibonacciRetracement":6,"bollingerBands":7,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":["BUY","HOLD","BUY","STRONG BUY","HOLD"],"epic":"CC.D.C.USS.IP"},"open_position":true,"epic":"CC.D.C.USS.IP"}