{"results":[{"summary":"The overall trend for this stock is upward, with a score of 7 when using Moving Averages, 6 when using MACD, 8 when using RSI, 6 when using Fibonacci Retracement, and 7 when using Bollinger Bands. The overall risk level is 2, which is considered low risk. The overall risk is low. The decision is to BUY.","movingAverages":7,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":8,"fibonacciRetracement":6,"bollingerBands":7,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend for CC.D.C.USS.IP is Neutral. The Moving Averages indicator suggests a selling position with a score of 2 out of 10. The MACD indicator suggests a selling position with a score of 1 out of 10. The Relative Strength Index indicator suggests a selling position with a score of 2 out of 10. The Fibonacci Retracement indicator suggests a buying position with a score of 10 out of 10. The Bollinger Bands indicator suggests a selling position with a score of 1 out of 10. The overall trend appears to be Neutral, with a risk level of 3 out of 5. The overall risk is Medium. The decision is HOLD.","movingAverages":2,"movingAveragesConvergenceDivergence":1,"relativeStrengthIndex":2,"fibonacciRetracement":10,"bollingerBands":1,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The financial data provided shows a downward trend in stock prices over the period analyzed. The Moving Averages method indicates a weak bearish trend, with an average score of 3 out of 10. The MACD method also suggests a bearish trend, with a score of 4 out of 10. The RSI method indicates oversold conditions, with a score of 2 out of 10. The Fibonacci Retracement method suggests that the stock price is approaching a support level, with a score of 7 out of 10. The Bollinger Bands method indicates that the stock price is below the lower Bollinger Band, which could indicate a potential for further decline, with a score of 5 out of 10. Overall, the technical analysis suggests that the stock is in a bearish trend with potential for further decline. The risk level is assessed as 4 out of 5, indicating a high level of risk. The overall risk is considered high. Given these indicators, the recommended decision is SELL.","movingAverages":3,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":2,"fibonacciRetracement":7,"bollingerBands":5,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The stock has been on a downward trend over the past week, with consistent lower lows and lower highs. The technical analysis indicators, Moving Averages, MACD, RSI, Fibonacci Retracement, and Bollinger Bands, also suggest downward pressure on the stock price. The overall trend for this stock is downward with a risk level of 4 out of 5, which classifies the overall risk of this stock as medium. Based on this analysis, it is recommended to SELL this stock.","movingAverages":4,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":2,"fibonacciRetracement":1,"bollingerBands":4,"overallTrend":"downward","riskLevel":4,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":4,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":4,"fibonacciRetracement":6,"bollingerBands":4,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}