{"results":[{"summary":"The overall trend for CC.D.C.USS.IP has been upward in the past month. The moving averages indicate a neutral trend, with the 50-day moving average above the 200-day moving average. The MACD indicator is also neutral, with the MACD line above the signal line but below the zero line. The RSI indicator is in the overbought territory, which suggests that the stock may be due for a correction. The Fibonacci retracement levels show that the stock has retraced 38.2% of its previous uptrend, which is a common retracement level. The Bollinger Bands indicator shows that the stock is trading within the upper Bollinger Band, which suggests that it is overbought. Overall, the technical analysis indicates that CC.D.C.USS.IP has been in an upward trend but may be due for a correction. The risk level is moderate, and the overall risk is medium.","movingAverages":4,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":9,"fibonacciRetracement":5,"bollingerBands":9,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The Moving Averages indicator currently suggests that the trend is downward with a score of 2 out of 10. The MACD indicator suggests a bullish trend with a score of 7 out of 10. The Relative Strength Index indicator is currently in the neutral zone, with a score of 5 out of 10. The Fibonacci Retracement indicator is currently in the neutral zone, with a score of 6 out of 10. The Bollinger Bands indicator is currently in the neutral zone, with a score of 5 out of 10. Overall, the indicators suggest a neutral trend, with a risk level of 3 out of 5 and an overall risk of medium. The decision is to HOLD.","movingAverages":2,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":5,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend for this stock is upward. The moving average suggests a mild buy signal, the MACD indicates a strong buy signal, the RSI is neutral, the Fibonacci Retracement is neutral, the Bollinger Bands indicate a strong buy signal. The overall risk is medium and the overall risk is medium. The recommended decision is STRONG BUY.","movingAverages":6,"movingAveragesConvergenceDivergence":10,"relativeStrengthIndex":6,"fibonacciRetracement":5,"bollingerBands":10,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"},{"summary":"The stock has been trending upwards over the past 24 hours. The moving averages indicate a strong bullish trend, with the MACD also indicating a bullish trend. The RSI is in the overbought territory, indicating that the stock may be overvalued. The Fibonacci retracement levels show that the stock is currently trading near the 61.8% retracement level, which is a potential support level. The Bollinger Bands are also indicating a bullish trend, with the stock trading above the upper Bollinger Band. Overall, the technical analysis indicates a strong bullish trend, but the RSI suggests that the stock may be overbought and due for a pullback. The overall risk level is medium and the overall risk is medium.","movingAverages":7,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":7,"fibonacciRetracement":7,"bollingerBands":8,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"BUY"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":7,"fibonacciRetracement":6,"bollingerBands":8,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}