{"results":[{"summary":"The stock price has been on a downwards trend for the past few days. The overall trend is downward, and the risk level is 4 out of 5. The overall risk is high. The decision is to SELL.","movingAverages":2,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":2,"fibonacciRetracement":8,"bollingerBands":4,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The current technical analysis methods are suggesting that the CC.D.C.USS.IP stock is in a downward trend. Moving Averages and MACD are signalling sell, while Fibonacci Retracement and Bollinger Bands are suggesting a Neutral outlook. The RSI is the only indicator suggesting that it is a good time to buy. Given that 3 out of the 5 indicators are either suggesting to sell or neutral, it would be best to either sell or hold this stock for the time being.\n\nBased on the Moving Averages crossing below each other, the MACD Signal Line crossing above the MACD Line along with the price being below the Bollinger Bands, we can assume that the price of the stock will continue to decrease.\n\nThe Fibonacci Retracement levels show that the stock has already retraced to the 0.382 level, which increases the likelihood of prices to reverse from here and continue the downward trend.\n\nThe RSI has just dipped below 30, indicating that the stock is oversold, and could be ready for a bounce. However, it is possible that the RSI could continue to decline, so caution is advised.","movingAverages":2,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":7,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is slightly bullish. The moving averages and the MACD are both indicating a buy signal. The RSI is also indicating a buy signal. The Fibonacci Retracement is indicating a sell signal. The Bollinger Bands are indicating a neutral signal. The overall risk level is 1 out of 5. The overall risk is low. The decision is BUY.","movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":8,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"upward","riskLevel":1,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The security appears to be in a period of downturn with the last 22 out of the 47 snapshots taken showing a downward price trend. The Moving Averages indicator is pointing downward with a score of 3 out of 10. The MACD indicator is showing signs of downward movement with a score of 2 out of 10. The RSI is also showing signs of downward movement with a score of 4 out of 10. The Fibonacci Retracement indicator is showing signs of a downward trend with a score of 3 out of 10. The Bollinger Bands indicator is indicating a downward trend with a score of 1 out of 10. The overall trend for this security is considered to be downward. The risk level is considered to be moderate with a score of 3.5 out of 5. The overall risk is considered to be moderate. Based on the analysis, a SELL decision is recommended.","movingAverages":3,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":4,"fibonacciRetracement":3,"bollingerBands":1,"overallTrend":"downward","riskLevel":3.5,"overallRisk":"moderate","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The Moving Averages (MA) indicator is showing a neutral trend with a score of 5 out of 10, which means the stock price is not in a clear trend. The Moving Average Convergence Divergence (MACD) indicator is also showing a neutral trend with a score of 5 out of 10, indicating no clear momentum. The Relative Strength Index (RSI) indicator is slightly bullish with a score of 6 out of 10, indicating that the stock is slightly overbought. The Fibonacci Retracement indicator is showing a neutral trend with a score of 5 out of 10, suggesting that the stock price is not in a clear trend. The Bollinger Bands indicator is showing a neutral trend with a score of 5 out of 10, indicating that the stock price is not in a clear trend. Overall, the technical analysis suggests that the stock price is currently in a neutral trend. The risk level is 3 out of 5, which is considered medium risk. The overall risk is therefore medium. The decision is to HOLD.","movingAverages":5,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":6,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":4,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":4,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}