{"results":[{"summary":"The stock has been on a downward trend for the past few days, with some brief periods of upward movement. The Moving Averages, MACD, and Bollinger Bands all indicate a downward trend. The RSI is currently in the overbought territory, which could indicate a potential reversal in the downward trend. Overall, the risk level is considered to be medium, and the overall risk is considered to be moderate. A STRONG SELL decision is advised.","movingAverages":3,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":7,"fibonacciRetracement":5,"bollingerBands":3,"overallTrend":"downward","riskLevel":3,"overallRisk":"moderate","decision":"STRONG SELL","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend is upward based on the Moving Averages, Bollinger Bands, MACD & Fibonacci Retracement. The Relative Strength Index indicates a neutral trend. The current price action suggests that the price is likely to continue moving up. With the last 5 trading days showing a gradual decline in both price and volume it could indicate a slight correction or a potential sign of weakness. However, the strong uptrend in the past 2 weeks suggests that any correction could be limited. Overall we remain bullish on future price action and see no cause for concern at the current time.","movingAverages":10,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":8,"bollingerBands":9,"overallTrend":"upward","riskLevel":1,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The stock's Moving Averages indicate a bearish trend. The Moving Average Convergence Divergence (MACD) also suggests a bearish trend. The Relative Strength Index (RSI) is in the oversold territory, indicating a potential reversal in trend. The Fibonacci Retracement levels suggest that the stock may find support near the 0.5 retracement level. The Bollinger Bands are currently neutral, as the stock is trading within the bands. Overall, the technical analysis suggests a bearish trend with a potential for a reversal in the short term. The risk level is moderate, and the overall risk is medium. A HOLD decision is recommended.","movingAverages":8,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":8,"fibonacciRetracement":7,"bollingerBands":5,"overallTrend":"downward","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"This stock with EPIC 'CC.D.C.USS.IP' has been in a slow uptrend over the past month. The moving averages and the moving average convergence divergence indicators suggest a positive outlook for the stock. The relative strength index indicates that the stock is overbought, which suggests that a pullback may be in order in the short term. The fibonacci retracement indicator suggests that the stock has room to run before it reaches a major resistance level. Overall, the technical analysis suggests that the stock is in the 'strong buy' range, which indicates that the stock has a lot of potential to grow in the future. However, it is important to remember that technical analysis is not a perfect science and there are many factors that can affect the price of a stock. It is always important to do your own research before making any investment decisions.","movingAverages":7,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":7,"fibonacciRetracement":8,"bollingerBands":9,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":7,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":7,"fibonacciRetracement":7,"bollingerBands":7,"overallTrend":["downward","upward","downward","upward"],"riskLevel":2,"overallRisk":"medium","decision":["STRONG SELL","BUY","HOLD","STRONG BUY"],"epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}