{"results":[{"summary":"The summary report of the five technical analysis methods applied to the financial data provided is as follows: \n\n**Moving Averages:**\nThe stock's price has been below its moving averages for most of the period considered, indicating a downward trend.\n\n**MACD (Moving Average Convergence Divergence):**\nThe MACD line has been below the signal line for the majority of the period, indicating a sell signal.\n\n**Relative Strength Index (RSI):**\nThe RSI has been below 50 for most of the period, indicating that the stock is oversold.\n\n**Fibonacci Retracement:**\nThe stock's price has been below the 61.8% Fibonacci retracement level for most of the period, indicating a strong downtrend.\n\n**Bollinger Bands:**\nThe stock's price has been below the lower Bollinger Band for most of the period, indicating a strong downtrend.\n\nOverall, the technical analysis of the stock's price indicates a strong downtrend. The stock's price is below its moving averages, the MACD line is below the signal line, the RSI is below 50, the stock's price is below the 61.8% Fibonacci retracement level, and the stock's price is below the lower Bollinger Band. As such, the overall trend is downward, the risk level is 4 out of 5, which is high, the overall risk is high, and the decision is to SELL.","movingAverages":2,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":1,"fibonacciRetracement":2,"bollingerBands":1,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"**Moving Averages:** The stock price is currently below its 50-day moving average, which is a bearish sign. The 50-day moving average is currently at $396.42, while the stock price is at $396.10. The stock price has been below its 50-day moving average for the past 10 days.\n\n**MACD (Moving Average Convergence Divergence):** The MACD is currently below its signal line, which is a bearish sign. The MACD is currently at -0.13, while the signal line is at 0.02. The MACD has been below its signal line for the past 8 days.\n\n**Relative Strength Index (RSI):** The RSI is currently at 34.03, which is in the oversold territory. This indicates that the stock is oversold and may be due for a correction.\n\n**Fibonacci Retracement:** The stock price is currently trading at the 38.2% Fibonacci retracement level, which is a common support level. If the stock price can hold above this level, it could be a sign that the downtrend is over.\n\n**Bollinger Bands:** The stock price is currently trading within the Bollinger Bands. This indicates that the stock is not overbought or oversold.\n\n**Overall Trend:** The overall trend is **downward**. The stock price has been in a downtrend for the past 10 days. The stock price is also below its 50-day moving average and the MACD is below its signal line. This indicates that the stock is likely to continue to trend down in the near term.\n\n**Risk Level:** The risk level is **3** out of 5. The stock price is currently oversold, which means that there is a high risk of a correction. The stock price is also below its 50-day moving average, which is a bearish sign. This indicates that the stock is likely to continue to trend down in the near term.\n\n**Overall Risk:** **Medium**\n\n**Decision:** **HOLD**","movingAverages":5,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":2,"fibonacciRetracement":6,"bollingerBands":5,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"Technical analysis on CC.D.C.USS.IP stock indicates Bullish signals based on Moving Averages, MACD, RSI, but a Bearish signal on Bollinger Bands, with an overall Bullish trend, giving it a calculated risk level of 1 out of 5. A summary of each technical indicator is given below:\n\nMoving Averages: \nThe stock price has consistently been above the moving averages for the past 20 trading days, indicating a Bullish trend.\n\nMACD: \nThe MACD line is consistently above the signal line, indicating a Bullish trend.\n\nRSI: \nThe RSI value is consistently above 50, indicating a Bullish trend.\n\nFibonacci Retracement:\nThe current price is above the 23.6% Fibonacci retracement level, indicating a Bullish trend.\n\nBollinger Bands:\nThe current price is below the Bollinger Bands' lower band, indicating a Bearish trend.\n\nBased on the above analysis, the overall trend is Bullish with a score of 7 out of 10. The Moving Averages, MACD, RSI, and Fibonacci Retracement indicators all support the Bullish trend, but the Bollinger Bands indicator provides a Bearish signal. Overall, the risk level is considered low, and the stock has a good potential for further growth.\n\nTherefore, a STRONG BUY is recommended.","movingAverages":10,"movingAveragesConvergenceDivergence":10,"relativeStrengthIndex":10,"fibonacciRetracement":8,"bollingerBands":0,"overallTrend":"upward","riskLevel":1,"overallRisk":"low","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is upward. The moving averages, MACD, and RSI are all showing bullish signs. The Fibonacci retracement levels show that the stock is currently trading in the 50% retracement zone. The Bollinger Bands are also showing that the stock is trading in a bullish zone. Overall, the technical analysis is positive and suggests that the stock is likely to continue to rise in the short term. However, it is important to note that no technical analysis is 100% accurate and that there is always the potential for the stock to reverse course. Therefore, it is important to consider all of the factors that could affect the stock's performance before making any investment decisions.","movingAverages":8,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":9,"fibonacciRetracement":8,"bollingerBands":9,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"BUY"}],"findings":{"movingAverages":6,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":6,"fibonacciRetracement":6,"bollingerBands":4,"overallTrend":["downward","downward","upward","upward"],"riskLevel":3,"overallRisk":"medium","decision":["SELL","HOLD","STRONG BUY","BUY"],"epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}