{"results":[{"summary":"The stock price has been on a downward trend for the past few days. The moving averages are showing a downward trend, with the short-term moving average below the long-term moving average. The MACD is also showing a downward trend, with the MACD line below the signal line. The RSI is below 50, indicating that the stock is oversold. The Fibonacci retracement levels show that the stock is currently trading at the 61.8% retracement level. The Bollinger Bands are showing that the stock is trading below the lower Bollinger Band. Overall, the technical analysis suggests that the stock is likely to continue to trend downwards in the short term. However, the RSI is showing that the stock is oversold, which could lead to a short-term bounce. The overall risk is medium, and the decision is HOLD.","movingAverages":2,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":4,"fibonacciRetracement":2,"bollingerBands":1,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The stock has been in an uptrend over the past few weeks, but has recently seen a pullback. The moving averages are bullish, with the 50-day moving average above the 200-day moving average. The MACD is also bullish, with the MACD line above the signal line and both lines above the zero line. The RSI is in overbought territory, but is still trending higher. The stock is currently testing support at the 50-day moving average. If the stock can hold above this level, it could continue its uptrend. However, if the stock breaks below this level, it could see further losses. Overall, the technical analysis is bullish, but there is some risk to the downside. The overall risk is medium and the stock is a HOLD.","movingAverages":7,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":6,"fibonacciRetracement":0,"bollingerBands":5,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall summary of the stock is mixed. The moving averages are showing a slight downward trend, the MACD is showing a slight upward trend, the relative strength index is showing a neutral trend, the fibonacci retracement is showing a slight upward trend, and the bollinger bands are showing a neutral trend. Overall, the stock is in a neutral trend with a low risk level and a low overall risk. The decision is to HOLD.","movingAverages":5.5,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":5.5,"fibonacciRetracement":6,"bollingerBands":5.5,"overallTrend":"neutral","riskLevel":1,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":3,"bollingerBands":4,"overallTrend":["downward","upward","neutral"],"riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}