{"results":[{"summary":"The current trend of the stock is upward with 10 indicator values suggesting a strong upward trend and 14 indicators suggesting a downward trend. The overall risk is medium with a value of 3 out of 5. The stock is showing a strong uptrend, with a high potential for continued growth. The moving averages show that the 10-day, 20-day, 50-day, 100-day, and 200-day are all trending upwards, indicating a bullish trend. The MACD is also trending upwards, indicating that the stock is gaining momentum. The RSI is also above 50, which indicates that the stock is overbought. However, the Fibonacci retracement levels show that the stock has some support at the 61.8% level. Overall, the technical analysis suggests that the stock is in a strong uptrend and is likely to continue to rise in the near term. However, investors should be aware that the stock is overbought and could be due for a correction in the short term.","movingAverages":6,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":6,"fibonacciRetracement":4,"bollingerBands":8,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of this stock is neutral. The moving averages are showing a slightly upward trend, with the short-term moving average being above the long-term moving average. The MACD indicator is showing a bullish divergence, with the MACD line crossing above the signal line. The RSI indicator is showing a neutral reading, with the RSI line being in the middle of the range. The fibonacci retracement indicator is showing a support level at 399.6 and a resistance level at 403.2. The bollinger bands indicator is showing that the stock is currently trading near the upper bollinger band, indicating that the stock is overbought. Overall, the technical analysis is showing a slightly bullish trend for this stock, with the potential for further upside movement. However, it is important to note that the overall risk of this stock is moderate, with the volatility of the stock being relatively high. Therefore, it is important to consider the risk tolerance of the investor before making any investment decision.","movingAverages":7,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":7,"bollingerBands":6,"overallTrend":"neutral","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The technical analysis of CC.D.C.USS.IP stock shows that the Moving Average analysis is bearish, indicating a downward trend. The MACD analysis is also bearish, indicating a downward trend. The Relative Strength Index RSI is neutral with a value of 50, indicating that the stock is neither overbought nor oversold. The Fibonacci Retracement analysis is bullish, indicating a possible upward trend. The Bollinger Bands analysis is neutral, indicating that the stock is not overbought or oversold. Overall, the technical analysis is a mix of bearish and bullish signals, with a slight bearish bias. The overall risk level is 3 out of 5, indicating a medium risk level. The overall risk is medium and the decision is HOLD.","movingAverages":3,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":5,"fibonacciRetracement":7,"bollingerBands":5,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The Moving Averages show a slight upward trend, indicating that the stock price may be poised to rise. The MACD is also showing an upward trend, indicating that the stock is gaining momentum. The Fibonacci Retracement indicates the stock has reached a potential support level around 399, which could offer some stability. Bollinger Bands show that the stock price is currently trading near the upper Bollinger Band, indicating that it is overbought and could be due for a pullback. The RSI is showing a value of 60, indicating that the stock is overbought. Overall, the technical analysis suggests that the stock is currently overbought and could be due for a pullback. If the stock price falls through the support level at 399, it could signal a further decline. However, if the stock price can hold above this level, it could continue to rise.","movingAverages":7,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":0,"fibonacciRetracement":7,"bollingerBands":2,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is sideways oscillating between 403 and 402. The price is currently sitting around the mid range of this trading pattern. \n\nThe Moving Averages are giving a mixed view of the stock's price movement. The short-term moving averages are above the long-term moving averages, which indicates that the stock is in a short-term uptrend. However, the long-term moving averages are below the price, which indicates that the stock is in a long-term downtrend. \n\nThe MACD is giving a sell signal. The MACD line has crossed below the signal line, which indicates that the stock's momentum is turning negative. \n\nThe RSI is giving a neutral signal. The RSI is currently around 50, which indicates that the stock is not overbought or oversold. \n\nThe Fibonacci Retracement is giving a neutral signal. The stock is currently trading at the 50% Fibonacci retracement level, which indicates that the stock has retraced half of its previous decline. \n\nThe Bollinger Bands are giving a neutral signal. The stock is currently trading within the Bollinger Bands, which indicates that the stock is not overbought or oversold. \n\nOverall, the technical analysis gives a mixed view of the stock's price movement. The short-term indicators are giving a bullish signal, while the long-term indicators are giving a bearish signal. The stock is currently trading at a critical support level, and a break below this level could lead to further declines. However, a break above the previous high could lead to a continuation of the uptrend.","movingAverages":8,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":6,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":4,"fibonacciRetracement":6,"bollingerBands":5,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}