{"results":[{"summary":"The stock price has been on a downward trend. The current price of 396.5 is below the opening price of 401.4 from 15 days ago. The stock has been trading within a range of 399.5 to 403.2 over the past 15 days. The moving averages show a downward trend, with the 5-day moving average below the 10-day moving average, which is below the 20-day moving average. The MACD indicator is also showing a downward trend, with the MACD line below the signal line. The RSI indicator is showing a neutral reading, with a value of 51. The Fibonacci retracement levels show that the stock is currently trading at the 61.8% retracement level. The Bollinger Bands show that the stock is trading below the lower Bollinger Band, which indicates that the stock is oversold. Overall, the technical analysis indicates that the stock is in a downward trend and is likely to continue to decline in the short term. There is the possibility of a strong SELL signal, however, more confirmation is needed before making a decision.","movingAverages":1,"movingAveragesConvergenceDivergence":1,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":1,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"STRONG SELL","epic":"CC.D.C.USS.IP"},{"summary":"The stock's price has a falling trend over the analysed period. The Moving Averages method shows a score of 1 out of 10 which also indicates a downward trend. Even if the initial days in the analysed period recorded a bull market, the Moving Averages Convergence Divergence is showing a 7 out of 10 which is leaning towards a bear market. The Relative Strength Index method has a score of 2 out of 10 which is a warning signal of the stock being overbought. The Fibonacci Retracement method gives the stock a score of 6 out of 10. The Bollinger Bands method is showing a score of 7 out of 10. Overall the stock price is in a downward trend. The risk level is rated as a 3 out of 5; therefore the risk is medium. The overall risk is high. The decision is to SELL.","movingAverages":1,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":2,"fibonacciRetracement":6,"bollingerBands":7,"overallTrend":"downward","riskLevel":3,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The overall sentiment is bullish. The moving averages are showing a strong indication of the stock price going up, with a score of 10 out of 10. The MACD is also showing a strong indication of the stock price going up, with a score of 9 out of 10. The RSI is showing a neutral indication of the stock price, with a score of 5 out of 10. The fibonacci is showing a weak indication of the stock price going down, with a score of 3 out of 10. The bollinger bands are showing a strong indication of the stock price going up, with a score of 9 out of 10. The overall trend is upward, with a risk level of 2 out of 5, and an overall risk of low. The decision is to BUY.","movingAverages":10,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":5,"fibonacciRetracement":3,"bollingerBands":9,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The overall sentiment is bullish with the price of stock increasing over the 3 day period. The moving averages have a bullish sentiment, indicating that the stock price is likely to continue increasing. The MACD has a bullish sentiment, indicating that the stock price is likely to continue increasing. The RSI is in a neutral zone indicating that the stock price could go either way. The fibonacci retracement indicates that the stock price is currently in the 0.236-0.382 retracement zone, which is a bullish sign. The Bollinger Bands are currently indicating that the stock price is overbought, which could lead to a correction in the short term. Overall, the technical analysis indicates that the stock is in a bullish trend with a high risk level. The overall risk is medium. The decision is STRONG BUY.","movingAverages":9,"movingAveragesConvergenceDivergence":10,"relativeStrengthIndex":5,"fibonacciRetracement":8,"bollingerBands":5,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":4,"fibonacciRetracement":6,"bollingerBands":6,"overallTrend":["downward","downward","upward","upward"],"riskLevel":3,"overallRisk":"high","decision":["STRONG SELL","SELL","BUY","STRONG BUY"],"epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}