{"results":[{"summary":"The technical analysis on CC.D.C.USS.IP gives it a score of 4 out of 10 for moving averages. This means that the moving averages indicate a neutral trend. The MACD (Moving Average Convergence Divergence) gives it a score of 5 out of 10, indicating a neutral trend. The RSI (Relative Strength Index) give it a score of 5 out of 10, indicating a neutral trend. The Fibonacci retracement gives it a score of 4 out of 10, indicating a neutral trend. The Bollinger Bands gives it a score of 6 out of 10, indicating a neutral trend. Overall, the technical analysis indicates a neutral or ranging trend for CC.D.C.USS.IP. The risk level is moderate, at 3 out of 5. The overall risk is medium. The decision is to HOLD.","movingAverages":4,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":4,"bollingerBands":6,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The technical analysis of CC.D.C.USS.IP provides mixed signals. The moving averages, MACD and Bollinger Bands are giving a bullish signal, while the Fibonacci Retracement and RSI are giving a bearish signal. The overall trend of the stock is neutral. The risk level is 3 out of 5, and the overall risk is medium. A STRONG SELL decision is recommended.","movingAverages":7,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":4,"fibonacciRetracement":3,"bollingerBands":8,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"STRONG SELL","epic":"CC.D.C.USS.IP"},{"summary":"This technical analysis gives mixed signals on the stock price movement. The Moving Averages indicate a moderate bullish signal, the MACD is slightly bearish, the RSI is in oversold territory signaling an imminent bullish reversal, the Fibonacci Retracement levels do not provide a clear indication, while the Bollinger Bands are slightly bearish. The overall trend is neutral, with a moderate risk level, resulting in an overall medium risk. The decision is HOLD.","movingAverages":7,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":1,"fibonacciRetracement":5,"bollingerBands":2,"overallTrend":"neutral","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":6,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":3,"fibonacciRetracement":4,"bollingerBands":5,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}