{"results":[{"summary":"The stock has been on a downward trend since the opening price on 2024/07/11. The moving averages, MACD, and RSI all indicate a downward trend. The Fibonacci retracement levels show that the stock price is currently trading below the 61.8% retracement level, which is a bearish sign. The Bollinger Bands are also indicating a downward trend, as the stock price is trading below the lower Bollinger Band. Overall, the technical analysis indicates that the stock is likely to continue to trend downwards in the short term. The risk level is high and overallRisk is high, so the decision is HOLD.","movingAverages":1,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":5,"fibonacciRetracement":2,"bollingerBands":1,"overallTrend":"downward","riskLevel":5,"overallRisk":"high","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The data provided can be analysed using five technical analysis methods. \n\n1) Moving Averages: This analysis method assigns a score out of 10 to the overall health of the stock. A score of 10 indicates the stock price is likely to go up, while a score of 0 indicates the stock price is likely to go down. The Moving Averages score for this stock is 6 out of 10. \n\n2) Moving Average Convergence Divergence (MACD): This analysis method also assigns a score out of 10 to the overall health of the stock. The MACD score for this stock is 7 out of 10. \n\n3) Relative Strength Index (RSI): This analysis method assigns a score out of 10 to the overall health of the stock. The RSI score for this stock is 6 out of 10. \n\n4) Fibonacci Retracement: This analysis method assigns a score out of 10 to the overall health of the stock. The Fibonacci Retracement score for this stock is 5 out of 10. \n\n5) Bollinger Bands: This analysis method assigns a score out of 10 to the overall health of the stock. The Bollinger Bands score for this stock is 7 out of 10. \n\nThe overallTrend is neutral, the riskLevel is 0 and the overallRisk is low. The recommendation is to HOLD.","movingAverages":6,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":6,"fibonacciRetracement":5,"bollingerBands":7,"overallTrend":"neutral","riskLevel":0,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The Moving Averages analysis indicates a slightly downward trend, with a score of 6 out of 10. This suggests that the stock price may continue to decline in the near term. The MACD analysis also points to a downward trend, with a score of 5 out of 10. This further supports the view that the stock price may continue to fall. The RSI analysis indicates that the stock is neither overbought nor oversold, with a score of 5 out of 10. This suggests that there is still some room for the stock price to decline. The Fibonacci Retracement analysis indicates that the stock price is approaching a key support level, with a score of 8 out of 10. This suggests that the stock price may find support at this level and bounce back. The Bollinger Bands analysis indicates that the stock price is trading within the upper Bollinger Band, with a score of 4 out of 10. This suggests that the stock price may be overbought and could be due for a correction. Overall, the technical analysis suggests that the stock price is likely to continue to decline in the near term. However, there is some support at the current level, and the stock price could bounce back if it finds support at this level. The overall risk level is 3 out of 5, indicating a medium risk level. The overallRisk is medium.","movingAverages":6,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":8,"bollingerBands":4,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"Based on the Moving Averages, the historical data suggests that the price of the stock is more likely to trend in a negative direction over the short to medium term and possibly the long term. The MACD indicates that the stock may be currently undervalued. The RSI suggests that the stock is neither overbought not over sold but is just below the 50 neutral mark. The Fibonacci Retracement indicates that the current price may have some upside potential before correcting against the downtrend. The Bollinger Bands indicate that the price may have some short term downside risk before mean reverting to an upward trend. Overall, the stock has a medium risk profile with a high likelihood of the price falling. The recommended decision is to SELL this stock.","movingAverages":2,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":4,"fibonacciRetracement":6,"bollingerBands":7,"overallTrend":"downward","riskLevel":3,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":4,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"downward","riskLevel":3,"overallRisk":"high","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}