{"results":[{"summary":"The overall trend of the stock is slightly upward, but there was a significant drop in price on 2024/07/18 14:00:00. \n\nThe moving averages indicate a slightly upward trend, with the stock price currently above the 10-day and 50-day moving averages. The MACD is also positive, indicating that the stock is in a bullish trend. \n\nThe RSI is currently in the overbought territory, which suggests that the stock may be due for a correction. \n\nThe Fibonacci retracement levels show that the stock is currently trading near the 38.2% retracement level, which is a potential support level. \n\nThe Bollinger Bands are currently wide, which indicates that the stock is volatile. \n\nOverall, the technical analysis is mixed, with some indicators suggesting an upward trend and others suggesting a potential correction. Investors should be cautious and consider all of the available information before making any investment decisions.","movingAverages":7,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":8,"fibonacciRetracement":7,"bollingerBands":5,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The Moving Averages analysis method suggests a bullish trend with a score of 8 out of 10. The Moving Average Convergence Divergence analysis method also suggests a bullish trend with a score of 7 out of 10. The Relative Strength Index analysis method indicates a neutral trend with a score of 5 out of 10. The Fibonacci Retracement analysis method suggests a bullish trend with a score of 7 out of 10. The Bollinger Bands analysis method indicates a bullish trend with a score of 6 out of 10. Overall, the technical analysis suggests a bullish trend with an overall risk level of 2 out of 5, indicating a medium risk. Therefore, the overall risk is medium and the decision is STRONG BUY.","movingAverages":8,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":5,"fibonacciRetracement":7,"bollingerBands":6,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"},{"summary":"This stock has been in a downward trend for the last 5 days. The moving averages are indicating a sell signal, with the MACD also indicating a sell signal. The relative strength index is oversold, which could indicate a potential reversal in the near future. The fibonacci retracement levels are showing that the stock is currently trading below the 38.2% retracement level, which could indicate further downside potential. The bollinger bands are indicating that the stock is currently trading below the lower bollinger band, which could also indicate further downside potential. Overall, the technical analysis indicates that the stock is likely to continue to trend downwards in the short term. The risk level is 3 out of 5, with the overall risk being medium.","movingAverages":3,"movingAveragesConvergenceDivergence":1,"relativeStrengthIndex":9,"fibonacciRetracement":1,"bollingerBands":1,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is neutral, the price has been fluctuating within a narrow range for the past couple of days. The moving averages are neutral, with the 50-day moving average slightly above the 200-day moving average. The MACD is also neutral, with the MACD line and signal line both below the zero line. The RSI is slightly above the 50 level, indicating that the stock is neither overbought nor oversold. The Fibonacci retracement levels show that the stock is currently trading near the 61.8% retracement level. Bollinger Bands are slightly squeezed, indicating that volatility is low. The overall risk is considered low, with a risk level of 1 out of 5. The overallRisk is assessed as \"low\". The decision is to HOLD.","movingAverages":6,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":6,"fibonacciRetracement":5,"bollingerBands":7,"overallTrend":"neutral","riskLevel":1,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":6,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":7,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}