{"results":[{"summary":"The technical analysis of CC.D.C.USS.IP stock using five different methods indicates a neutral overall trend and a medium risk. The Moving Averages analysis gives a score of 5 out of 10, indicating that the stock price is expected to remain within the current range. The MACD analysis gives a score of 6 out of 10, indicating that the stock price is expected to continue its upward trend. The RSI analysis gives a score of 5 out of 10, indicating that the stock price is neither overbought nor oversold. The Fibonacci Retracement analysis gives a score of 5 out of 10, indicating that the stock price is expected to retrace to the 50% Fibonacci level. The Bollinger Bands analysis gives a score of 4 out of 10, indicating that the stock price is expected to remain within the current Bollinger Bands range. Overall, the stock is considered to be a medium risk investment with a neutral trend.","movingAverages":5,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":4,"overallTrend":"neutral","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend for stock CC.D.C.USS.IP is neutral. The moving averages are slightly bullish, with a score of 6 out of 10, suggesting that the stock price is likely to continue its current trend. The MACD is also slightly bullish, with a score of 6 out of 10, indicating that the upward momentum is increasing. The RSI is also neutral, with a score of 5 out of 10, suggesting that the stock is not overbought or oversold. The Fibonacci retracement is neutral, with a score of 5 out of 10, indicating that the stock price is likely to retrace to the 50% level. The Bollinger Bands are neutral, with a score of 5 out of 10, indicating that the stock price is likely to stay within the current range. Overall, the technical analysis suggests that the stock is likely to continue its current trend. However, the overall risk level is 3 out of 5, indicating that there is some risk involved in investing in this stock. The overall risk is medium.","movingAverages":6,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"**Moving Averages:** The stock price has been moving sideways for the past few days, with a slight downward bias. The 50-day moving average is currently at 397.00, and the 200-day moving average is at 395.00. The stock price is currently trading below both of these moving averages, which is a bearish sign.\n\n**MACD (Moving Average Convergence Divergence):** The MACD is currently below zero, which is a bearish sign. The MACD line is also below the signal line, which is another bearish sign. The MACD histogram is also negative, which is a bearish sign. \n\n**Relative Strength Index (RSI):** The RSI is currently at 30.00, which is in the oversold range. This is a bullish sign, as it indicates that the stock price may be due for a rebound. \n\n**Fibonacci Retracement:** The stock price is currently trading at the 38.2% Fibonacci retracement level. This is a bullish sign, as it indicates that the stock price may be due for a rebound. \n\n**Bollinger Bands:** The stock price is currently trading below the lower Bollinger Band. This is a bearish sign, as it indicates that the stock price may be due for a further decline. \n\n**Overall:** The overall trend for this stock is downward. The stock price is trading below its moving averages, the MACD is below zero, the RSI is in the oversold range, and the Bollinger Bands are bearish. This suggests that the stock price may be due for a further decline. However, the Fibonacci Retracement indicator is bullish, which suggests that the stock price may be due for a rebound.","movingAverages":0,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":10,"fibonacciRetracement":8,"bollingerBands":0,"overallTrend":"downward","riskLevel":5,"overallRisk":"high","decision":"STRONG SELL","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is considered to be neutral, with a slight downward bias. The moving averages are indicating a slight bearish trend, with the MACD also indicating a bearish trend. The RSI is indicating that the stock is slightly overbought. The Fibonacci retracement levels show that the stock is currently trading near the 61.8% retracement level, which is a potential support level. The Bollinger Bands are indicating that the stock is trading within a narrow range and may be due for a breakout. Overall, the risk level is considered to be medium and the overall risk is considered to be moderate. A STRONG SELL decision is suggested.","movingAverages":5,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":6,"fibonacciRetracement":6,"bollingerBands":7,"overallTrend":"neutral","riskLevel":3,"overallRisk":"moderate","decision":"STRONG SELL","epic":"CC.D.C.USS.IP"},{"summary":"The technical analysis of this stock indicates a **strong downward trend**. The Moving Averages, MACD, Fibonacci Retracement, and Bollinger Bands all suggest that the stock is likely to continue to decline in value. The Relative Strength Index is the only indicator that suggests that the stock may be slightly overbought, but this is not enough to offset the negative signals from the other indicators. Overall, the risk of investing in this stock is **high** and the overall risk is **high**. A **STRONG SELL** decision is advised.","movingAverages":6,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":7,"fibonacciRetracement":2,"bollingerBands":4,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"STRONG SELL","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":4,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":7,"fibonacciRetracement":5,"bollingerBands":4,"overallTrend":"neutral","riskLevel":3,"overallRisk":["medium","medium","high","moderate","high"],"decision":"STRONG SELL","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}