{"results":[{"summary":"The stock price has been on a downward trend since the provided data set started, with a slight recovery in the last few days. The moving averages are showing a downward trend, with the short-term average below the long-term. The MACD is also showing a downward trend, with the MACD line below the signal line. The relative strength index is showing a neutral reading, indicating that the stock is not overbought or oversold. The Fibonacci retracement levels show that the stock is currently trading below the 38.2% retracement level. The Bollinger Bands show that the stock is currently trading below the lower Bollinger Band, indicating that it is oversold. Overall, the technical analysis indicates that the stock is currently in a downward trend and is likely to continue to decline in the short term.","movingAverages":3,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":2,"bollingerBands":0,"overallTrend":"downward","riskLevel":5,"overallRisk":"high","decision":"STRONG SELL","epic":"CC.D.C.USS.IP"},{"summary":"The moving averages are indicating a moderate upward trend, with the stock price staying above the moving averages for most of the period analysed. The MACD is bullish, with the MACD line above the signal line and the histogram positive. The RSI is neutral, fluctuating around the 50 level. The Fibonacci retracement levels show that the stock price is currently trading at the 61.8% retracement level, which is a potential support level. The Bollinger Bands are wide, indicating high volatility. Overall, the technical analysis suggests that the stock is in a neutral to slightly bullish trend, but with high volatility and potential for a pullback to the 61.8% Fibonacci retracement level. In this situation the risk is considered medium, with potential for a high reward if the bullish trend continues.","movingAverages":6,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":5,"fibonacciRetracement":7,"bollingerBands":8,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall market sentiment is currently neutral. The moving averages are showing a bearish trend, as the 50-day moving average is below the 200-day moving average. The MACD indicator is also showing a bearish trend, as the MACD line is below the signal line. The relative strength index (RSI) is currently at 38.67, which indicates that the stock is in a neutral zone. The Fibonacci retracement levels show that the stock is currently trading at the 61.8% retracement level, which is a potential support level. The Bollinger Bands are showing that the stock is currently trading within the Bollinger Bands, which indicates that the stock is not overbought or oversold. Overall, the technical analysis is indicating that the stock is currently in a neutral trend, but there is a potential for a bearish trend to develop in the future.","movingAverages":2,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":6,"fibonacciRetracement":6,"bollingerBands":6,"overallTrend":"upward","riskLevel":0,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The technical indicators are mostly neutral with a slight downward bias. The moving averages suggest a weak downward trend, while the MACD and RSI indicators suggest a neutral to slightly bullish trend. The Fibonacci retracement indicates a potential support level at 398.2 and a resistance level at 402.2. The Bollinger Bands indicate that the price is currently trading within the neutral range. Overall, the technical indicators suggest that the stock is currently in a neutral zone, with a slight downward bias. The risk level is moderate, and the overall risk is low to medium. Based on these indicators, a HOLD decision is recommended.","movingAverages":6,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":6,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"neutral","riskLevel":3,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is neutral for the period analyzed. The Moving Averages indicator suggests a bullish trend with a score of 8 out of 10, indicating that the stock price is likely to continue rising. The MACD indicator also suggests a bullish trend with a score of 9 out of 10, indicating that the stock price is likely to continue rising. The Relative Strength Index indicator suggests a neutral trend with a score of 5 out of 10, indicating that the stock price is neither overbought nor oversold. The Fibonacci Retracement indicator suggests a bullish trend with a score of 6 out of 10, indicating that the stock price is likely to continue rising. The Bollinger Bands indicator suggests a neutral trend with a score of 5 out of 10, indicating that the stock price is neither overbought nor oversold. The overall risk level is 2 out of 5, indicating a moderate level of risk. The overall risk is medium. The recommended decision is to HOLD the stock.","movingAverages":8,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":5,"overallTrend":"neutral","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":["downward","upward","upward","neutral","neutral"],"riskLevel":3,"overallRisk":["high","medium","low","low","medium"],"decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}