{"results":[{"summary":"The overall trend of the stock is upward. The MACD is above the signal line, and the RSI is above 50. The stock has been trading above its 200-day moving average for the past few days. The Bollinger Bands are widening, which indicates that volatility is increasing. The overall risk level is medium, and the overall risk is moderate. We recommend a BUY or STRONG BUY for this stock.","movingAverages":8,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":7,"fibonacciRetracement":0,"bollingerBands":9,"overallTrend":"upward","riskLevel":3,"overallRisk":"moderate","decision":"BUY"},{"summary":"The stock price has been fluctuating over the past few days. It is currently trading at 396.5, which is down from its opening price of 398.9. The moving averages are showing a downward trend, with the 50-day moving average currently at 398.6 and the 200-day moving average currently at 401.6. The MACD is also showing a downward trend, with the MACD line below the signal line. The RSI is currently at 38, which is in the oversold territory. The Fibonacci retracement levels show that the stock is currently trading at the 61.8% retracement level. The Bollinger Bands are showing that the stock is currently trading below the lower Bollinger Band. Overall, the technical analysis is indicating that the stock is in a bearish trend. The risk level is medium and the overall risk is high. A SELL decision is recommended.","movingAverages":5,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":2,"fibonacciRetracement":10,"bollingerBands":6,"overallTrend":"downward","riskLevel":3,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The general trend for CC.D.C.USS.IP over the past 2 months has been steady. The stock has been trading in a range between $395 and $410. However, in the past 5 days, the stock has declined and is currently trading at $398.8, which is below its 2-month average. \n\nThe moving averages indicate a neutral trend. The 50-day moving average is currently at $400.0, and the 200-day moving average is at $398.0. The stock is currently trading below both of these moving averages, which suggests that the stock is in a downtrend. \n\nThe MACD indicator is also indicating a neutral trend. The MACD line is currently below the signal line, which suggests that the stock is in a downtrend. However, the MACD histogram is positive, which suggests that the stock is oversold and could be due for a rebound. \n\nThe RSI indicator is currently at 30.0, which is in the oversold range. This suggests that the stock is oversold and could be due for a rebound. \n\nThe Fibonacci retracement levels show that the stock is currently trading at the 38.2% retracement level. This suggests that the stock could be due for a rebound if it can break through this level. \n\nThe Bollinger Bands show that the stock is currently trading below the lower Bollinger Band. This suggests that the stock is oversold and could be due for a rebound. \n\nOverall, the technical analysis indicates that CC.D.C.USS.IP is currently in a downtrend. However, the stock is oversold and could be due for a rebound. Investors should be cautious and consider waiting to buy the stock until it can break through the 38.2% Fibonacci retracement level.","movingAverages":5,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":4,"fibonacciRetracement":4,"bollingerBands":4,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"Overall, the analysis suggests that the stock's price trend is neutral, with a medium level of risk. The moving averages indicate a slight downward trend, while the MACD and RSI indicators suggest a possible reversal to the upside. Fibonacci retracement and Bollinger bands are neutral. Hence, the decision is to HOLD the stock and monitor further price action.","movingAverages":7,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":7,"fibonacciRetracement":5,"bollingerBands":6,"overallTrend":"neutral","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall sentiment of the stock is slightly bullish. Over the course of the past month, the stock has had a high of 405.1 and a low of 395.2, which gives it a trading range of 9.9. The security has traded below its 50-day moving average for 5 consecutive sessions which is typically an indicator for a downtrend. The MACD is currently trending with a bearish divergence, with the MACD line below the signal line and the histogram bars decreasing in size. The RSI is at 51 which means the security is at the border of being overbought. The Bollinger Bands are currently neutral. the current price is above the lower Bollinger Band and below the upper Bollinger Band. Overall, the technical indicators are giving mixed signals.  Given the bearish MACD divergence, and the fact that the stock is trading near the top of its range, a bearish outlook seems the most likely. This stock is not recommended to buy.","movingAverages":0,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":0,"fibonacciRetracement":0,"bollingerBands":0,"overallTrend":"neutral","riskLevel":0,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":4,"fibonacciRetracement":4,"bollingerBands":5,"overallTrend":["upward","downward","downward","neutral","neutral"],"riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}