{"results":[{"summary":"Based on the five technical analysis methods applied, the overall trend for the stock is slightly upward. The moving averages analysis indicates a neutral trend, with the MACD analysis suggesting a slight upward trend. The RSI analysis shows a strong buy signal, with the fibonacci retracement and bollinger bands analysis indicating a neutral trend. Overall, the analysis suggests that the stock has potential for short-term growth with a low to medium risk level.","movingAverages":5,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":8,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"BUY"},{"summary":"This stock has a moderate risk level of 3 out of 5. Looking at the past 30 days of price action the relative strength index (RSI) is currently at 55.64. A neutral RSI value of 50 would indicate that the security is not overbought or oversold. With the current RSI value at 55.64, this indicates that the asset is slightly overbought. The moving average is currently sitting at 7.8 which is neutral. The 30-day MACD is 0.03, also indicating a neutral trend. Based on the Fibonacci Retracement levels, the asset is currently sitting at the 38.2% Fibonacci retracement level of 397.59 which is a potential support level. The Bollinger Bands, which measure the volatility of a security, indicate that the stock is currently trading within the bands. Based on the summary of the technical analysis, there is an upwards overall trend. The stock is currently trading at the 38.2% Fibonacci retracement level and although it is slightly overbought, it is still within the Bollinger Bands indicating a moderate volatility. This is also supported by the neutral RSI, moving average and MACD, and the overall upwards trend. With this in mind, a decision of HOLD would be appropriate.","movingAverages":7.8,"movingAveragesConvergenceDivergence":0.03,"relativeStrengthIndex":55.64,"fibonacciRetracement":38.2,"bollingerBands":0,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The stock's price shows a downtrend, with an average drop of 1.14% per day, which is a significant change. The MACD shows a bearish trend, with the MACD line below the signal line for most of the period. The RSI is below 50, indicating that the stock is oversold. The Fibonacci Retracement shows that the stock is currently trading near the 61.8% retracement level, which is a potential support level. The Bollinger Bands show that the stock is trading below the lower Bollinger Band, indicating a potential oversold condition. Overall, the technical analysis suggests that the stock is in a downtrend and could experience further declines in the near future. A risk rating of 3 out of 5 is assigned which is considered a medium risk. The overall risk is classified as \"medium\". Given the technical indicators and analysis, the recommendation is to SELL the stock.","movingAverages":7,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":1,"fibonacciRetracement":8,"bollingerBands":3,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is upward, with the price steadily increasing over the period of data. The moving averages indicate a positive trend, with the 50-day moving average above the 200-day moving average. The MACD indicator is also positive, with the MACD line above the signal line, indicating that the stock is in a bullish trend. The RSI indicator is also in bullish territory, with a value above 50, indicating that the stock is not overbought. The Fibonacci retracement levels show that the stock is currently trading near the 61.8% retracement level, which is a potential support level. The Bollinger Bands are also indicating that the stock is in a bullish trend, with the price trading above the upper Bollinger Band. Overall, the technical analysis indicates that the stock is in a bullish trend and is likely to continue to rise in value in the near future. The risk level is 2 out of 5, indicating that the stock has a moderate level of risk. The overall risk is low, indicating that the stock is not considered to be a high-risk investment. The decision is to BUY the stock.","movingAverages":8,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":7,"fibonacciRetracement":7,"bollingerBands":8,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The technical analysis on CC.D.C.USS.IP indicates a downward trend. The moving averages are mostly below the current price, however there has been some positive movement on the 14-day and 50-day moving averages. The MACD is below the signal line, indicating a bearish trend, but the histogram is starting to trend upwards. The RSI is oversold, indicating that the stock is undervalued. The fibonacci retracement levels show that the stock is currently trading at the 61.8% retracement level. The Bollinger Bands are slightly below the current price, indicating that the stock is trading within a narrow range.\n\nOverall, the technical analysis indicates a downward trend, but there are some positive signs that suggest that the trend may be reversing. The risk level is considered medium, and the overall risk is considered low.","movingAverages":7,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":3,"fibonacciRetracement":3,"bollingerBands":7,"overallTrend":"downward","riskLevel":3,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":7,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":15,"fibonacciRetracement":12,"bollingerBands":5,"overallTrend":"upward","riskLevel":3,"overallRisk":"low","decision":["BUY","HOLD","SELL","BUY","HOLD"],"epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}