{"results":[{"summary":"The stock price initially went up from $405.6 to $411.5, which is a 1.4% increase. However, it then declined to $402, which is a 2.3% drop from its initial price. \n\nThe Moving Averages show that the stock price has been trending upwards in the last 20 days and is currently trading above the moving average.  The MACD indicator shows a bullish trend, as the MACD line has crossed above the signal line and the histogram is positive. The RSI indicator is at 52, which is considered to be in the neutral zone. The Fibonacci Retracement indicates that the stock is currently trading at the 61.8% retracement level, which is a potential support level. The Bollinger Bands show that the stock is trading within the upper Bollinger Band, which indicates that it is overbought and may be due for a correction.\n\nOverall, the technical analysis is mixed, with some indicators suggesting a bullish trend and others suggesting a potential correction. However, the overall trend is still up, so a buy decision could be considered. \n\nNot an investing advice.","movingAverages":7,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":6,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The stock price has been on an overall downward trend for the last few days. The moving averages are indicating a strong sell signal, with the MACD also indicating a sell signal. The RSI is indicating a neutral signal. The Fibonacci retracement is indicating a strong sell signal. The Bollinger Bands are indicating a neutral signal. Overall, the technical analysis is indicating a strong sell signal for this stock. The risk level is high, and the overall risk is assessed as \"high\".","movingAverages":0,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":0,"fibonacciRetracement":0,"bollingerBands":0,"overallTrend":"neutral","riskLevel":2,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is slightly downward. The moving averages are showing a slight downward trend. The MACD is showing a slight upward trend. The RSI is showing a neutral trend. The Fibonacci Retracement is showing a slight downward trend. The Bollinger Bands are showing a neutral trend. The overall risk level is medium and the overall risk is moderate. The decision is to HOLD.","movingAverages":5,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The stock has been trending downwards for the past while but is currently showing signs of a slight upward trend. The moving averages are indicating a slight upward trend, with the MACD also indicating a potential for a reversal. The RSI is currently in the neutral zone, but is trending upwards. The Fibonacci retracement levels suggest that the stock is currently trading at a support level. The Bollinger Bands are showing that the stock is currently trading within the bands, indicating that it is not overbought or oversold. Overall, the technical indicators are suggesting that the stock is currently in a neutral to slightly bullish position. The risk level is low, and the overall risk is low to medium. The decision is to HOLD.","movingAverages":6,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":6,"overallTrend":"neutral","riskLevel":0,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":4,"fibonacciRetracement":4,"bollingerBands":4,"overallTrend":"neutral","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}