{"results":[{"summary":"The recent market trend of CC.D.C.USS.IP, based on the provided data, can be difficult to determine. Currently, the price is on a downward trend, but due to the high risk level and high overall risk, it is recommended to hold onto the position. There are negative indications coming from the MACD and RSI analysis methods, and neutral indications from the Moving Averages and Bollinger Bands. The Fibonacci Retracement analysis method gives a positive indication. With half of the analysis methods giving negative signals and the other half giving neutral or positive signals, the overall trend is neutral. Therefore, HOLD is the recommended decision based on the current technical analysis of CC.D.C.USS.IP.","movingAverages":5,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":4,"fibonacciRetracement":7,"bollingerBands":4,"overallTrend":"neutral","riskLevel":0,"overallRisk":"high","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"Overall, the technical analysis gives a bullish picture of the stock, since 7 out of 10 indicators are showing a bullish signal. The short term indicators give a strong sell signal as the price is going down and the support is weak. The mid term indicators give a strong buy signal as the price is slowly going up and the support is strong. The long term indicators give a strong buy signal as the price is going up slowly and the support is strong. The risk and risk level are high, resulting in a recommendation to hold the stock.","movingAverages":7,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":6,"fibonacciRetracement":9,"bollingerBands":8,"overallTrend":"upward","riskLevel":3,"overallRisk":"high","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The  Moving Averages analysis indicator is moderately positive indicating that the stock price will likely go up over the long term and has a score of 7 out of 10. The MACD (Moving Average Convergence Divergence) analysis indicator is moderately positive indicating that the stock price has recently been performing strongly and has a score of 8 out of 10. The RSI (Relative Strength Index) analysis indicator is moderately positive indicating that the stock is neither overbought nor oversold and has a score of 7 out of 10. The Fibonacci Retracement analysis indicator is moderately positive indicating that the stock price is likely to move back up to the 38.2% retracement level and has a score of 7 out of 10. The Bollinger Bands analysis indicator is moderately positive indicating that the stock price is currently trading within a narrow range and has a score of 7 out of 10. Overall, the technical analysis of CC.D.C.USS.IP indicates a neutral trend with medium risk and a moderate overall risk. The decision is to HOLD.","movingAverages":7,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":7,"fibonacciRetracement":7,"bollingerBands":7,"overallTrend":"neutral","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The technical analysis of the financial data provided suggests that the overall trend is upwards. The moving average, MACD, RSI, and Bollinger Bands analysis all indicate a bullish trend. However, the Fibonacci Retracement analysis suggests a potential pullback. Overall, the risk level is moderate, and the decision is to HOLD.","movingAverages":8,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":9,"fibonacciRetracement":6,"bollingerBands":9,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend for this stock is upward. The moving averages are showing a score of 8 out of 10, indicating a strong buy signal. The MACD is showing a score of 7 out of 10, which is also a strong buy signal. The RSI is showing a score of 6 out of 10, which is a neutral signal. The Fibonacci Retracement is showing a score of 9 out of 10, which is a strong buy signal. The Bollinger Bands are showing a score of 5 out of 10, which is a neutral signal. The overall risk level is 2 out of 5, which is a medium risk. The overall risk is low. The decision is BUY.","movingAverages":8,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":6,"fibonacciRetracement":9,"bollingerBands":5,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":7,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":6,"fibonacciRetracement":8,"bollingerBands":7,"overallTrend":"upward","riskLevel":2,"overallRisk":["high","high","medium","medium","low"],"decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":true,"epic":"CC.D.C.USS.IP"}