{"results":[{"summary":"The overall trend for CC.D.C.USS.IP is upward. The Moving Averages analysis indicates a neutral trend.The MACD analysis indicates a bullish trend. The RSI analysis indicates a neutral trend. The fibonacci analysis indicates a neutral trend. The Bollinger Bands analysis indicates a neutral trend. Overall, the technical indicators suggest a neutral trend for CC.D.C.USS.IP with some bullish momentum. The risk of trading CC.D.C.USS.IP is medium, and the overall risk is low.","movingAverages":8,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":6,"fibonacciRetracement":5,"bollingerBands":4,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"Based on the analysis of various technical indicators, the stock has a mixed outlook. The Moving Averages indicate a downward trend, with the MACD also suggesting a downward momentum. The RSI, on the other hand, shows that the stock is oversold, indicating a potential reversal. The Fibonacci Retracement levels suggest a support level at 396.6 and a resistance level at 403.3. The Bollinger Bands show that the stock is trading below the lower Bollinger Band, indicating a possible oversold condition.\n\nOverall, the technical analysis suggests that the stock is in a downward trend, but there are some indications of a potential reversal. The risk level is medium, and the overall risk is low. A HOLD decision is recommended.","movingAverages":6,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":7,"fibonacciRetracement":7,"bollingerBands":7,"overallTrend":"downward","riskLevel":2,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The stock has been on a downward trend over the past few trading days. The MACD is below the signal line, and the stock is trading below its 50-day moving average. The RSI is also below 50, indicating that the stock is oversold. Overall, the technical analysis suggests that the stock is likely to continue to trend down in the near term. The overall risk level is high and the overallRisk is \"high\".","movingAverages":6,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":3,"fibonacciRetracement":6,"bollingerBands":5,"overallTrend":"downward","riskLevel":5,"overallRisk":"high","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The current trend for the stock is upward with a score of 6 out of 10. The moving averages are indicating a downward trend, with a score of 1 out of 10. The MACD is indicating a downward trend, with a score of 4 out of 10. The RSI is indicating a neutral trend, with a score of 5 out of 10. The fibonacci retracement is indicating an upward trend, with a score of 9 out of 10. The Bollinger Bands are indicating a neutral trend, with a score of 6 out of 10. The overall risk is low, with a score of 2 out of 5. The overall risk level is low. The recommendation is to HOLD this stock.","movingAverages":1,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":5,"fibonacciRetracement":9,"bollingerBands":6,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is upward. The Moving Averages show a score of 7 out of 10, indicating a slightly positive trend. The MACD also shows a positive trend with a score of 8 out of 10. The RSI is in the overbought territory with a score of 9 out of 10. The Fibonacci Retracement shows a score of 6 out of 10, indicating that the stock has some room to fall before reaching a major support level. The Bollinger Bands show a score of 7 out of 10, indicating that the stock is currently trading within a normal range. Overall, the technical analysis suggests that the stock is in a bullish trend with some room to fall before reaching a major support level. However, given the high RSI score, the stock may be overbought and could be due for a correction.","movingAverages":7,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":9,"fibonacciRetracement":6,"bollingerBands":7,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":6,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":6,"overallTrend":"upward","riskLevel":3,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}