{"results":[{"summary":"The overall trend for this stock is slightly upwards. The moving averages are giving a score of 6 out of 10, indicating a slight upward trend. The MACD is giving a score of 5 out of 10, also indicating a slight upward trend. The RSI is giving a score of 6 out of 10, indicating a neutral trend. The fibonacci retracement is giving a score of 7 out of 10, indicating a moderate upward trend. The Bollinger Bands are giving a score of 5 out of 10, indicating a neutral trend. The overall risk level is 2 out of 5, indicating a moderate level of risk. The overall risk is medium. The decision is to HOLD.","movingAverages":6,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":5,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The stock price has been trending downwards over the past few days, but there are some signs of a potential reversal. The moving averages are showing a mixed picture, with the short-term moving average indicating a downward trend and the long-term moving average indicating a sideways trend. The MACD is also showing a mixed picture, with the MACD line crossing above the signal line but the histogram remaining negative. The RSI is in oversold territory, which suggests that the stock is due for a bounce. The Fibonacci retracement levels show that the stock is currently trading near the 61.8% retracement level, which is a potential support level. The Bollinger Bands are showing that the stock is trading near the lower Bollinger Band, which is another potential support level. Overall, the technical analysis indicates that the stock is oversold and due for a bounce, but the trend is still downward. A break above the short-term moving average would be a bullish signal, while a break below the support level would be a bearish signal.","movingAverages":3,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":3,"overallTrend":"downward","riskLevel":2,"overallRisk":"low","decision":"BUY"},{"summary":"The overall trend for this stock is upwards, with a positive Moving Averages score of 7 and a MACD score of 8 out of 10. The RSI indicates a high level of buying activity, with a score of 8 out of 10. However, the Fibonacci Retracement and Bollinger Bands indicate that the stock is slightly overbought, with scores of 6 and 5 out of 10 respectively. Given the overall upward trend and positive momentum, a BUY or STRONG BUY decision is recommended. However, due to the slightly overbought conditions indicated by the Fibonacci Retracement and Bollinger Bands, a HOLD decision is recommended instead.","movingAverages":7,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":8,"fibonacciRetracement":6,"bollingerBands":5,"overallTrend":"upward","riskLevel":1,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The stock price has been in a slight uptrend for the past few days. The Moving Averages indicator shows that the stock is in a bullish trend, with the 50-day moving average above the 100-day moving average. The MACD indicator shows that the stock is in a bullish trend, with the MACD line above the signal line. The RSI indicator shows that the stock is in a neutral trend, with the RSI value between 50 and 70. The Fibonacci Retracement indicator shows that the stock is in a bullish trend, with the current price above the 38.2% retracement level. The Bollinger Bands indicator shows that the stock is in a neutral trend, with the current price between the upper and lower Bollinger Bands. Overall, the technical analysis indicates that the stock is in a slightly uptrend, with a higher probability of continuing to move upwards. However, the high risk level of 5 indicates that there is a high risk of the stock price decreasing in the near future.","movingAverages":7,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":7,"bollingerBands":5,"overallTrend":"upward","riskLevel":5,"overallRisk":"high","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is upwards. The moving averages are showing a positive trend. The MACD is also showing a positive trend. The RSI is showing that the stock is overbought. The Fibonacci retracement shows that the stock is in a retracement period. The Bollinger Bands are showing that the stock is in a consolidation period. The risk level is 0 out of 5 and therefore the overall risk is low. The decision is to BUY the stock.","movingAverages":7,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":8,"fibonacciRetracement":7,"bollingerBands":8,"overallTrend":"upward","riskLevel":0,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":6,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":7,"fibonacciRetracement":7,"bollingerBands":5,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":true,"epic":"CC.D.C.USS.IP"}