{"results":[{"summary":"Based on the 5 technical analysis methods used, the overall trend of the stock is slightly downwards. \n\nThe moving averages analysis indicates a neutral trend with a score of 7 out of 10. The MACD suggests a possible long-term bearish trend with a score of 6 out of 10. The RSI is showing a slight bearish trend with a score of 4 out of 10. The fibonacci retracement indicates a neutral trend with a score of 8 out of 10. The Bollinger Bands analysis suggests a volatile market with a neutral trend, giving a score of 6 out of 10. \n\nOverall, the stock is currently facing a high level of risk, with a riskLevel score of 4 out of 5 and an overallRisk of high. Therefore, the overall recommendation is SELL.","movingAverages":7,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":4,"fibonacciRetracement":8,"bollingerBands":6,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The recent price action of CC.D.C.USS.IP is negative. Over the last day, the price has dropped by 1.36%. Over the last five days, the price has dropped by 0.2%. Over the last month, the price has dropped by 1.53%. Over the last six months, the price has dropped by 11.93%. Technical analysis indicators are mostly bearish, with 6 indicators signalling a sell or strong sell, and 3 indicators signalling a buy or strong buy. The overall trend is downward. The risk level is 4 out of 5, with 0 being low risk and 5 being high risk. The overall risk is high. The decision is SELL.","movingAverages":3,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":4,"fibonacciRetracement":3,"bollingerBands":5,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend for the stock is slightly downwards. The Moving Averages indicator is giving a score of 4 out of 10 indicating that the stock price is more likely to go down. The MACD indicator is giving a score of 6 out of 10 indicating that the stock price is more likely to go up. The RSI indicator is giving a score of 4 out of 10 indicating that the stock is slightly overbought. The Fibonacci Retracement indicator is giving a score of 7 out of 10 indicating that the stock price is likely to retrace to the 61.8% level. The Bollinger Bands indicator is giving a score of 5 out of 10 indicating that the stock price is likely to stay within the Bollinger Bands. The overall risk level is 3 out of 5, indicating a medium risk. The overall risk is medium. The decision is HOLD.","movingAverages":4,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":4,"fibonacciRetracement":7,"bollingerBands":5,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The general trend of the stock is downward. The moving averages show a score of 2 out of 10, indicating a strong downward trend. The MACD (Moving Average Convergence Divergence) also has a score of 2 out of 10, indicating a strong downward trend. The RSI (Relative Strength Index) has a score of 3 out of 10, indicating a downward trend. The Fibonacci Retracement has a score of 5 out of 10, indicating a neutral trend. The Bollinger Bands have a score of 5 out of 10, indicating a neutral trend. The overall risk level is 3 out of 5, indicating a medium risk level. The overall risk is medium. The decision is to SELL.","movingAverages":2,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":3,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The stock has had a bearish trend over the past 26 days. The moving average suggests a neutral trend, while the MACD is bearish. The RSI is oversold, indicating a potential for a reversal. The Fibonacci Retracement suggests a potential support level at 404.4. The Bollinger Bands are suggesting a sell signal. Overall, the risk level is 3 out of 5 and the overall risk is medium. A SELL decision is recommended.","movingAverages":3,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":2,"fibonacciRetracement":7,"bollingerBands":1,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":4,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":3,"fibonacciRetracement":6,"bollingerBands":4,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}