{"results":[{"summary":"The stock price has been on a downward trend since the open. The moving averages are bearish, with the short-term moving average below the long-term moving average. The MACD is also bearish, with the MACD line below the signal line and the histogram bars below the zero line. The RSI is also bearish, with the RSI below the 50 level. The Fibonacci Retracement levels show that the stock price is currently trading below the 38.2% retracement level. The Bollinger Bands are also bearish, with the stock price trading below the lower Bollinger Band. Overall, the technical analysis indicates that the stock is in a bearish trend and is likely to continue to decline in the short term. However, it is important to note that technical analysis is not a perfect predictor of future price movements and should be used in conjunction with other forms of analysis.","movingAverages":3,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":2,"fibonacciRetracement":3,"bollingerBands":2,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"STRONG SELL","epic":"CC.D.C.USS.IP"},{"summary":"Based on the analysis of the 5 technical analysis methods, the overall trend of the stock is neutral. \n* Moving Averages: The stock has been trading below its moving averages for the past few days, which is a bearish sign. \n* MACD: The MACD line has crossed below the signal line, which is another bearish sign. \n* RSI: The RSI is below 50, which is a neutral sign. \n* Fibonacci Retracement: The stock is currently trading at the 61.8% Fibonacci retracement level, which is a support level. \n* Bollinger Bands: The stock is currently trading within the Bollinger Bands, which is a neutral sign. \n\nThe overall risk level is medium. The stock has been volatile recently, and there is a potential for further downside. The overall risk is medium, and investors should be cautious when investing in this stock. \nThe decision is HOLD. The stock is currently trading at a support level, and there is a potential for a bounce. However, the stock has been trading below its moving averages for the past few days, which is a bearish sign. Investors should wait for confirmation of a reversal before buying.","movingAverages":8,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":7,"bollingerBands":6,"overallTrend":"neutral","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The stock price of the company is experiencing fluctuation, with both increases and decreases seen throughout the trading period. The analysis methods provide a mixed view, with some indicating a possible upward trend while others suggest the risk of a downward trend. Overall, the situation calls for a cautious approach with close monitoring of market conditions.","movingAverages":5,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":7,"fibonacciRetracement":5,"bollingerBands":7,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The recent security price movement of stock CC.D.C.USS.IP has shown a substantial drop over the past two days. Previously, the share price volatility has been high, however, this has now shifted to a relatively stable movement. The RSI has recently shown that the stock has hit the oversold region and is currently attempting a recovery. The current price level is around the 397.20 mark and if the bulls can drive the stock price beyond 400.69, we may see a continuation of the bullish trend. However, a drop in price back below 395.13 could signal a further decline in the asset value. With a moving average of 397.77 and a moving average convergence divergence of 8.96, the overall trend is static. The risk level of this stock is 3 out of 5, making it a medium risk investment. The overall risk of this stock is medium, with a decision of HOLD.","movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":8,"fibonacciRetracement":7,"bollingerBands":8,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":6,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":6,"fibonacciRetracement":6,"bollingerBands":6,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}