{"results":[{"summary":"The moving averages indicate that the stock is in a downward trend. The MACD indicator is also indicating a downward trend, as the MACD line is below the signal line. The RSI is below 50, indicating that the stock is oversold. The Fibonacci Retracement indicates that the stock is in a correction phase. The Bollinger Bands indicate that the stock is in a volatile period. Overall, the technical analysis indicates that the stock is in a downward trend and is likely to continue to decline in the short term. The risk level is high, and the overall risk is medium. The decision is HOLD.","movingAverages":6,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":3,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"downward","riskLevel":4,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The Moving Averages indicator suggests a buy signal because the current price is above the 10 and 20 day moving averages. The MACD indicator is also bullish with the MACD line above the signal line and the histogram increasing. The RSI indicator is also bullish with a value above 60 indicating that the stock is overbought. The Fibonacci Retracement indicator shows that the current price is at the 61.8% retracement level, which could provide support for the stock price. The Bollinger Bands indicator shows that the current price is at the upper Bollinger Band, which suggests that the stock is overbought and could be due for a correction. Overall, the technical analysis suggests that the stock is in a bullish trend and could be a good buy at the current price. However, it is important to note that past performance is not indicative of future results and investors should always do their own research before making any investment decisions.","movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":6,"fibonacciRetracement":4,"bollingerBands":4,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The latest analysis based on the provided financial data for CC.D.C.USS.IP gives a neutral overallTrend and a low overallRisk with a medium riskLevel of 3. The MACD (Moving Average Convergence Divergence) and RSI (Relative Strength Index) give bullish signals scoring 8 out of 10 and 9 out of 10 respectively. The Bollinger Bands indicator also suggests a neutral market movement with a score of 5 out of 10. However, the Moving Averages and Fibonacci Retracement indicators show a bearish movement, scoring 1 out of 10 and 4 out of 10 respectively. Based on these combined technical analysis scores, the system recommends holding the stock.","movingAverages":1,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":9,"fibonacciRetracement":4,"bollingerBands":5,"overallTrend":"neutral","riskLevel":3,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The Moving Averages indicator shows a score of 9 out of 10 suggesting a strong bullish momentum in the market. The MACD indicator also shows a strong bullish momentum in the market with a score of 9 out of 10. The Relative Strength Index shows a score of 8 out of 10 which indicates that the stock is slightly overbought but still within the bullish zone. The Fibonacci Retracement indicator shows a score of 7 out of 10 which indicates that the stock is currently at a key support level. The Bollinger Bands indicator shows a score of 8 out of 10 which indicates that the stock is currently trading within the upper Bollinger Band and is likely to continue moving upwards. Overall, the technical analysis suggests that the market is in a strong bullish momentum and that the stock is likely to continue moving upwards in the short term. The overall risk level is considered to be 0 out of 5, indicating a low risk and overall risk is low. Therefore, the decision is to BUY.","movingAverages":9,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":8,"fibonacciRetracement":7,"bollingerBands":8,"overallTrend":"upward","riskLevel":0,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The summary report shows that the stock market is highly volatile. The Moving Averages analysis method indicates that the stock price is in a downtrend, with a score of 2 out of 10. The Moving Averages Convergence Divergence analysis method also indicates a downtrend, with a score of 1 out of 10. The Relative Strength Index analysis method indicates that the stock is oversold, with a score of 10 out of 10. The Fibonacci Retracement analysis method indicates that the stock is at a support level, with a score of 8 out of 10. The Bollinger Bands analysis method indicates that the stock is at a low volatility level, with a score of 7 out of 10. The overallTrend is downward, the riskLevel is 0 out of 5 and the overallRisk is low. The decision is HOLD.","movingAverages":2,"movingAveragesConvergenceDivergence":1,"relativeStrengthIndex":10,"fibonacciRetracement":8,"bollingerBands":7,"overallTrend":"downward","riskLevel":0,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":7,"fibonacciRetracement":6,"bollingerBands":6,"overallTrend":["downward","upward","neutral","upward","downward"],"riskLevel":2,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}