{"results":[{"summary":"The stock appears to be in a downward trend. The Moving Averages and MACD analysis methods both indicate a strong sell signal, with scores of 0 and 1, respectively. The RSI and Fibonacci Retracement methods also indicate a sell signal, with scores of 1 and 2, respectively. The Bollinger Bands method indicates a neutral signal, with a score of 5. Overall, the stock looks to be in a downward trend with high risk and overall risk is high. A SELL decision is recommended.","movingAverages":0,"movingAveragesConvergenceDivergence":1,"relativeStrengthIndex":1,"fibonacciRetracement":2,"bollingerBands":5,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The stock is currently in a downward trend. The moving averages are showing a strong downward trend, with the 50-day moving average below the 200-day moving average. The MACD is also showing a downward trend, with the MACD line below the signal line. The RSI is showing a neutral reading, but is trending downwards. The Fibonacci retracement levels show that the stock is currently trading near the 61.8% retracement level, which is a potential support level. The Bollinger Bands are showing that the stock is trading below the lower Bollinger Band, which is a bearish signal. Overall, the technical analysis is indicating that the stock is in a downward trend and is likely to continue to decline in the near term. The risk level is currently 4 out of 5, indicating a high risk of further losses. The overall risk is high.","movingAverages":3,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":2,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The Moving Averages Analysis indicates a mildly positive trend, with a score of 6 out of 10. The Moving Averages Convergence Divergence Analysis also suggests a positive trend with a score of 7 out of 10. The RSI Analysis indicates the stock may be slightly overbought, with a score of 8 out of 10. The Fibonacci Retracement Analysis indicates the stock may be headed for a correction or pullback, giving a score of 2 out of 10. The Bollinger Bands Analysis suggests that the stock is trading in the middle range, with a score of 5 out of 10. Overall, despite a positive trend indicated by the MACD and MA Analyses, the lower ranking of the Fibonacci Retracement Analysis indicates that a correction may occur in the short term. The overall risk level is 3 out of 5, indicating medium risk. Therefore, the overall risk is medium and the decision is to HOLD.","movingAverages":6,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":8,"fibonacciRetracement":2,"bollingerBands":5,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":3,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":5,"fibonacciRetracement":3,"bollingerBands":4,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"SELL","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}