{"results":[{"summary":"Based on the five technical analysis methods used: Moving Averages, MACD, Relative Strength Index, Fibonacci Retracement and Bollinger Bands, the current trend, risk level, overall risk and decision for CC.D.C.USS.IP are as follows: \n\n- **Trend**: The current mid to long-term trend is sideways (neutral) based on the moving averages and the mid-term trend is sideways (neutral) based on the MACD.\n- **Risk level**: 5 out of 5. \n- **Overall risk**: High.\n- **Decision**: HOLD.","movingAverages":5,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":7,"fibonacciRetracement":8,"bollingerBands":9,"overallTrend":"neutral","riskLevel":5,"overallRisk":"high","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend for this stock is downwards. The moving averages suggest a neutral sentiment with a score of 2 out of 10. The MACD indicator also suggests a neutral sentiment with a score of 3 out of 10. The RSI is also indicating a neutral sentiment with a score of 4 out of 10. The Fibonacci Retracement indicator is also neutral with a score of 4 out of 10. The Bollinger Bands is also neutral with a score of 5 out of 10. The overall risk level is 1 out of 5, indicating a low risk. The overall risk is low. The decision is to HOLD.","movingAverages":2,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":4,"fibonacciRetracement":4,"bollingerBands":5,"overallTrend":"downward","riskLevel":1,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"There is a consistent downward trend in the stock price over the past 5 trading days. The moving averages are below the current price, indicating a potential buy signal. MACD is also giving a buy signal, as the MACD line is above the signal line and the histogram is positive. However, RSI is in the overbought territory, indicating that the stock may be due for a pullback. Fibonacci retracement is showing a support level at $395.5, which could provide a potential buying opportunity if the stock pulls back to that level. Bollinger Bands are showing that the current price is below the lower Bollinger Band, which indicates that the stock may be oversold. Overall, the technical analysis indicates a potential buy signal for the stock. The risk level is medium, and the overall risk is moderate. A buy decision is recommended.","movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":5,"fibonacciRetracement":7,"bollingerBands":6,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"BUY","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":7,"overallTrend":"downward","riskLevel":3,"overallRisk":["high","low","medium"],"decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}