{"results":[{"summary":"The overall trend of the stock appears to be upward. The moving averages analysis method indicates a score of 7 out of 10, suggesting a slight upward trend. The MACD analysis method indicates a score of 6 out of 10, which is neutral. The RSI analysis method indicates a score of 7 out of 10, suggesting a slight upward trend. The fibonacci retracement analysis method indicates a score of 8 out of 10, suggesting a strong upward trend. The Bollinger Bands analysis method indicates a score of 6 out of 10, which is neutral. Overall, the summary of the technical analysis suggests that the stock is in an upward trend with a mild chance of correction. Based on this analysis, the overall risk level is considered low, with a riskLevel of 2 out of 5. The overall recommendation is to BUY the stock.","movingAverages":7,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":7,"fibonacciRetracement":8,"bollingerBands":6,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"Analysis of technical indicators are:\n\n1. Moving Averages: The Moving Averages analysis is bullish and indicates a potential upside movement. The score for this analysis is 8 out of 10.\n2. Moving Average Convergence Divergence: The MACD analysis is neutral and does not provide a clear indication of the stock's future direction. The score for this analysis is 5 out of 10.\n3. Relative Strength Index: The RSI analysis is bullish and indicates a potential upside movement. The score for this analysis is 7 out of 10.\n4. Fibonacci Retracement: The Fibonacci Retracement analysis is bullish and indicates a potential upside movement. The score for this analysis is 8 out of 10.\n5. Bollinger Bands: The Bollinger Bands analysis is bullish and indicates a potential upside movement. The score for this analysis is 8 out of 10.\n\nThe overall trend for this stock is upward. The overall risk level is low and the overall risk is low. The recommendation is to BUY this stock.","movingAverages":8,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":7,"fibonacciRetracement":8,"bollingerBands":8,"overallTrend":"upward","riskLevel":1,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The short term outlook for CC.D.C.USS.IP is moderately bearish with a short-term trend towards downward movement as it has been trading below its 10 and 200 day moving averages for the past 2 weeks. The stock is currently trading in a volatile range between 395 and 405, and has been moving sideways for the past week, within the range of 395 and 405. The Moving Averages are also indicating a downward trend. The RSI, and MACD are indicating a downward trend. The Fibonacci Retracement levels indicate a potential support level at 395 and a potential resistance level at 405. The Bollinger Bands are indicating a potential support level at 395 and a potential resistance level at 405. Overall, the technical analysis shows a moderately bearish short-term outlook for CC.D.C.USS.IP. It is important to note that the stock market is very volatile and can change direction quickly, so it is important to be aware of the risks involved before making any investment decisions.","movingAverages":6,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":4,"bollingerBands":6,"overallTrend":"downward","riskLevel":3,"overallRisk":"high","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":7,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":7,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"},"open_position":true,"epic":"CC.D.C.USS.IP"}