{"results":[{"summary":"Based on the technical analysis methods used, the overall trend for CC.D.C.USS.IP is neutral. The moving averages suggest a slightly bullish trend, with a score of 6 out of 10. The MACD indicator shows a neutral trend, with a score of 5 out of 10. The relative strength index (RSI) indicates a slightly bullish trend, with a score of 6 out of 10. The Fibonacci retracement levels suggest a possible bullish reversal, with a score of 7 out of 10. The Bollinger Bands indicator suggests a neutral trend, with a score of 5 out of 10. Overall, the technical analysis methods provide a mixed outlook for CC.D.C.USS.IP, with some indicators suggesting a slightly bullish trend and others suggesting a neutral trend. The risk level is considered medium, with a score of 3 out of 5. The overall risk is considered medium. The recommended decision is HOLD.","movingAverages":6,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":5,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"Prices fluctuated throughout the trading day with a slow upward trend after a small drop early in the morning. The stock prices steadily increased during the day, until around midday where the prices sharply increased. These high prices did not last and by the end of the day most gains were lost. In summary the overall trend was slightly upwards, but within that, it was very volatile with a big spike near the middle of the day, and ending at around the same price it started the day. The risk of holding this stock is medium with an overall risk level of 3 out of 5 and the decision is to HOLD.","movingAverages":6,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":7,"fibonacciRetracement":3,"bollingerBands":4,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The five technical analysis methods used to analyse the financial data of stock CC.D.C.USS.IP give mixed signals on the future price movements of the stock.\n\nMoving Averages: 6 out of 10\nThe stock is currently trading above its 50-day moving average which is a bullish signal however it is trading below its 200-day moving average which is a bearish signal. So an overall score of 6 out of 10 is given for moving averages.\n\nMACD (Moving Average Convergence Divergence): 7 out of 10\nThe MACD line is above the signal line and the histogram is positive. This is a bullish signal. So a score of 7 out of 10 is given for MACD technical analysis.\n\nRelative Strength Index (RSI): 5 out of 10\nThe RSI is currently at 55. This is a neutral reading that indicates the stock is neither overbought nor oversold. So a score of 5 out of 10 is given for RSI technical analysis.\n\nFibonacci Retracement: 8 out of 10\nThe stock price has recently retraced to the 38.2% Fibonacci level. This is a common retracement level and it could provide support for the stock price. So a score of 8 out of 10 is given for Fibonacci Retracement technical analysis.\n\nBollinger Bands: 7 out of 10\nThe stock price is currently trading within the Bollinger Bands. This indicates that the stock price is not overbought or oversold. So a score of 7 out of 10 is given for Bollinger Bands technical analysis.\n\nOverall the five technical analysis methods give a slightly bullish signal on the stock price of CC.D.C.USS.IP. However, it is important to note that this is solely based on the technical data and not on the fundamentals of the company.\n\nThe overall trend of the stock price is neutral. The stock price has been trading in a range between $393.9 and $407.6 for the past few months.\n\nThe risk level of the stock is medium. The stock price has been volatile over the past few months.\n\nThe overall risk is medium. The stock price has been volatile and the overall trend is neutral. The five technical analysis methods do not provide a strong signal either way on the future price movements of the stock.\n\nThe decision is HOLD. The risk level is medium, and the overall trend is neutral. The five technical analysis methods do not provide a strong signal on the future price movements of the stock, so it is best to hold the stock for now.","movingAverages":6,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":5,"fibonacciRetracement":8,"bollingerBands":7,"overallTrend":"neutral","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend is bullish with rise 100% by the end of the period. Moving Averages indicator recommend STRONG BUY, with the current price being below all of the moving averages that have been plotted. MACD indicator recommend STRONG BUY, with the MACD line above the signal line and the histogram being positive. Relative Strength Index is neutral with a current value of 56.8.  Fibonacci Retracement suggests a STRONG BUY with the current price being below the 0.382 retracement level. Bollinger Bands indicator suggests a STRONG BUY, with the current price being below the lower Bollinger Band. The overall risk level is 2 out of 5, with the potential for a high rate of return but also a higher risk of loss. The overall recommendation is STRONG BUY.","movingAverages":10,"movingAveragesConvergenceDivergence":10,"relativeStrengthIndex":5.68,"fibonacciRetracement":10,"bollingerBands":10,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":7,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":7,"overallTrend":["neutral","upward","neutral","upward"],"riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}