{"results":[{"summary":"The stock has been trending upwards over the past few days. The moving averages are positive, with the 5-day MA above the 10-day MA and the 10-day MA above the 20-day MA. The MACD is also positive, with the MACD line above the signal line and both lines above the zero line. The RSI is in the overbought territory, indicating that the stock may be due for a pullback. The Fibonacci retracement levels show that the stock is currently trading near the 50% retracement level, which could provide support. The Bollinger Bands are widening, indicating that volatility is increasing. Overall, the technical analysis indicates that the stock is in a bullish trend, but there is some risk of a pullback in the near term.","movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":7,"fibonacciRetracement":5,"bollingerBands":6,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The stock has been showing a mostly downward trend in the past day with a slight recovery in the last few hours. It is currently trading around 396.70, which is down from its opening price of 396.90. The moving averages are showing a downward trend, which suggests that the stock price may continue to fall in the short term. The MACD is also showing a downward trend, which indicates that the stock is losing momentum. The RSI is currently in the oversold territory, which suggests that the stock may be due for a bounce. The Fibonacci retracement levels show that the stock is currently trading near the 38.2% retracement level, which is a potential support level. The Bollinger Bands are showing that the stock is currently trading within the Bollinger Bands, which indicates that volatility is relatively low. Overall, the technical analysis suggests that the stock is in a downward trend and may continue to fall in the short term. However, the RSI is showing that the stock may be due for a bounce and the Fibonacci retracement levels show that the stock is currently trading near a potential support level. Therefore, it is important to monitor the stock closely to see if it reverses its current trend.","movingAverages":6.5,"movingAveragesConvergenceDivergence":5.5,"relativeStrengthIndex":19,"fibonacciRetracement":5,"bollingerBands":7,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend for this stock is neutral. The moving averages are slightly bearish, with a score of 4 out of 10. The MACD is also slightly bearish, with a score of 5 out of 10. The RSI is neutral, with a score of 6 out of 10. The Fibonacci retracement is slightly bullish, with a score of 7 out of 10. The Bollinger Bands are slightly bearish, with a score of 4 out of 10. The overall risk level is medium, with a score of 3 out of 5. The overall risk is medium. The decision is to HOLD.","movingAverages":4,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":4,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The Moving Averages indicator shows a bullish (6) signal indicating that the price will continue to go up. The MACD indicator shows a neutral (4) signal indicating that the price may go up. The Relative Strength Index indicator shows a bullish (9) signal indicating that the price is likely to go up. The Fibonacci Retracement indicator shows a neutral (5) signal indicating that the price may go up. The Bollinger Bands indicator shows a neutral (5) signal indicating that the price may go up. The overallTrend is neutral. The riskLevel is 2. The overallRisk is low. The decision is HOLD.","movingAverages":6,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":9,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"neutral","riskLevel":2,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The stock price of CC.D.C.USS.IP is trending downwards at present. While the RSI indicates a relatively neutral position, the MACD, moving averages, Fibonacci retracement and Bollinger bands all suggest a negative trend and a bearish outlook. While there have been some upward price movements during trading hours, these have been met with selling pressure. Given the combination of bearish technical analysis and recent downward price activity, it is advisable to exercise caution and consider selling or holding the stock rather than buying at this time.","movingAverages":4,"movingAveragesConvergenceDivergence":1,"relativeStrengthIndex":5,"fibonacciRetracement":2,"bollingerBands":3,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL"}],"findings":{"movingAverages":6,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":9,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":["upward","downward","neutral","neutral","downward"],"riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}