{"results":[{"summary":"The overall trend for the stock is slightly upward as seen by the positive slope of the moving averages. The MACD indicator is also positive, indicating that the stock is in a bullish trend. The RSI indicator is showing a reading of 51, which is in the middle of the range and does not provide a clear indication of whether the stock is overbought or oversold. The Fibonacci Retracement levels show that the stock price is currently trading at the 50% retracement level, which is a neutral level of support or resistance. The Bollinger Bands are showing that the stock price is currently trading within the upper Bollinger Band, which indicates that the stock is overbought and may be due for a correction. Overall, the technical analysis indicates that the stock is in a slightly bullish trend, but it is important to note that the stock price is trading at an overbought level and may be due for a correction. The overall risk level is 2 out of 5, which is medium risk. The overall risk is medium. The decision is HOLD.","movingAverages":7,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":3,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The technical analysis in this report gives various ratings for the stock CC.D.C.USS.IP using 5 different analysis methods, including moving average, MACD, RSI, Fibonacci Retracement and Bollinger Bands. The Moving Averages score is 7 out of 10, indicating a moderate bullish trend. The MACD score is 5 out of 10, indicating a slightly bullish trend. The RSI score is 3 out of 10, indicating a weak buy signal. The Fibonacci Retracement score is 2 out of 10, indicating a possible downside move. The Bollinger Bands score is 6 out of 10, indicating that the stock is currently overbought. Based on these indicators, the overall trend for the stock is neutral, with a risk level of 2 out of 5, indicating a medium risk. The overall risk is considered to be medium and the decision is to HOLD.","movingAverages":7,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":3,"fibonacciRetracement":2,"bollingerBands":6,"overallTrend":"neutral","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The recent market trend is upward, characterized by positive signals from technical analysis methods such as Moving Averages, MACD, RSI and Bollinger Bands. The Fibonacci Retracement analysis suggests a sell signal. Overall, the stock seems to be on an upward trajectory with medium risk. Based on the analysis, a SELL decision is recommended.","movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":8,"fibonacciRetracement":2,"bollingerBands":8,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is upward. The moving averages, MACD and RSI all indicate a buy signal. The Fibonacci retracement levels also indicate a potential buy opportunity. The bollinger bands are also indicating a buy signal. The overall risk is low, and the overall risk level is low. The decision is to BUY the stock.","movingAverages":8,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":8,"fibonacciRetracement":8,"bollingerBands":8,"overallTrend":"upward","riskLevel":1,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is upward. The moving average analysis suggests a long-term bullish trend, with the price moving above its 50-day and 200-day moving averages for the majority of the period. The MACD analysis also indicates a positive trend, with the MACD line above the signal line and the histogram bars positive for most of the period. The relative strength index (RSI) shows that the stock is in overbought territory, suggesting that a pullback may be due. The Fibonacci retracement analysis indicates that the stock is currently trading near the 61.8% retracement level, which is a potential support level. The Bollinger Bands analysis shows that the stock is trading within the upper Bollinger Band, indicating that it is overbought. Overall, the technical analysis suggests that the stock is in a long-term bullish trend, but a pullback may be due in the near term.","movingAverages":8,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":7,"fibonacciRetracement":6,"bollingerBands":7,"overallTrend":"upward","riskLevel":1,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":6,"fibonacciRetracement":5,"bollingerBands":6,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":["HOLD","HOLD","SELL","BUY","BUY"],"epic":"CC.D.C.USS.IP"},"open_position":true,"epic":"CC.D.C.USS.IP"}