{"results":[{"summary":"The stock's Moving Averages are neutral. The MACD is also neutral, but it is starting to trend downwards. The RSI is also neutral, but it is close to being overbought. The Fibonacci Retracement levels show that the stock is currently trading at the 38.2% retracement level. The Bollinger Bands are neutral, but they are starting to widen, which could indicate that the stock is about to make a move. Overall, the technical analysis is mixed, but it suggests that the stock could be due for a correction. The overall risk level is moderate. The overall risk is neutral. The decision is HOLD.","movingAverages":5,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"neutral","riskLevel":2,"overallRisk":"neutral","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend for this stock is slightly negative. The Moving Averages and MACD indicators both suggest a slightly negative trend, while the RSI and Fibonacci Retracement indicators suggest a slightly positive trend. The Bollinger Bands indicator is neutral. Therefore, the risk level is assessed as medium and the overall risk is assessed as neutral. Overall, the slight negative trend and high volatility suggest caution when investing in this stock.","movingAverages":9,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":6,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"downward","riskLevel":2,"overallRisk":"neutral","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"Overall, the technical analysis gives this stock a score of 6 out of 10 for potential upwards movement. The moving averages indicate a neutral trend, with the MACD showing some bullish momentum. The RSI and Fibonacci retracement suggest the stock is slightly overbought. The Bollinger Bands show that the stock is currently trading within the middle of its range. Given these indications, it may be wise to wait for a more opportune moment to enter the market and monitor the price action closely for further confirmation of an uptrend before making any final decisions. This analysis is a summary of the technical indicators and does not consider any fundamental factors or other macroeconomic factors that could influence the price of this stock in the future. As such, it is always advisable to conduct thorough research and consider professional advice before making any investment decisions.","movingAverages":6,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":6,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The general sentiment for CC.D.C.USS.IP is mixed and continues to be volatile. There are 8 bullish signals and 7 bearish signals. The RSI is between 30 and 70, indicating that the stock is not overbought or oversold. The MACD line is below the signal line, indicating that the stock is in a downtrend. The Bollinger Bands are narrowing, which indicates that volatility is decreasing. The Fibonacci Retracement levels show that the stock is currently trading at the 61.8% retracement level. Overall, the technical analysis suggests that the stock is likely to continue to be volatile in the short term. However, the long-term trend is still bullish.\nMoving Averages: 5/10\nMACD: 6/10\nRelative Strength Index (RSI): 4/10\nFibonacci Retracement: 7/10\nBollinger Bands: 3/10\nOverall Trend: neutral\nRisk Level: 3/5\nOverall Risk: medium\nDecision: HOLD","movingAverages":5,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":4,"fibonacciRetracement":7,"bollingerBands":3,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The stock has been trending downwards in the last few days with low movements. There is a downward movement of about 4.7% in the last 5 days. In the last month, it is down by roughly 1.5%. The analysis shows that the stock price has been in a downward trend, with a strong confirmation from the RSI indicator. The MACD indicator is indicating a negative divergence, which means that the stock price is overbought and could be due for a correction. The Fibonacci Retracement indicator shows that the stock price is currently at a support level. The Bollinger Bands indicator shows that the stock price is currently below the lower Bollinger Band, which indicates that the stock is oversold. Overall, the trend is downward, the risk level is 3 and the overall risk is medium. A SELL recommendation is made based on the analysis.","movingAverages":7,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":2,"fibonacciRetracement":6,"bollingerBands":1,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":6,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":4,"overallTrend":["neutral","downward","upward","neutral","downward"],"riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}