{"results":[{"summary":"Based on the technical analysis, the stock price of CC.D.C.USS.IP is likely to go down. The moving averages indicate a downward trend, with the MACD also suggesting a sell signal. The relative strength index is neutral, but the fibonacci retracement and bollinger bands are both bearish. Overall, the risk is high and a HOLD decision is recommended.\n\n1. Moving Averages: 1/10\n2. Moving Average Convergence Divergence: 0/10\n3. Relative Strength Index: 5/10\n4. Fibonacci Retracement: 0/10\n5. Bollinger Bands: 0/10\n\nOverall Trend: downward\nRisk Level: 5\nOverall Risk: high\nDecision: HOLD\nepic: CC.D.C.USS.IP","movingAverages":1,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":5,"fibonacciRetracement":0,"bollingerBands":0,"overallTrend":"downward","riskLevel":5,"overallRisk":"high","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The technical analysis of the stock CC.D.C.USS.IP suggests that the Moving Averages are slightly bullish, the MACD is slightly bullish, the Relative Strength Index is neutral, the Fibonacci Retracement is neutral, and the Bollinger Bands are neutral. The overallTrend is neutral, the riskLevel is 1 (low risk), the overall risk is considered as \"low\" and the decision is HOLD.","movingAverages":6,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"neutral","riskLevel":1,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"There has been a small bullish trend for CC.D.C.USS.IP over the past few days. The Moving Averages, MACD, and Bollinger Bands indicators suggest a bullish trend, while the RSI and Fibonacci Retracement indicators suggest a neutral trend. Overall, the indicators are mixed, but the bullish signals are slightly more prevalent. The risk level is considered low, and the overall risk is considered low. The decision is to BUY.","movingAverages":8,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":8,"overallTrend":"upward","riskLevel":1,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The technical indicators are providing conflicting signals, with some indicating a bullish trend and others indicating a bearish trend. The moving averages and MACD indicators suggest a bullish trend, while the Fibonacci retracement, Bollinger Bands, and RSI indicators suggest a bearish trend. Overall, the trend is unclear and caution is advised.\n\nThe moving averages are sloping upwards, indicating a bullish trend. The 50-day moving average is above the 200-day moving average, which is also a bullish sign. The MACD indicator is also bullish, with the MACD line above the signal line and both lines above the zero line.\n\nThe Fibonacci retracement levels show that the price has retraced to the 61.8% level, which is a potential support level. However, the price has also broken below the 50% level, which is a potential resistance level. The Bollinger Bands are also bearish, with the price trading below the lower Bollinger Band. The RSI indicator is also bearish, with the RSI value below 30, which is considered oversold territory.\n\nOverall, the technical indicators are providing conflicting signals. The moving averages and MACD indicators suggest a bullish trend, while the Fibonacci retracement, Bollinger Bands, and RSI indicators suggest a bearish trend. The overall trend is unclear and caution is advised.","movingAverages":7,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":4,"fibonacciRetracement":6,"bollingerBands":4,"overallTrend":"neutral","riskLevel":2,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":6,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":4,"bollingerBands":4,"overallTrend":"neutral","riskLevel":2,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}