{"results":[{"summary":"Based on the Moving Averages technical analysis, the stock price is expected to go downwards over the next few days. The MACD shows that the stock is in a downward trend, with the MACD line below the signal line. The RSI is below 30, indicating that the stock is oversold. The Fibonacci Retracement shows that the stock is currently trading at the 61.8% retracement level, which is a potential support level for the stock. The Bollinger Bands show that the stock is currently trading below the lower Bollinger Band, which is a bearish sign. Overall, the technical analysis suggests that the stock is likely to continue to decline in the short term.\n\nThe risk level for this stock is 2 out of 5, indicating a medium risk of loss. The overall risk is medium due to the combination of a downward trend, oversold RSI and the stock trading below the lower Bollinger Band. Given the high risk, I would recommend selling this stock.","movingAverages":0,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":0,"fibonacciRetracement":0,"bollingerBands":0,"overallTrend":"downward","riskLevel":2,"overallRisk":"medium","decision":"SELL","epic":"CC.D.C.USS.IP"},{"summary":"The MACD and RSI show upward trending momentum. The Bollinger Bands are fairly neutral. The Moving Averages are bearish. The Fibonacci Retracement shows the price is either currently in a retracement or about to start one. The overall risk of this stock is medium, and the overall trend is upward. The decision is to HOLD for now.","movingAverages":2,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":7,"fibonacciRetracement":6,"bollingerBands":5,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The Moving Averages suggest a slightly upward trend, while the MACD shows a strong bullish momentum. The RSI indicates that the stock is slightly overbought. The Fibonacci Retracement suggests a potential support level at 395.5 and a resistance level at 407.6. The Bollinger Bands indicate that the stock is trading within a relatively narrow range. The overall trend is slightly upward with a medium risk level and an overall risk of low. The decision is to BUY.","movingAverages":7,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":6,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is upward. The moving averages are slightly positive, with a score of 7 out of 10. The MACD is also slightly positive, with a score of 6 out of 10. The RSI is neutral, with a score of 5 out of 10. The fibonacci retracement is slightly positive, with a score of 6 out of 10. The Bollinger Bands are neutral, with a score of 5 out of 10. Overall, the risk level is low, with a score of 2 out of 5. The overall risk is low. This indicates that the stock is a good investment. The decision is to BUY.","movingAverages":7,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":5,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"BUY","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":4,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":4,"overallTrend":"upward","riskLevel":2,"overallRisk":["medium","medium","low","low"],"decision":"BUY","epic":"CC.D.C.USS.IP"},"open_position":false,"epic":"CC.D.C.USS.IP"}