{"results":[{"summary":"The stock price has been on a mostly upward trend over the past 48 hours, with some fluctuations. The moving averages, MACD, and RSI indicators are all showing positive signs, indicating that the stock is likely to continue to rise in price. The Fibonacci retracement indicator is also showing that the stock is currently in a bullish retracement phase, which is another sign that the stock is likely to continue to rise in price.\n\nOverall, the technical analysis indicates that the stock is likely to continue to rise in price. However, it is important to note that past performance is not always indicative of future results. Investors should always do their own research before making any investment decisions.","movingAverages":9,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":7,"fibonacciRetracement":8,"bollingerBands":5,"overallTrend":"upward","riskLevel":1,"overallRisk":"low","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"},{"summary":"The financial data presented shows the stock price of a security over a period of time. Technical analysis methods Moving Averages, MACD, Fibonacci Retracement, Bollinger Bands and RSI have been applied to the data to gain insights into the stock's trend and potential future performance. \n\nThe Moving Averages indicator, which measures the average price of a stock over a specific period of time, suggests a neutral to slightly upward trend. The MACD indicator, which measures the relationship between two exponential moving averages, also indicates a neutral trend with potential for a bullish crossover in the future. \n\nThe Fibonacci Retracement tool, which identifies potential support and resistance levels based on historical price movements, suggests that the stock may have reached a support level around the 400.00 price level. The Bollinger Bands indicator, which measures the volatility of a stock's price, suggests that the stock is currently trading within a relatively narrow range. \n\nThe RSI indicator, which measures the magnitude of recent price changes to evaluate whether a stock is overbought or oversold, suggests that the stock is currently in neutral territory. \n\nOverall, the technical analysis indicators suggest that the stock is currently in a neutral to slightly bullish trend. While there is potential for the stock to move higher in the future, investors should proceed with caution and consider other factors such as the overall market conditions and the company's fundamentals before making any investment decisions.","movingAverages":9,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":5,"overallTrend":"neutral","riskLevel":2,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The general trend of the stock price is upwards. The indicators show that the stock is overbought and there is a bearish divergence between the price and the MACD indicator. The RSI is above 70 which also suggest that the market is overbought. The Bollinger Bands indicator is showing that the price is above the upper Bollinger Band. Overall, the technical analysis suggests that the stock price may experience a correction in the short term.","movingAverages":7.5,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":9,"fibonacciRetracement":6,"bollingerBands":9,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"This stock's Moving Averages are indicating a positive trend. The Moving Average Convergence Divergence is indicating a positive trend. The Relative Strength Index is indicating a positive trend. The Fibonacci Retracement is indicating a neutral trend. The Bollinger Bands are indicating a positive trend. The overall trend is positive. The risk level is 0 out of 5. The overall risk is low. The decision is to STRONG BUY this stock.","movingAverages":9,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":8,"fibonacciRetracement":6,"bollingerBands":9,"overallTrend":"upward","riskLevel":0,"overallRisk":"low","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":9,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":7,"fibonacciRetracement":7,"bollingerBands":7,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":["STRONG BUY","HOLD","HOLD","STRONG BUY"],"epic":"CC.D.C.USS.IP"},"open_position":true,"epic":"CC.D.C.USS.IP"}