{"results":[{"summary":"The MACD, RSI and Bollinger Bands all show strong bullish signals. The MACD line is above the signal line and the histogram is increasing, indicating upward momentum. The RSI is above 70, indicating the stock is overbought but still has room to grow. The Bollinger Bands are widening, indicating increased volatility and a potential breakout. The Fibonacci Retracement shows that the stock is currently at the 38.2% retracement level, which is typically a support level. The moving averages are mixed, with the short-term moving averages showing a bullish trend and the long-term moving averages showing a bearish trend. Overall, the technical analysis suggests that the stock is in a bullish trend and has the potential to continue to grow in the short term. However, the long-term trend is still bearish, so caution is advised.","movingAverages":7,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":9,"fibonacciRetracement":7,"bollingerBands":8,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"BUY","epic":"CC.D.C.USS.IP"},{"summary":"The recent financial data for CC.D.C.USS.IP indicates a period of volatility and some concerning trends. The moving averages show a downward trend, while the MACD shows some fluctuations but is still trending downwards. The RSI is below 50, indicating that the stock may be undervalued. The Fibonacci Retracement shows that the price is currently at a key support level, and a break below this level could lead to further losses. The Bollinger Bands are wide, indicating high volatility. Overall, the trend is downward, the risk level is medium, and the overall risk is low. A HOLD decision is recommended at this time.","movingAverages":5,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":7,"fibonacciRetracement":6,"bollingerBands":8,"overallTrend":"downward","riskLevel":2,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},{"summary":"The overall trend of the stock is bullish. The moving averages are indicating a bullish trend, with the 50-day moving average above the 200-day moving average and both moving averages trending upwards. The moving averages convergence divergence (MACD) is also indicating a bullish trend, with the MACD line above the signal line and both lines trending upwards. The relative strength index (RSI) is also indicating a bullish trend, with the RSI above 50 and trending upwards. The Fibonacci retracement levels are indicating that the stock is currently trading at the 50% retracement level, which is a potential area of support. The Bollinger Bands are also indicating a bullish trend, with the stock trading above the upper Bollinger Band. Overall, the technical analysis is indicating that the stock is in a bullish trend and is likely to continue to rise in the short term. The risk level is 2 (low) and the overall risk is low. The decision is STRONG BUY.","movingAverages":10,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":9,"fibonacciRetracement":5,"bollingerBands":9,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"STRONG BUY","epic":"CC.D.C.USS.IP"},{"summary":"The stock prices started off low but the trend and risk changed throughout the trading day. The moving average started low at 0.38 and increased in the afternoon to 4.23. The moving average convergence divergence (MACD) followed a similar pattern, starting low at 0.12 and increasing to 4.27 in the afternoon. The relative strength index (RSI) started low at 34.95 and increased to 63.19 in the afternoon. The Fibonacci retracement started low at 0.19 and increased a small amount to 0.26 in the afternoon, and the Bollinger Bands also started low at 0.52 and increased slightly throughout the day to reach 1.27. Overall, the stock had an upward trend as the day continued but ended at a riskLevel of 4 and an overallRisk of \"high\".","movingAverages":4.23,"movingAveragesConvergenceDivergence":4.27,"relativeStrengthIndex":63.19,"fibonacciRetracement":0.26,"bollingerBands":1.27,"overallTrend":"upward","riskLevel":4,"overallRisk":"high","decision":"HOLD","epic":"CC.D.C.USS.IP"}],"findings":{"movingAverages":7,"movingAveragesConvergenceDivergence":7,"relativeStrengthIndex":22,"fibonacciRetracement":5,"bollingerBands":7,"overallTrend":"upward","riskLevel":3,"overallRisk":"low","decision":"HOLD","epic":"CC.D.C.USS.IP"},"open_position":true,"epic":"CC.D.C.USS.IP"}