{"results":[{"summary":"The technical analysis of this stock shows that the price has been trending down in the last 2 days, and the short term analysis of the price show that the price has been falling. The 30 day moving average is also below the 15 day moving average. All of this indicates that the stock is likely to continue to fall and it might be a good idea to SELL.","movingAverages":2,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":4,"fibonacciRetracement":6,"bollingerBands":4,"overallTrend":"downward","riskLevel":2,"overallRisk":"medium","decision":"SELL","epic":"CS.D.MXNJPY.TODAY.IP"},{"summary":"The overall trend of the stock seems to be slightly downward, with a few upward spikes. The moving averages are indicating a buy signal, as the 20-day moving average is above the 50-day and 200-day moving averages. The MACD is also indicating a buy signal, with the MACD line above the signal line and both lines above the 0 level. The RSI is indicating a neutral signal, as it is in the middle of the 30-70 range. The Fibonacci Retracement is indicating a sell signal, as the stock price is currently below the 61.8% Fibonacci level. The Bollinger Bands are indicating a neutral signal, as the stock price is within the Bollinger Bands. Overall, the technical analysis is providing mixed signals, with some indicators suggesting a buy and others suggesting a sell. The risk level is 3 out of 5, indicating a moderate risk. The overall risk is medium. The decision is HOLD.","movingAverages":8,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":5,"fibonacciRetracement":2,"bollingerBands":5,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CS.D.MXNJPY.TODAY.IP"},{"summary":"The overall sentiment towards the stock is neutral. The majority of the technical analysis indicators show a bullish trend, with the exception of Bollinger Bands and Relative Strength Index which indicate a neutral to slightly bearish trend. The stock price has been fluctuating within a range over the past few days, with no clear trend. The 200-day moving average is currently above the stock price, which is a bearish signal. The MACD indicator is currently below the signal line, which is also a bearish signal. The RSI indicator is currently below 50, which is a neutral signal. The Fibonacci retracement levels show that the stock price is currently testing the 38.2% retracement level. Overall, the technical analysis indicates a neutral to slightly bearish trend for the stock. However, it is important to note that technical analysis is not a perfect science and should be used in conjunction with other forms of analysis.","movingAverages":6,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":3,"overallTrend":"neutral","riskLevel":2,"overallRisk":"low","decision":"HOLD","epic":"CS.D.MXNJPY.TODAY.IP"},{"summary":"The MACD has a value around the zero line for most of the records, showing a sideways movement in the asset. The price has been mostly above the Bollinger Bands, and closed well above the upper band on two occasions. The RSI is mostly above 50 especially in the most recent days. Overall it looks like the asset is trending up and the price action is supported by the indicators. ","movingAverages":6.5,"movingAveragesConvergenceDivergence":5.5,"relativeStrengthIndex":6.5,"fibonacciRetracement":7,"bollingerBands":7.5,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"STRONG BUY","epic":"CS.D.MXNJPY.TODAY.IP"}],"findings":{"movingAverages":6,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"downward","riskLevel":2,"overallRisk":["medium","medium","low","low"],"decision":"HOLD","epic":"CS.D.MXNJPY.TODAY.IP"},"open_position":false,"epic":"CS.D.MXNJPY.TODAY.IP"}