{"results":[{"summary":"The short term trend is downward as indicated by the Moving Averages value of 3 out of 10. The Moving Average Convergence Divergence indicator is also bearish with a value of 1 out of 10. The Relative Strength Index is neutral with a value of 6 out of 10. The Fibonacci Retracement indicator is bearish with a value of 1 out of 10. The Bollinger Bands indicator is bearish with a value of 2 out of 10. The overall trend is downward. The overall risk level is 3 out of 5 and the overall risk is medium. Therefore, the decision is to SELL.","movingAverages":3,"movingAveragesConvergenceDivergence":1,"relativeStrengthIndex":6,"fibonacciRetracement":1,"bollingerBands":2,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CS.D.MXNJPY.TODAY.IP"},{"summary":"The moving averages and MACD indicators are both bearish. The RSI is neutral. The Fibonacci retracement is bullish. The Bollinger Bands are bearish. The overall trend for the stock is downward. The risk level is 3 out of 5. The overall risk is medium. The decision is to SELL and the epic is CS.D.MXNJPY.TODAY.IP.","movingAverages":0,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":7,"fibonacciRetracement":8,"bollingerBands":0,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CS.D.MXNJPY.TODAY.IP"},{"summary":"The Japanese Yen has risen against the Mexican peso and is currently approaching the 888.0 level. The currency pair has been in a bullish trend since the middle of July, despite some pullbacks. The MACD is indicating a bullish trend, as the MACD line is above the signal line and the histogram is positive. The RSI is also indicating a bullish trend, as the RSI is above the 50 level. The Japanese Yen is above the middle Bollinger Band, indicating that it is in a bullish trend. The overall trend is upward, with a risk level of 3 and overall risk of \"medium\". The decision is to BUY.","movingAverages":0,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":10,"fibonacciRetracement":0,"bollingerBands":10,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"BUY","epic":"CS.D.MXNJPY.TODAY.IP"},{"summary":"The overall trend over the past week is **downward**. Using Moving Averages Technical Analysis, we determine the trend to be on a downward movement with an average strength of 5 out of 10. Using MACD (Moving Average Convergence Divergence), the strength is measured to be 3 out of 10 which indicates a weak momentum. RSI (Relative Strength Index) also indicates a downward trend with a score of 2 out of 10, which shows the stock is reaching oversold conditions. We can further see this by looking at the Bollinger Bands, with 2 out of 10 suggesting the price is reaching extreme lows. The Fibonacci Retracement also indicates a downward trend with a score of 2 out of 10, indicating a decrease in price over the past few days. Overall, the risk level we determine for this stock is 3 out of 5, implying the stock is moderately risky to trade. Considering these factors, we recommend to **SELL**.","movingAverages":5,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":2,"fibonacciRetracement":2,"bollingerBands":2,"overallTrend":"downward","riskLevel":3,"overallRisk":"high","decision":"SELL","epic":"CS.D.MXNJPY.TODAY.IP"}],"findings":{"movingAverages":2,"movingAveragesConvergenceDivergence":1,"relativeStrengthIndex":6,"fibonacciRetracement":3,"bollingerBands":4,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CS.D.MXNJPY.TODAY.IP"},"open_position":false,"epic":"CS.D.MXNJPY.TODAY.IP"}