{"results":[{"summary":"The current overall trend for the stock is downward. Moving Averages, MACD, Fibonacci Retracement, Bollinger Bands and RSI all indicate that the stock will continue to drop in the upcoming period. The risk level is medium to high. Therefore, we recommend SELL.","movingAverages":0,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":0,"fibonacciRetracement":1,"bollingerBands":0,"overallTrend":"downward","riskLevel":3,"overallRisk":"high","decision":"STRONG SELL","epic":"CS.D.MXNJPY.TODAY.IP"},{"summary":"The security is in the middle of a bear trend with prices that decreased in the range, with the greatest fall being -6.33%. The security is on the higher range of price after decreasing 48.42% in the past 14 days. Considering the indicators, the Moving Averages is pointing towards a **strong buy** for the security. The MACD is pointing towards a **buy** for the security. The RSI is pointing towards a **sell** for the security. The Fibonacci Retracement is pointing towards a **buy** for the security. The Bollinger Bands is pointing towards a **sell** for the security. Overall, our technical analysis indicates the stock should be **hold** with a **low** risk and **low** risk overall. Overall, the outlook for the stock is neutral.","movingAverages":9,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":4,"fibonacciRetracement":6,"bollingerBands":3,"overallTrend":"downward","riskLevel":1,"overallRisk":"low","decision":"HOLD","epic":"CS.D.MXNJPY.TODAY.IP"},{"summary":"Based on the 5 technical analysis methods used, the Moving Averages score is 1 out of 10, the Moving Average Convergence Divergence score is 2 out of 10, the Relative Strength Index score is 3 out of 10, the Fibonacci Retracement score is 5 out of 10 and the Bollinger Bands score is 3 out of 10. The overall trend is downward, the risk level is 0 out of 5 and the overall risk is low. The decision is to HOLD.","movingAverages":1,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":3,"fibonacciRetracement":5,"bollingerBands":3,"overallTrend":"downward","riskLevel":0,"overallRisk":"low","decision":"HOLD","epic":"CS.D.MXNJPY.TODAY.IP"},{"summary":"The Moving Averages value of 8/10 suggests a positive trend, while the MACD value of 9/10 indicates a strong bullish momentum. The Fibonacci Retracement value of 7/10 shows that the price is currently in a retracement period, while the Bollinger Bands value of 1/10 shows that the price is in a neutral zone. The RSI value of 6/10 indicates that the price is currently overbought. Overall, the technical analysis suggests that the price is in a neutral trend with a strong bullish momentum. The risk level is 3/5, and the overall risk is medium. Based on these indicators, the decision is BUY.","movingAverages":8,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":1,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"BUY","epic":"CS.D.MXNJPY.TODAY.IP"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":3,"fibonacciRetracement":5,"bollingerBands":2,"overallTrend":"downward","riskLevel":2,"overallRisk":"low","decision":"HOLD","epic":"CS.D.MXNJPY.TODAY.IP"},"open_position":false,"epic":"CS.D.MXNJPY.TODAY.IP"}