{"results":[{"summary":"The overall trend is downward. The best indicator is Moving Averages with a value of 5 out of 10, the MACD indicator has a value of 0 out of 10, RSI indicator has a value of 4 out of 10, the Fibonacci Retracement indicator has a value of 2 out of 10 and the Bollinger Bands indicator has a value of 0 out of 10. The overall risk is 5 out of 5 and can be considered high. ","movingAverages":5,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":4,"fibonacciRetracement":2,"bollingerBands":0,"overallTrend":"downward","riskLevel":5,"overallRisk":"high","decision":"SELL","epic":"CS.D.MXNJPY.TODAY.IP"},{"summary":"The stock price has been on a downward trend for the past few days, with a few small upward movements in between. The moving averages are all pointing downwards, indicating that the stock price is likely to continue to fall. The MACD is also pointing downwards, indicating that the selling pressure on the stock is stronger than the buying pressure. The RSI is currently in the oversold territory, indicating that the stock is likely to bounce back up in the short term. The Fibonacci retracement levels show that the stock price is currently at the 61.8% retracement level, which is a potential support level. The Bollinger Bands are currently neutral, indicating that the stock price is not overbought or oversold. Overall, the technical analysis suggests that the stock price is likely to continue to fall in the short term but may bounce back up in the medium term.","movingAverages":2,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":8,"fibonacciRetracement":6,"bollingerBands":6,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"SELL","epic":"CS.D.MXNJPY.TODAY.IP"},{"summary":"**Summary Report:**\n\nThe overall trend for this stock is neutral, with a slight downward bias over the past few days. The stock has been fluctuating within a range of 860 - 880 over the past month, with no clear sign of a breakout or breakdown. The moving averages are currently neutral, with the 50-day MA slightly above the 200-day MA. The MACD is also neutral, with the MACD line and signal line crossing above and below the zero line multiple times over the past few weeks. The RSI is currently in the neutral zone, indicating that the stock is not overbought or oversold. The Fibonacci retracement levels show that the stock is currently trading near the 61.8% retracement level, which could provide some support. The Bollinger Bands are currently neutral, with the stock price trading within the Bollinger Bands. Overall, the technical analysis indicates that the stock is in a neutral trend and could continue to move within a range of 860 - 880 in the near term.\n\n**Moving Averages:** 5/10\n**MACD (Moving Average Convergence Divergence):** 6/10\n**Relative Strength Index (RSI):** 5/10\n**Fibonacci Retracement:** 6/10\n**Bollinger Bands:** 5/10\n\n**Overall Trend:** Neutral\n**Risk Level:** 3/5\n**Overall Risk:** Medium\n\n**Decision:** HOLD\n\n**Epic:** CS.D.MXNJPY.TODAY.IP","movingAverages":5,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":4,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CS.D.MXNJPY.TODAY.IP"}],"findings":{"movingAverages":4,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":6,"fibonacciRetracement":5,"bollingerBands":3,"overallTrend":"downward","riskLevel":4,"overallRisk":"medium","decision":"SELL","epic":"CS.D.MXNJPY.TODAY.IP"},"open_position":false,"epic":"CS.D.MXNJPY.TODAY.IP"}