{"results":[{"summary":"The Moving Averages indicate a moderate bullish trend with a score of 7 out of 10. MACD is bullish with a score of 9. The RSI is neutral with a score of 6. Fibonacci Retracement is bullish with a score of 8 out of 10. Bollinger Bands are neutral with a score of 6. The overall trend is upward. The risk level is 2 out of 5, and the overallRisk is medium. Therefore, the decision is STRONG BUY.","movingAverages":7,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":6,"fibonacciRetracement":8,"bollingerBands":6,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"STRONG BUY","epic":"CS.D.USCGC.TODAY.IP"},{"summary":"The overall trend for this stock is upward. The Moving Averages indicate a positive long term trend, with the price currently trading above all three moving averages (5-day, 10-day, and 20-day). The MACD is also positive, with the MACD line above the signal line and both lines above zero. The RSI is in neutral territory, but it is trending higher, which indicates that there is more buying pressure than selling pressure. The Fibonacci Retracement levels show that the price is currently trading at the 38.2% retracement level, which is a support level. The Bollinger Bands are also indicating that the price is in a bullish trend, with the price trading above the upper Bollinger Band. Overall, the technical analysis indicates that this stock is in a bullish trend and is likely to continue to move higher in the short term. The overall risk level is 0 out of 5, which is considered very low. The overall risk is low, so the decision is BUY.","movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":6,"fibonacciRetracement":8,"bollingerBands":8,"overallTrend":"upward","riskLevel":0,"overallRisk":"low","decision":"BUY","epic":"CS.D.USCGC.TODAY.IP"},{"summary":"The price of the stock has been going up and down in the last few weeks but overall has a positive trend. The moving averages are positive, suggesting that the stock may continue to rise in value. The MACD is also positive, suggesting that the stock is in a bullish trend. The RSI is in the overbought zone, suggesting that the stock may be due for a correction. The Fibonacci retracement suggests that the stock could pull back to the 61.8% level before continuing its upward trend. The Bollinger Bands are wide, suggesting that the stock is volatile. Overall, the technical analysis suggests that the stock is in a bullish trend but may be due for a correction. The risk level is 3 out of 5. The overall risk is medium. The decision is HOLD.","movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":6,"fibonacciRetracement":5,"bollingerBands":8,"overallTrend":"upward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CS.D.USCGC.TODAY.IP"},{"summary":"At the time of the snapshot, the stock was on a upward trend.\nThe moving averages for the stock are indicating a buy. The moving average convergence divergence (MACD) is in negative territory, which is a bearish indicator but the MACD line has crossed above the signal line which is a bullish indicator. The relative strength index (RSI) is in the neutral range, which indicates that the stock is not overbought or oversold. The Fibonacci retracement levels show that the stock is currently trading near the 61.8% retracement level, which is a potential support level. The Bollinger Bands are showing that the stock is currently trading within the bands, which indicates that the stock's price is not considered extended and the stock price is not considered overvalued or undervalued.\nThe overall risk level of the stock is low. The overall trend of the stock is upward and the risk level is low so the decision is to BUY the stock.","movingAverages":8,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":8,"bollingerBands":5,"overallTrend":"upward","riskLevel":1,"overallRisk":"low","decision":"BUY","epic":"CS.D.USCGC.TODAY.IP"}],"findings":{"movingAverages":8,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":6,"fibonacciRetracement":7,"bollingerBands":7,"overallTrend":"upward","riskLevel":2,"overallRisk":["medium","low","medium","low"],"decision":"BUY","epic":"CS.D.USCGC.TODAY.IP"},"open_position":true,"epic":"CS.D.USCGC.TODAY.IP"}