{"results":[{"summary":"The technical analysis indicates a **bearish** trend for the stock. The Moving Averages analysis indicates a **bearish** trend, with a score of 2 out of 10. The MACD analysis indicates a **neutral** trend, with a score of 5 out of 10. The RSI analysis indicates a **bearish** trend, with a score of 3 out of 10. The Fibonacci Retracement analysis indicates a **bearish** trend, with a score of 2 out of 10. The Bollinger Bands analysis indicates a **bearish** trend, with a score of 3 out of 10. Overall, the technical analysis indicates a **bearish** trend for the stock, with a risk level of **4** (out of 5) and overall risk of **high**. A **SELL** decision is advised.","movingAverages":2,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":3,"fibonacciRetracement":2,"bollingerBands":3,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"SELL","epic":"CS.D.USCGC.TODAY.IP"},{"summary":"The technical analysis indicates a bearish trend for this stock. The moving averages analysis indicates a strong bearish trend, with the stock price below both the 10-day and 20-day moving averages. The MACD indicator also shows a strong bearish trend, with the MACD line below the signal line and the histogram bars decreasing in size. The RSI indicator is below 30, which indicates that the stock is oversold and could be due for a rebound. The Fibonacci retracement analysis shows that the stock price is currently trading at the 61.8% retracement level, which is a potential support level. The Bollinger Bands indicator shows that the stock price is trading near the lower Bollinger Band, which is another sign of a bearish trend. Overall, the technical analysis indicates that the stock is in a bearish trend and could continue to decline in the short term. However, the RSI indicator suggests that the stock could be due for a rebound, so traders should watch for signs of a reversal in the near future.","movingAverages":0,"movingAveragesConvergenceDivergence":2,"relativeStrengthIndex":2,"fibonacciRetracement":6,"bollingerBands":0,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"SELL","epic":"CS.D.USCGC.TODAY.IP"},{"summary":"The stock's price action over the last 24h has been largely negative, with the price opening at 2459.09 and closing at 2452.31.  The intraday high was 2461.76 and the low was 2451.69. The price action over the last 5 days has also been largely negative, with the price opening at 2474.05 on July 13th and closing at 2452.31 on July 19th. The intraday high over the last 5 days was 2483.6 and the low was 2441.12. The overall trend for the stock is downward, and the risk level is 5 out of 5. The overall risk is high. The decision is to SELL.","movingAverages":3,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":5,"overallTrend":"downward","riskLevel":5,"overallRisk":"high","decision":"SELL","epic":"CS.D.USCGC.TODAY.IP"},{"summary":"The stock is in a neutral trend. The moving averages are indicating a positive trend, while the MACD and RSI are indicating a neutral trend. The Bollinger Bands are indicating a negative trend. The overall risk level is 0 out of 5, which indicates a low risk of loss. The overall risk is low. The decision is HOLD.","movingAverages":4,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":5,"fibonacciRetracement":6,"bollingerBands":2,"overallTrend":"neutral","riskLevel":0,"overallRisk":"low","decision":"HOLD","epic":"CS.D.USCGC.TODAY.IP"},{"summary":"The overall trend of the stock is neutral. The moving averages, MACD and relative strength index are all indicating a neutral trend. The Fibonacci Retracement is suggesting that the stock is currently trading at a support level. The Bollinger Bands are indicating that the stock is trading within a neutral range.\n\nThe risk level of the stock is low. The overall risk is low.\n\nThe decision is to HOLD.","movingAverages":7,"movingAveragesConvergenceDivergence":5,"relativeStrengthIndex":5,"fibonacciRetracement":7,"bollingerBands":7,"overallTrend":"neutral","riskLevel":1,"overallRisk":"low","decision":"HOLD","epic":"CS.D.USCGC.TODAY.IP"}],"findings":{"movingAverages":3,"movingAveragesConvergenceDivergence":4,"relativeStrengthIndex":4,"fibonacciRetracement":5,"bollingerBands":3,"overallTrend":"downward","riskLevel":3,"overallRisk":"high","decision":"SELL","epic":"CS.D.USCGC.TODAY.IP"},"open_position":false,"epic":"CS.D.USCGC.TODAY.IP"}