{"results":[{"summary":"The Moving Averages indicator gives a score of 7/10. The Moving Averages Convergence Divergence indicator gives a score of 6/10. The Relative Strength Index indicator gives a score of 7/10. The Fibonacci Retracement indicator gives a score of 4/10. The Bollinger Bands indicator gives a score of 9/10. The overall trend for the stock is neutral. The overall risk is medium and the risk level is 3 out of 5. The decision is HOLD","movingAverages":7,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":7,"fibonacciRetracement":4,"bollingerBands":9,"overallTrend":"neutral","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CS.D.USCGC.TODAY.IP"},{"summary":"The stock price has been on a downward trend for the past few days. The moving averages are also indicating a downward trend. The MACD is also indicating a sell signal. The RSI is in the oversold territory. The Fibonacci retracement levels are also indicating a sell signal. The Bollinger Bands are also indicating a sell signal. Overall, the technical analysis is indicating that the stock price is likely to continue to decline in the short term. The overall risk is low, and the overall risk level is medium.","movingAverages":0,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":0,"fibonacciRetracement":0,"bollingerBands":0,"overallTrend":"downward","riskLevel":1,"overallRisk":"medium","decision":"SELL"},{"summary":"The moving averages for the last 20 days show a downward trend. The technical indicator MACD, which is used to identify changes in the momentum of a trend, also shows a downward trend. The relative strength index (RSI) suggests that the stock is oversold. The Fibonacci retracement levels indicate that the stock is currently trading at a support level. The Bollinger bands show that the stock is trading within the lower Bollinger band, which indicates that the stock is oversold. Overall, the technical analysis indicates that the stock is in a downward trend and is likely to continue to decline in the short term.","movingAverages":7,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":9,"fibonacciRetracement":8,"bollingerBands":9,"overallTrend":"downward","riskLevel":4,"overallRisk":"high","decision":"HOLD","epic":"CS.D.USCGC.TODAY.IP"},{"summary":"Based on the five technical analysis methods, the overall trend of the stock is upwards. The moving averages indicate a slightly positive trend, with a score of 6 out of 10. The moving averages convergence divergence (MACD) also indicates a positive trend, with a score of 8 out of 10. The relative strength index (RSI) is in the neutral range, with a score of 5 out of 10. The Fibonacci retracement indicates a potential upside target of 2437.39, with a score of 7 out of 10. The Bollinger Bands indicate a period of high volatility, with a score of 9 out of 10. Overall, the technical analysis suggests that the stock is in a bullish trend with high volatility. The risk level is 2 out of 5, indicating a moderate level of risk. The overall risk is medium.","movingAverages":6,"movingAveragesConvergenceDivergence":8,"relativeStrengthIndex":5,"fibonacciRetracement":7,"bollingerBands":9,"overallTrend":"upward","riskLevel":2,"overallRisk":"medium","decision":"BUY","epic":"CS.D.USCGC.TODAY.IP"}],"findings":{"movingAverages":5,"movingAveragesConvergenceDivergence":6,"relativeStrengthIndex":5,"fibonacciRetracement":5,"bollingerBands":7,"overallTrend":"downward","riskLevel":3,"overallRisk":"medium","decision":"HOLD","epic":"CS.D.USCGC.TODAY.IP"},"open_position":false,"epic":"CS.D.USCGC.TODAY.IP"}