{"results":[{"summary":"The Moving Averages, MACD and Fibonacci Retracement methods have given positive results and are pointing towards an upward trend for this stock. The RSI has given a neutral result which means neither a strong buy or strong sell is suggested by the RSI. The Bollinger Bands method has given a slightly negative result but the volatility is low so it is not a strong negative. Overall, the sentiment for this stock is positive and an upward trend is likely.","movingAverages":8,"movingAveragesConvergenceDivergence":9,"relativeStrengthIndex":5,"fibonacciRetracement":7,"bollingerBands":4,"overallTrend":"upward","riskLevel":2,"overallRisk":"low","decision":"BUY"},{"summary":"The Moving Averages indicate that the stock price may go up with a score of 10. The MACD indicator suggests that the stock price is in a downtrend with a score of 0. The RSI indicator shows that the stock is oversold with a score of 0. The Fibonacci Retracement indicates that the stock price may retrace to the 38.2% level with a score of 0. The Bollinger Bands indicator shows that the stock price is not overbought or oversold with a score of 5. The overall trend is neutral. The overall risk is low with a level of 0 out of 5. The decision is to HOLD.","movingAverages":10,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":0,"fibonacciRetracement":0,"bollingerBands":5,"overallTrend":"neutral","riskLevel":0,"overallRisk":"low","decision":"HOLD","epic":"CS.D.USCGC.TODAY.IP"},{"summary":"The overall consensus from the technical analysis is that the stock price may start to make a downward trend. The Moving Averages indicator is indicating a sell, the MACD is indicating a sell, the RSI is indicating a strong sell, the Fibonacci Retracement is indicating a sell, and the Bollinger Bands is indicating a hold. The overall risk is medium, and the overallRisk is medium. Given the overallRisk is medium, the decision is to HOLD.","movingAverages":0,"movingAveragesConvergenceDivergence":0,"relativeStrengthIndex":0,"fibonacciRetracement":0,"bollingerBands":0,"overallTrend":"downward","riskLevel":0,"overallRisk":"medium","decision":"HOLD","epic":"CS.D.USCGC.TODAY.IP"}],"findings":{"movingAverages":6,"movingAveragesConvergenceDivergence":3,"relativeStrengthIndex":2,"fibonacciRetracement":2,"bollingerBands":3,"overallTrend":["upward","neutral","downward"],"riskLevel":1,"overallRisk":"low","decision":"HOLD","epic":"CS.D.USCGC.TODAY.IP"},"open_position":false,"epic":"CS.D.USCGC.TODAY.IP"}